{"id": "EUVD-2018-19651", "enisaUuid": "3d5810c3-e1a4-357e-a0d7-2f337362b97f", "description": "Huawei smart phones G9 Lite, Honor 5A, Honor 6X, Honor 8 with the versions before VNS-L53C605B120CUSTC605D103, the versions before CAM-L03C605B143CUSTC605D008, the versions before CAM-L21C10B145, the versions before CAM-L21C185B156, the versions before CAM-L21C223B133, the versions before CAM-L21C432B210, the versions before CAM-L21C464B170, the versions before CAM-L21C636B245, the versions before Berlin-L21C10B372, the versions before Berlin-L21C185B363, the versions before Berlin-L21C464B137, the versions before Berlin-L23C605B161, the versions before FRD-L09C10B387, the versions before FRD-L09C185B387, the versions before FRD-L09C432B398, the versions before FRD-L09C636B387, the versions before FRD-L19C10B387, the versions before FRD-L19C432B399, the versions before FRD-L19C636B387 have a Factory Reset Protection (FRP) bypass security vulnerability. When re-configuring the mobile phone using the factory reset protection (FRP) function, an attacker can disable the boot wizard by enable the talkback function. As a result, the FRP function is bypassed.", "datePublished": "2018-09-12T15:00:00", "dateUpdated": "2024-08-05T06:37:59", "baseScore": 4.6, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:P/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N", "references": ["http://www.huawei.com/en/psirt/security-advisories/huawei-sa-20180905-01-frpbypass-en"], "aliases": ["CVE-2018-7939"], "assigner": "huawei", "epss": 0.03, "enisaIdProduct": [{"id": "ee6d78d4-f87f-3ba2-be90-49af7cc66c74", "product": {"name": "G9 Lite, Honor 5A, Honor 6X, Honor 8"}, "product_version": "The versions before VNS-L53C605B120CUSTC605D103, The versions before CAM-L03C605B143CUSTC605D008, The versions before CAM-L21C10B145, The versions before CAM-L21C185B156, The versions before CAM-L21C223B133, The versions before CAM-L21C432B210, The versions before CAM-L21C464B170, The versions before CAM-L21C636B245, The versions before Berlin-L21C10B372, The versions before Berlin-L21C185B363, The versions before Berlin-L21C464B137, The versions before Berlin-L23C605B161, The versions before FRD-L09C10B387, The versions before FRD-L09C185B387, The versions before FRD-L09C432B398, The versions before FRD-L09C636B387, The versions before FRD-L19C10B387, The versions before FRD-L19C432B399, The versions before FRD-L19C636B387,"}], "enisaIdVendor": [{"id": "1e06725e-ab9f-39ad-a038-84c2b45e0b1e", "vendor": {"name": "Huawei Technologies Co., Ltd."}}], "isExploited": false}