{"id": "EUVD-2018-14714", "enisaUuid": "b146b355-542a-3849-9177-18ecc35abc51", "description": "Vulnerability in the Oracle Financial Services Basel Regulatory Capital Internal Ratings Based Approach component of Oracle Financial Services Applications (subcomponent: Portfolio, Attribution). The supported version that is affected is 8.0.x. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Financial Services Basel Regulatory Capital Internal Ratings Based Approach. Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Financial Services Basel Regulatory Capital Internal Ratings Based Approach, attacks may significantly impact additional products. Successful attacks of this vulnerability can result in unauthorized update, insert or delete access to some of Oracle Financial Services Basel Regulatory Capital Internal Ratings Based Approach accessible data as well as unauthorized read access to a subset of Oracle Financial Services Basel Regulatory Capital Internal Ratings Based Approach accessible data. CVSS 3.0 Base Score 6.1 (Confidentiality and Integrity impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N).", "datePublished": "2018-04-19T02:00:00", "dateUpdated": "2024-10-03T20:10:52", "baseScore": 6.1, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N", "references": ["http://www.securityfocus.com/bid/103827", "http://www.securitytracker.com/id/1040693", "http://www.oracle.com/technetwork/security-advisory/cpuapr2018-3678067.html"], "aliases": ["CVE-2018-2859"], "assigner": "oracle", "epss": 0.46, "enisaIdProduct": [{"id": "d307088a-1049-3729-a83a-4a3b815a87d5", "product": {"name": "Financial Services Basel Regulatory Capital Internal Ratings Based Approach"}, "product_version": "8.0.x"}], "enisaIdVendor": [{"id": "bb30df9e-414e-3eaf-9d00-2995daef8fb7", "vendor": {"name": "Oracle Corporation"}}], "isExploited": false}