{"id": "EUVD-2018-16635", "enisaUuid": "6a1e2b3f-218f-3c65-a71e-77473f59ef05", "description": "A vulnerability has been identified in Siveillance VMS Video for Android (All versions < V12.1a (2018 R1)), Siveillance VMS Video for iOS (All versions < V12.1a (2018 R1)). Improper certificate validation could allow an attacker in a privileged network position to read data from and write data to the encrypted communication channel between the app and a server. The security vulnerability could be exploited by an attacker in a privileged network position which allows intercepting the communication channel between the affected app and a server (such as Man-in-the-Middle). Furthermore, an attacker must be able to generate a certificate that results for the validation algorithm in a checksum identical to a trusted certificate. Successful exploitation requires no user interaction. The vulnerability could allow reading data from and writing data to the encrypted communication channel between the app and a server, impacting the communication's confidentiality and integrity. At the time of advisory publication no public exploitation of this security vulnerability was known. Siemens confirms the security vulnerability and provides mitigations to resolve the security issue.", "datePublished": "2018-05-03T13:00:00", "dateUpdated": "2024-09-16T22:02:06", "baseScore": 7.4, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N", "references": ["http://www.securityfocus.com/bid/104105", "https://cert-portal.siemens.com/productcert/pdf/ssa-468514.pdf"], "aliases": ["CVE-2018-4849"], "assigner": "siemens", "epss": 0.1, "enisaIdProduct": [{"id": "6ee74fc8-8685-3920-99cb-2766af0872cd", "product": {"name": "Siveillance VMS Video for Android, Siveillance VMS Video for iOS"}, "product_version": "Siveillance VMS Video for Android : All versions < V12.1a (2018 R1)"}, {"id": "deb2fe51-4386-3e79-8601-21d52ef14c8d", "product": {"name": "Siveillance VMS Video for Android, Siveillance VMS Video for iOS"}, "product_version": "Siveillance VMS Video for iOS : All versions < V12.1a (2018 R1)"}], "enisaIdVendor": [{"id": "d3b7d580-3513-3390-9466-8e78fc07fd0f", "vendor": {"name": "Siemens AG"}}], "isExploited": false}