{"id": "EUVD-2018-1062", "enisaUuid": "7297fca7-62c2-3845-9c4a-e15ad68dacd4", "description": "A vulnerability in the egress packet processing functionality of the Cisco StarOS operating system for Cisco Aggregation Services Router (ASR) 5700 Series devices and Virtualized Packet Core (VPC) System Software could allow an unauthenticated, remote attacker to cause an interface on the device to cease forwarding packets. The device may need to be manually reloaded to clear this Interface Forwarding Denial of Service condition. The vulnerability is due to the failure to properly check that the length of a packet to transmit does not exceed the maximum supported length of the network interface card (NIC). An attacker could exploit this vulnerability by sending a crafted IP packet or a series of crafted IP fragments through an interface on the targeted device. A successful exploit could allow the attacker to cause the network interface to cease forwarding packets. This vulnerability could be triggered by either IPv4 or IPv6 network traffic. This vulnerability affects the following Cisco products when they are running the StarOS operating system and a virtual interface card is installed on the device: Aggregation Services Router (ASR) 5700 Series, Virtualized Packet Core-Distributed Instance (VPC-DI) System Software, Virtualized Packet Core-Single Instance (VPC-SI) System Software. Cisco Bug IDs: CSCvf32385.", "datePublished": "2018-04-19T20:00:00", "dateUpdated": "2024-11-29T15:17:20", "baseScore": 7.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H", "references": ["https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180418-staros", "http://www.securityfocus.com/bid/103923", "http://www.securitytracker.com/id/1040720"], "aliases": ["CVE-2018-0239"], "assigner": "cisco", "epss": 2.7, "enisaIdProduct": [], "enisaIdVendor": [{"id": "a8412e76-bbcb-3439-a6b5-a7aa885bf87e", "vendor": {"name": "n/a"}}], "isExploited": false}