{"id": "EUVD-2018-8928", "enisaUuid": "8e77209e-a37e-3264-ac9b-6d07928c7919", "description": "It was discovered that the Western Digital My Cloud device before 2.30.196 is affected by an authentication bypass vulnerability. An unauthenticated attacker can exploit this vulnerability to authenticate as an admin user without needing to provide a password, thereby gaining full control of the device. (Whenever an admin logs into My Cloud, a server-side session is created that is bound to the user's IP address. After the session is created, it is possible to call authenticated CGI modules by sending the cookie username=admin in the HTTP request. The invoked CGI will check if a valid session is present and bound to the user's IP address.) It was found that it is possible for an unauthenticated attacker to create a valid session without a login. The network_mgr.cgi CGI module contains a command called \"cgi_get_ipv6\" that starts an admin session -- tied to the IP address of the user making the request -- if the additional parameter \"flag\" with the value \"1\" is provided. Subsequent invocation of commands that would normally require admin privileges now succeed if an attacker sets the username=admin cookie.", "datePublished": "2018-09-18T00:00:00", "dateUpdated": "2024-08-05T10:39:59", "baseScore": 9.8, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H", "references": ["https://packetstormsecurity.com/files/cve/CVE-2018-17153", "http://www.securityfocus.com/bid/105359", "https://securify.nl/nl/advisory/SFY20180102/authentication-bypass-vulnerability-in-western-digital-my-cloud-allows-escalation-to-admin-privileges.html", "https://support.wdc.com/knowledgebase/answer.aspx?ID=25952", "http://packetstormsecurity.com/files/173802/Western-Digital-MyCloud-Unauthenticated-Command-Injection.html"], "aliases": ["CVE-2018-17153"], "assigner": "mitre", "epss": 92.2, "enisaIdProduct": [{"id": "46377c50-5e47-3c08-ad29-6697ef50fad6", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "8e4bce22-d02a-3a0a-950e-ba32653fe723", "vendor": {"name": "n/a"}}], "isExploited": false}