{"id": "EUVD-2018-3143", "enisaUuid": "53e4f303-f2ce-30d1-b32c-219af2e01b30", "description": "Open Whisper Signal (aka Signal-Desktop) through 1.10.1 allows XSS via a resource location specified in an attribute of a SCRIPT, IFRAME, or IMG element, leading to JavaScript execution after a reply, a different vulnerability than CVE-2018-10994. The attacker needs to send HTML code directly as a message, and then reply to that message to trigger this vulnerability. The Signal-Desktop software fails to sanitize specific HTML elements that can be used to inject HTML code into remote chat windows when replying to an HTML message. Specifically the IMG and IFRAME elements can be used to include remote or local resources. For example, the use of an IFRAME element enables full code execution, allowing an attacker to download/upload files, information, etc. The SCRIPT element was also found to be injectable. On the Windows operating system, the CSP fails to prevent remote inclusion of resources via the SMB protocol. In this case, remote execution of JavaScript can be achieved by referencing the script on an SMB share within an IFRAME element, for example: <IFRAME src=\\\\DESKTOP-XXXXX\\Temp\\test.html> and then replying to it. The included JavaScript code is then executed automatically, without any interaction needed from the user. The vulnerability can be triggered in the Signal-Desktop client by sending a specially crafted message and then replying to it with any text or content in the reply (it doesn't matter).", "datePublished": "2018-05-17T19:00:00", "dateUpdated": "2024-08-05T07:54:36", "baseScore": 6.1, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N", "references": ["https://packetstormsecurity.com/files/cve/CVE-2018-11101", "http://seclists.org/fulldisclosure/2018/May/46"], "aliases": ["CVE-2018-11101"], "assigner": "mitre", "epss": 0.43, "enisaIdProduct": [{"id": "d9fba30a-df86-35d6-84d9-2ef8b059c45b", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "f553193d-b44a-39e5-bc8c-2c1822bc4d1d", "vendor": {"name": "n/a"}}], "isExploited": false}