{"id": "EUVD-2018-15089", "enisaUuid": "9bd8295f-9c4e-3da1-9b79-640c7b8f06f8", "description": "Vulnerability in the Oracle Outside In Technology component of Oracle Fusion Middleware (subcomponent: Outside In Filters). The supported version that is affected are 8.5.3 and 8.5.4. Easily exploitable vulnerability allows unauthenticated attacker with network access via HTTP to compromise Oracle Outside In Technology. Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of Oracle Outside In Technology and unauthorized read access to a subset of Oracle Outside In Technology accessible data. Note: Outside In Technology is a suite of software development kits (SDKs). The protocol and CVSS score depend on the software that uses the Outside In Technology code. The CVSS score assumes that the software passes data received over a network directly to Outside In Technology code, but if data is not received over a network the CVSS score may be lower. CVSS 3.0 Base Score 7.1 (Confidentiality and Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:H).", "datePublished": "2018-10-17T01:00:00", "dateUpdated": "2024-10-02T19:33:08", "baseScore": 7.1, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:H", "references": ["http://www.securityfocus.com/bid/105603", "http://www.oracle.com/technetwork/security-advisory/cpuoct2018-4428296.html"], "aliases": ["CVE-2018-3234"], "assigner": "oracle", "epss": 0.79, "enisaIdProduct": [{"id": "448618ca-52c6-3328-8f12-24b49dc83cde", "product": {"name": "Outside In Technology"}, "product_version": "8.5.4"}, {"id": "6215f081-ccff-3809-bcf9-a236ca7d2c67", "product": {"name": "Outside In Technology"}, "product_version": "8.5.3"}], "enisaIdVendor": [{"id": "2b240f00-c44e-30e3-b008-4336857d9521", "vendor": {"name": "Oracle Corporation"}}], "isExploited": false}