{"id": "EUVD-2018-1063", "enisaUuid": "00021416-5593-34fa-88d4-35dd2ce0c92f", "description": "Multiple vulnerabilities in the Application Layer Protocol Inspection feature of Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to trigger a reload of an affected device, resulting in a denial of service (DoS) condition. The vulnerabilities are due to logical errors during traffic inspection. An attacker could exploit these vulnerabilities by sending a high volume of malicious traffic across an affected device. An exploit could allow the attacker to cause a deadlock condition, resulting in a reload of an affected device. These vulnerabilities affect Cisco ASA Software and Cisco FTD Software configured for Application Layer Protocol Inspection running on the following Cisco products: 3000 Series Industrial Security Appliance (ISA), ASA 5500 Series Adaptive Security Appliances, ASA 5500-X Series Next-Generation Firewalls, ASA Services Module for Cisco Catalyst 6500 Series Switches and Cisco 7600 Series Routers, Adaptive Security Virtual Appliance (ASAv), Firepower 2100 Series Security Appliance, Firepower 4100 Series Security Appliance, Firepower 9300 ASA Security Module, FTD Virtual (FTDv). Cisco Bug IDs: CSCve61540, CSCvh23085, CSCvh95456.", "datePublished": "2018-04-19T20:00:00", "dateUpdated": "2024-11-29T15:17:08", "baseScore": 8.6, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H", "references": ["https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180418-asa_inspect", "http://www.securitytracker.com/id/1040722", "http://www.securityfocus.com/bid/103934", "https://ics-cert.us-cert.gov/advisories/ICSA-18-184-01"], "aliases": ["CVE-2018-0240"], "assigner": "cisco", "epss": 1.59, "enisaIdProduct": [], "enisaIdVendor": [{"id": "da939e16-50e0-3a93-93c7-6c03da1d4618", "vendor": {"name": "n/a"}}], "isExploited": false}