{"id": "EUVD-2018-3482", "enisaUuid": "5f374ad7-49ba-3941-9a95-7784ff06150c", "description": "A vulnerability has been identified in Firmware variant IEC 61850 for EN100 Ethernet module (All versions < V4.33), Firmware variant PROFINET IO for EN100 Ethernet module (All versions), Firmware variant Modbus TCP for EN100 Ethernet module (All versions), Firmware variant DNP3 TCP for EN100 Ethernet module (All versions), Firmware variant IEC104 for EN100 Ethernet module (All versions < V1.22), SIPROTEC 5 relays with CPU variants CP300 and CP100 and the respective Ethernet communication modules (All versions < V7.80), SIPROTEC 5 relays with CPU variants CP200 and the respective Ethernet communication modules (All versions < V7.58). Specially crafted packets to port 102/tcp could cause a denial-of-service condition in the affected products. A manual restart is required to recover the EN100 module functionality of the affected devices. Successful exploitation requires an attacker with network access to send multiple packets to the affected products or modules. As a precondition the IEC 61850-MMS communication needs to be activated on the affected products or modules. No user interaction or privileges are required to exploit the vulnerability. The vulnerability could allow causing a Denial-of-Service condition of the network functionality of the device, compromising the availability of the system. At the time of advisory publication no public exploitation of this security vulnerability was known.", "datePublished": "2018-07-23T21:00:00", "dateUpdated": "2024-08-05T08:10:14", "baseScore": 7.5, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H", "references": ["https://cert-portal.siemens.com/productcert/pdf/ssa-635129.pdf", "https://cert-portal.siemens.com/productcert/pdf/ssa-325546.pdf", "https://www.securityfocus.com/bid/106221"], "aliases": ["CVE-2018-11451"], "assigner": "siemens", "epss": 0.62, "enisaIdProduct": [{"id": "08ea3f84-7d83-33df-bb79-64cf6fffa091", "product": {"name": "SIPROTEC 5 relays with CPU variants CP300 and CP100 and the respective Ethernet communication modules"}, "product_version": "All versions < V7.80"}, {"id": "10cedcce-a2f0-3d8c-863b-d34ac90decb6", "product": {"name": "Firmware variant PROFINET IO for EN100 Ethernet module"}, "product_version": "All versions"}, {"id": "1451efc3-5eb1-3cc5-8a8a-b85cf235e02c", "product": {"name": "Firmware variant IEC104 for EN100 Ethernet module"}, "product_version": "All versions < V1.22"}, {"id": "7436f4cb-4fdd-3f20-9c17-10053554eaab", "product": {"name": "Firmware variant IEC 61850 for EN100 Ethernet module"}, "product_version": "All versions < V4.33"}, {"id": "8decf07e-f3ce-3546-a55a-c3d0af51a763", "product": {"name": "Firmware variant Modbus TCP for EN100 Ethernet module"}, "product_version": "All versions"}, {"id": "f6358699-8c8c-3847-992c-98810dcbf695", "product": {"name": "Firmware variant DNP3 TCP for EN100 Ethernet module"}, "product_version": "All versions"}, {"id": "fae63698-aaae-370d-81a3-15d4af3dc916", "product": {"name": "SIPROTEC 5 relays with CPU variants CP200 and the respective Ethernet communication modules"}, "product_version": "All versions < V7.58"}], "enisaIdVendor": [{"id": "d1bbe2fa-88b7-3b82-8447-9c31dcfc7de0", "vendor": {"name": "Siemens AG"}}], "isExploited": false}