{"id": "EUVD-2018-15066", "enisaUuid": "5aa28edf-8469-345d-9e18-e14b5e86f9f1", "description": "Vulnerability in the Java SE, Java SE Embedded component of Oracle Java SE (subcomponent: Serviceability). Supported versions that are affected are Java SE: 8u182 and 11; Java SE Embedded: 8u181. Easily exploitable vulnerability allows low privileged attacker with logon to the infrastructure where Java SE, Java SE Embedded executes to compromise Java SE, Java SE Embedded. Successful attacks require human interaction from a person other than the attacker. Successful attacks of this vulnerability can result in unauthorized creation, deletion or modification access to critical data or all Java SE, Java SE Embedded accessible data as well as unauthorized access to critical data or complete access to all Java SE, Java SE Embedded accessible data. Note: This vulnerability applies to Java deployments, typically in clients running sandboxed Java Web Start applications or sandboxed Java applets (in Java SE 8), that load and run untrusted code (e.g., code that comes from the internet) and rely on the Java sandbox for security. This vulnerability does not apply to Java deployments, typically in servers, that load and run only trusted code (e.g. code installed by an administrator). This vulnerability can only be exploited when Java Usage Tracker functionality is being used. CVSS 3.0 Base Score 6.6 (Confidentiality and Integrity impacts). CVSS Vector: (CVSS:3.0/AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:N).", "datePublished": "2018-10-17T01:00:00", "dateUpdated": "2024-10-02T19:35:49", "baseScore": 6.6, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:N", "references": ["https://www.suse.com/security/cve/CVE-2018-3211.html", "https://access.redhat.com/errata/RHSA-2018:3003", "https://access.redhat.com/errata/RHSA-2018:3002", "https://security.netapp.com/advisory/ntap-20181018-0001/", "http://www.oracle.com/technetwork/security-advisory/cpuoct2018-4428296.html", "http://www.securityfocus.com/bid/105591", "http://www.securitytracker.com/id/1041889", "https://security.gentoo.org/glsa/201908-10"], "aliases": ["CVE-2018-3211"], "assigner": "oracle", "epss": 0.19, "enisaIdProduct": [{"id": "8795cd5c-4ea1-3255-b9ae-1c679f7c6446", "product": {"name": "Java"}, "product_version": "Java SE Embedded: 8u181"}, {"id": "b95c4bc5-1e45-3a4f-9854-75bef216eb13", "product": {"name": "Java"}, "product_version": "Java SE: 8u181, 11"}], "enisaIdVendor": [{"id": "110a1b33-2da5-37de-ae17-1dc0782e78ab", "vendor": {"name": "Oracle Corporation"}}], "isExploited": false}