{"id": "EUVD-2018-18346", "enisaUuid": "b9aead7c-680d-3f65-8afa-2ccb8dbfa4e5", "description": "An issue was discovered on Orbic Wonder Orbic/RC555L/RC555L:7.1.2/N2G47H/329100b:user/release-keys devices, allowing attackers to obtain sensitive information (such as text-message content) by reading a copy of the Android log on the SD card. The system-wide Android logs are not directly available to third-party apps since they tend to contain sensitive data. Third-party apps can read from the log but only the log messages that the app itself has written. Certain apps can leak data to the Android log due to not sanitizing log messages, which is in an insecure programming practice. Pre-installed system apps and apps that are signed with the framework key can read from the system-wide Android log. We found a pre-installed app on the Orbic Wonder that when started via an Intent will write the Android log to the SD card, also known as external storage, via com.ckt.mmitest.MmiMainActivity. Any app that requests the READ_EXTERNAL_STORAGE permission can read from the SD card. Therefore, a local app on the device can quickly start a specific component in the pre-installed system app to have the Android log written to the SD card. Therefore, any app co-located on the device with the READ_EXTERNAL_STORAGE permission can obtain the data contained within the Android log and continually monitor it and mine the log for relevant data. In addition, the default messaging app (com.android.mms) writes the body of sent and received text messages to the Android log, as well as the recipient phone number for sent text messages and the sending phone number for received text messages. In addition, any call data contains phone numbers for sent and received calls.", "datePublished": "2018-08-29T19:00:00", "dateUpdated": "2024-08-05T06:10:10", "baseScore": 5.5, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N", "references": ["https://www.kryptowire.com/portal/android-firmware-defcon-2018/"], "aliases": ["CVE-2018-6599"], "assigner": "mitre", "epss": 0.06, "enisaIdProduct": [{"id": "1f9022d8-995a-38a0-9a99-ddc66c5efbb4", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "529b3e4e-d696-38f8-bcc3-932a518dae32", "vendor": {"name": "n/a"}}], "isExploited": false}