{"id": "EUVD-2019-9342", "enisaUuid": "50a7d98e-6f9c-3ff5-a789-da0c2325877b", "description": "Electronic Arts Origin 10.5.55.33574 is vulnerable to local privilege escalation due to arbitrary directory DACL manipulation, a different issue than CVE-2019-19247 and CVE-2019-19248. When Origin.exe connects to the named pipe OriginClientService, the privileged service verifies the client's executable file instead of its in-memory process (which can be significantly different from the executable file due to, for example, DLL injection). Data transmitted over the pipe is encrypted using a static key. Instead of hooking the pipe communication directly via WriteFileEx(), this can be bypassed by hooking the EVP_EncryptUpdate() function of libeay32.dll. The pipe takes the command CreateDirectory to create a directory and adjust the directory DACL. Calls to this function can be intercepted, the directory and the DACL can be replaced, and the manipulated DACL is written. Arbitrary DACL write is further achieved by creating a hardlink in a user-controlled directory that points to (for example) a service binary. The DACL is then written to this service binary, which results in escalation of privileges.", "datePublished": "2020-02-20T15:44:15", "dateUpdated": "2024-08-05T02:25:12", "baseScore": 7.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H", "references": ["https://medium.com/@tobiasgyoerfi/ea-origin-10-5-55-33574-createdirectory-arbitrary-dacl-write-privilege-escalation-cve-2019-19741-5f18adfabb27", "https://medium.com/%40tobiasgyoerfi/ea-origin-10-5-55-33574-createdirectory-arbitrary-dacl-write-privilege-escalation-cve-2019-19741-5f18adfabb27"], "aliases": ["CVE-2019-19741"], "assigner": "mitre", "epss": 0.06, "enisaIdProduct": [{"id": "0c6adadb-a3f3-3d8e-ab2e-9ed9f63e5e06", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "2911f73e-0730-352c-ba71-66564237eee0", "vendor": {"name": "n/a"}}], "isExploited": false}