{"id": "EUVD-2019-3535", "enisaUuid": "fe185f6a-332c-3b1b-91f3-bd7cb805ca4e", "description": "In AutomateAppCore.dll in Blue Prism Robotic Process Automation 6.4.0.8445, a vulnerability in access control can be exploited to escalate privileges. The vulnerability allows for abusing the application for fraud or unauthorized access to certain information. The attack requires a valid user account to connect to the Blue Prism server, but the roles associated to this account are not required to have any permissions. First of all, the application files are modified to grant full permissions on the client side. In a test environment (or his own instance of the software) an attacker is able to grant himself full privileges also on the server side. He can then, for instance, create a process with malicious behavior and export it to disk. With the modified client, it is possible to import the exported file as a release and overwrite any existing process in the database. Eventually, the bots execute the malicious process. The server does not check the user's permissions for the aforementioned actions, such that a modification of the client software enables this kind of attack. Possible scenarios may involve changing bank accounts or setting passwords.", "datePublished": "2019-05-24T15:55:31", "dateUpdated": "2024-08-04T23:03:32", "baseScore": 8.8, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H", "references": ["https://packetstormsecurity.com/files/cve/CVE-2019-11875", "https://www.syss.de/fileadmin/dokumente/Publikationen/Advisories/SYSS-2019-002.txt", "http://packetstormsecurity.com/files/153007/Blue-Prism-Robotic-Process-Automation-RPA-Privilege-Escalation.html"], "aliases": ["CVE-2019-11875"], "assigner": "mitre", "epss": 0.34, "enisaIdProduct": [{"id": "500d7cde-3bc4-384e-b334-f34bc8efacca", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "1445fb00-2109-3b9b-a019-73a20a995b4f", "vendor": {"name": "n/a"}}], "isExploited": false}