{"id": "EUVD-2019-10397", "enisaUuid": "90304d14-5948-3375-a00e-40245c1b5f0e", "description": "A vulnerability in the DHCPv6 input packet processor of Cisco Prime Network Registrar could allow an unauthenticated, remote attacker to restart the server and cause a denial of service (DoS) condition on the affected system. The vulnerability is due to incomplete user-supplied input validation when a custom extension attempts to change a DHCPv6 packet received by the application. An attacker could exploit this vulnerability by sending malformed DHCPv6 packets to the application. An exploit could allow the attacker to trigger a restart of the service which, if exploited repeatedly, might lead to a DoS condition. This vulnerability can only be exploited if the administrator of the server has previously installed custom extensions that attempt to modify the packet details before the packet has been processed. Note: Although the CVSS score matches a High SIR, this has been lowered to Medium because this condition will only affect an application that has customer-developed extensions that will attempt to modify packet parameters before the packet has been completely sanitized. If packet modification in a custom extension happens after the packet has been sanitized, the application will not be affected by this vulnerability. Software versions prior to 8.3(7) and 9.1(2) are affected.", "datePublished": "2019-04-18T01:25:14", "dateUpdated": "2024-11-19T19:10:35", "baseScore": 8.6, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:C/C:N/I:N/A:H", "references": ["https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20190417-pnr-dos", "http://www.securityfocus.com/bid/108033"], "aliases": ["CVE-2019-1840"], "assigner": "cisco", "epss": 0.53, "enisaIdProduct": [{"id": "4fb1d47b-27da-3280-94ae-ce9372eb868a", "product": {"name": "Cisco Prime Network Registrar"}, "product_version": "unspecified <8.3(7)"}, {"id": "f05fe36e-0719-3be9-9264-36d611922ad6", "product": {"name": "Cisco Prime Network Registrar"}, "product_version": "unspecified <9.1(2)"}], "enisaIdVendor": [{"id": "3c319f36-e5a6-3a92-8678-39217d45885f", "vendor": {"name": "Cisco"}}], "isExploited": false}