{"id": "EUVD-2019-6389", "enisaUuid": "6a3681cd-b1cf-3db8-a6d9-392b86bdc388", "description": "The Coolpad 1851 Android device with a build fingerprint of Coolpad/android/android:8.1.0/O11019/1534834761:userdebug/release-keys contains a pre-installed platform app with a package name of com.lovelyfont.defcontainer (versionCode=7, versionName=7.1.13). This app contains an exported service named com.lovelyfont.manager.FontCoverService that allows any app co-located on the device to supply arbitrary commands to be executed as the system user. This app cannot be disabled by the user and the attack can be performed by a zero-permission app. In addition to the local attack surface, its accompanying app with a package name of com.ekesoo.lovelyhifonts makes network requests using HTTP and an attacker can perform a Man-in-the-Middle (MITM) attack on the connection to inject a command in a network response that will be executed as the system user by the com.lovelyfont.defcontainer app. Executing commands as the system user can allow a third-party app to video record the user's screen, factory reset the device, obtain the user's notifications, read the logcat logs, inject events in the Graphical User Interface (GUI), and obtains the user's text messages, and more. Executing commands as the system user can allow a third-party app to factory reset the device, obtain the user's notifications, read the logcat logs, inject events in the GUI, change the default Input Method Editor (IME) (e.g., keyboard) with one contained within the attacking app that contains keylogging functionality, and obtains the user's text messages, and more.", "datePublished": "2019-11-14T16:25:46", "dateUpdated": "2024-08-05T00:42:03", "baseScore": 8.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H", "references": ["https://www.kryptowire.com/android-firmware-2019/"], "aliases": ["CVE-2019-15388"], "assigner": "mitre", "epss": 0.38, "enisaIdProduct": [{"id": "c3a7ce73-5684-3b84-8e5b-76d7a53ae92e", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "a89f8e47-97a3-3944-80c9-01ac7e2b591a", "vendor": {"name": "n/a"}}], "isExploited": false}