{"id": "EUVD-2019-9764", "enisaUuid": "4d0342cd-5640-3a34-bb86-36c440a5f021", "description": "A remote code execution vulnerability exists in the way that Microsoft browsers access objects in memory. The vulnerability could corrupt memory in a way that could allow an attacker to execute arbitrary code in the context of the current user. An attacker who successfully exploited the vulnerability could gain the same user rights as the current user. If the current user is logged on with administrative user rights, the attacker could take control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights.\nAn attacker could host a specially crafted website that is designed to exploit the vulnerability through Microsoft browsers, and then convince a user to view the website. The attacker could also take advantage of compromised websites, or websites that accept or host user-provided content or advertisements, by adding specially crafted content that could exploit the vulnerability. In all cases, however, an attacker would have no way to force users to view the attacker-controlled content. Instead, an attacker would have to convince users to take action, typically via an enticement in email or instant message, or by getting them to open an email attachment.\nThe security update addresses the vulnerability by modifying how Microsoft browsers handle objects in memory.\n", "datePublished": "2019-08-14T20:55:04", "dateUpdated": "2024-08-04T18:13:29", "baseScore": 6.4, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:H/UI:R/S:U/C:H/I:H/A:H/E:P/RL:O/RC:C", "references": ["https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2019-1193"], "aliases": ["CVE-2019-1193"], "assigner": "microsoft", "epss": 1.38, "enisaIdProduct": [{"id": "d88e00fe-ea28-38eb-a200-b14b05f1556d", "product": {"name": "Microsoft Edge (EdgeHTML-based)"}, "product_version": "1.0..0 <publication"}, {"id": "d8f6eb12-885e-3934-9534-a59b59f4dabe", "product": {"name": "Internet Explorer 10"}, "product_version": "1.0.0 <publication"}, {"id": "fa3ada15-f704-3ef7-abbd-e71a5c02f127", "product": {"name": "Internet Explorer 11"}, "product_version": "1.0.0 <publication"}], "enisaIdVendor": [{"id": "a86ed1d2-d52a-3ada-8228-126d36a74398", "vendor": {"name": "Microsoft"}}], "isExploited": false}