{"id": "EUVD-2019-2137", "enisaUuid": "1b0efa24-9716-3413-b4e6-224fe1b74239", "description": "In Apache Impala 2.7.0 to 3.2.0, an authenticated user with access to the IDs of active Impala queries or sessions can interact with those sessions or queries via a specially-constructed request and thereby potentially bypass authorization and audit mechanisms. Session and query IDs are unique and random, but have not been documented or consistently treated as sensitive secrets. Therefore they may be exposed in logs or interfaces. They were also not generated with a cryptographically secure random number generator, so are vulnerable to random number generator attacks that predict future IDs based on past IDs. Impala deployments with Apache Sentry or Apache Ranger authorization enabled may be vulnerable to privilege escalation if an authenticated attacker is able to hijack a session or query from another authenticated user with privileges not assigned to the attacker. Impala deployments with audit logging enabled may be vulnerable to incorrect audit logging as a user could undertake actions that were logged under the name of a different authenticated user. Constructing an attack requires a high degree of technical sophistication and access to the Impala system as an authenticated user.", "datePublished": "2019-11-05T19:30:14", "dateUpdated": "2024-08-04T22:10:09", "baseScore": 7.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H", "references": ["http://www.openwall.com/lists/oss-security/2019/11/04/1", "https://lists.apache.org/thread.html/ee73dd8dc38ac3b3b132c79c9a02cf9524af9aa11190474c0ebd1f13@%3Cdev.impala.apache.org%3E", "https://lists.apache.org/thread.html/ee73dd8dc38ac3b3b132c79c9a02cf9524af9aa11190474c0ebd1f13%40%3Cdev.impala.apache.org%3E"], "aliases": ["CVE-2019-10084"], "assigner": "apache", "epss": 0.1, "enisaIdProduct": [{"id": "fa4b988f-0a7b-316d-9542-5dd73e81a922", "product": {"name": "Impala"}, "product_version": "2.7.0 to 3.2.0"}], "enisaIdVendor": [{"id": "6179b58b-7a03-3e29-9f0f-ba9c5692f096", "vendor": {"name": "Apache Software Foundation"}}], "isExploited": false}