{"id": "EUVD-2019-13361", "enisaUuid": "bd449c00-a0c2-3beb-bdc8-47f990bea602", "description": "An Uncontrolled Search Path Vulnerability is applicable to the following: Dell Update Package (DUP) Framework file versions prior to 19.1.0.413, and Framework file versions prior to 103.4.6.69 used in Dell EMC Servers. Dell Update Package (DUP) Framework file versions prior to 3.8.3.67 used in Dell Client Platforms. The vulnerability is limited to the DUP framework during the time window when a DUP is being executed by an administrator. During this time window, a locally authenticated low privilege malicious user potentially could exploit this vulnerability by tricking an administrator into running a trusted binary, causing it to load a malicious DLL and allowing the attacker to execute arbitrary code on the victim system. The vulnerability does not affect the actual binary payload that the DUP delivers.", "datePublished": "2019-09-24T15:31:31", "dateUpdated": "2024-09-16T17:58:10", "baseScore": 6.7, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:L/AC:H/PR:L/UI:R/S:U/C:H/I:H/A:H", "references": ["https://www.dell.com/support/article/SLN318693"], "aliases": ["CVE-2019-3726"], "assigner": "dell", "epss": 0.06, "enisaIdProduct": [{"id": "0111915b-b84b-38d7-b501-5bac21e57f2b", "product": {"name": "Dell EMC Servers: Networking and Fibre Channel Drivers: Dell Update Package (DUP) Framework file"}, "product_version": "unspecified <103.4.6.69"}, {"id": "61de3412-134e-333e-b48d-052c9ab62898", "product": {"name": "Dell EMC Servers: all other Drivers, BIOS and Firmware: Dell Update Package (DUP) Framework file"}, "product_version": "unspecified <19.1.0.413"}, {"id": "8fb39c78-6664-3821-baa0-4fd4906e8a6a", "product": {"name": "Dell Client Platforms: Dell Update Packages (DUP) Framework file"}, "product_version": "unspecified <3.8.3.67"}], "enisaIdVendor": [{"id": "30fdaec6-5263-3b7f-b186-cb34d91264f1", "vendor": {"name": "Dell EMC"}}, {"id": "433044ef-b179-3b87-bad3-d0dc26298777", "vendor": {"name": "Dell"}}], "isExploited": false}