{"id": "EUVD-2019-14706", "enisaUuid": "a44dd1f0-4fbd-370c-a998-cd39092f8b6b", "description": "An exploitable information leak vulnerability exists in the ustream-ssl library of OpenWrt, versions 18.06.4 and 15.05.1. When connecting to a remote server, the server's SSL certificate is checked but no action is taken when the certificate is invalid. An attacker could exploit this behavior by performing a man-in-the-middle attack, providing any certificate, leading to the theft of all the data sent by the client during the first request.An exploitable information leak vulnerability exists in the ustream-ssl library of OpenWrt, versions 18.06.4 and 15.05.1. When connecting to a remote server, the server's SSL certificate is checked but no action is taken when the certificate is invalid. An attacker could exploit this behavior by performing a man-in-the-middle attack, providing any certificate, leading to the theft of all the data sent by the client during the first request. After an SSL connection is initialized via _ustream_ssl_init, and after any data (e.g. the client's HTTP request) is written to the stream using ustream_printf, the code eventually enters the function _ustream_ssl_poll, which is used to dispatch the read/write events", "datePublished": "2019-11-18T17:59:12", "dateUpdated": "2024-08-04T19:47:55", "baseScore": 4.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:C/C:L/I:N/A:N", "references": ["https://talosintelligence.com/vulnerability_reports/TALOS-2019-0893"], "aliases": ["CVE-2019-5101"], "assigner": "talos", "epss": 0.22, "enisaIdProduct": [{"id": "16fedad2-a832-38d4-b6b4-bfa848364963", "product": {"name": "OpenWRT"}, "product_version": "OpenWrt 15.05.1, via wget (busybox)"}, {"id": "a07cf87f-f98b-3876-8326-4773027f3c39", "product": {"name": "OpenWRT"}, "product_version": "OpenWrt 18.06.4, via wget (uclient-fetch)"}], "enisaIdVendor": [{"id": "2749d4b2-c953-3b34-8aef-e00a75bc939e", "vendor": {"name": "OpenWRT"}}], "isExploited": false}