{"id": "EUVD-2019-3357", "enisaUuid": "0b517290-5aa7-3b7e-b048-da79f9c549f8", "description": "An issue was discovered in the DICOM Part 10 File Format in the NEMA DICOM Standard 1995 through 2019b and continuing in current implementations. The 128-byte preamble of a DICOM file that complies with this specification can contain arbitrary executable headers for multiple operating systems, including Portable Executable (PE) files for Windows and Executable and Linkable Format (ELF) files for Linux-based systems. This space is left unspecified so that dual-purpose files can be created. For example, dual-purpose TIFF/DICOM files are used in digital whole slide imaging applications in medicine. This design flaw enables system-wide compromise as malicious DICOM files are routinely shared between medical devices and hospital systems and transported via removable media for patient care coordination. To exploit this vulnerability, someone must execute the maliciously crafted file. These files can be executable even with the .dcm file extension. Anti-malware configurations at healthcare facilities often ignore medical imagery. DICOM files exist on systems that process protected health information, and successful exploitation could result in violations of regulatory compliance requirements such as HIPAA and FDA postmarket obligations.", "datePublished": "2019-05-02T21:07:15", "dateUpdated": "2025-07-24T16:34:42", "baseScore": 7.8, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H", "references": ["https://labs.cylera.com/2019.04.16/pe-dicom-medical-malware", "https://github.com/d00rt/pedicom/blob/master/doc/Attacking_Digital_Imaging_and_Communication_in_Medicine_(DICOM)_file_format_standard_-_Markel_Picado_Ortiz_(d00rt).pdf", "https://github.com/d00rt/pedicom", "http://www.securityfocus.com/bid/108730", "https://github.com/d00rt/pedicom/blob/master/doc/Attacking_Digital_Imaging_and_Communication_in_Medicine_%28DICOM%29_file_format_standard_-_Markel_Picado_Ortiz_%28d00rt%29.pdf", "https://www.praetorian.com/blog/elfdicom-poc-malware-polyglot-exploiting-linux-based-medical-devices/"], "aliases": ["CVE-2019-11687"], "assigner": "mitre", "epss": 12.42, "enisaIdProduct": [{"id": "cc553fe3-7bf9-34f7-9227-1cdff866a40a", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "61df53a5-b2e9-3319-aef2-eb5b870caff1", "vendor": {"name": "n/a"}}], "isExploited": false}