{"id": "EUVD-2019-16030", "enisaUuid": "4cf65444-6bea-3d25-9784-c7eda3d016d3", "description": "There had existed in one of the ISC BIND libraries a bug in a function that was used by dhcpd when operating in DHCPv6 mode. There was also a bug in dhcpd relating to the use of this function per its documentation, but the bug in the library function prevented this from causing any harm. All releases of dhcpd from ISC contain copies of this, and other, BIND libraries in combinations that have been tested prior to release and are known to not present issues like this. Some third-party packagers of ISC software have modified the dhcpd source, BIND source, or version matchup in ways that create the crash potential. Based on reports available to ISC, the crash probability is large and no analysis has been done on how, or even if, the probability can be manipulated by an attacker. Affects: Builds of dhcpd versions prior to version 4.4.1 when using BIND versions 9.11.2 or later, or BIND versions with specific bug fixes backported to them. ISC does not have access to comprehensive version lists for all repackagings of dhcpd that are vulnerable. In particular, builds from other vendors may also be affected. Operators are advised to consult their vendor documentation.", "datePublished": "2019-11-01T22:15:33", "dateUpdated": "2024-09-17T01:25:37", "baseScore": 6.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:A/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H", "references": ["https://www.suse.com/security/cve/CVE-2019-6470.html", "https://access.redhat.com/errata/RHSA-2019:3525", "https://access.redhat.com/errata/RHSA-2019:2060", "https://ubuntu.com/security/CVE-2019-6470", "https://linux.oracle.com/cve/CVE-2019-6470.html", "https://lists.opensuse.org/opensuse-security-announce/2019-10/msg00049.html", "https://lists.opensuse.org/opensuse-security-announce/2019-10/msg00048.html", "https://bugs.debian.org/cgi-bin/bugreport.cgi?bug=896122"], "aliases": ["CVE-2019-6470"], "assigner": "isc", "epss": 0.26, "enisaIdProduct": [{"id": "083f40dd-56ae-3dd6-926e-cd63b27c9882", "product": {"name": "dhcpd"}, "product_version": "builds not wholly from ISC source < 4.4.1"}], "enisaIdVendor": [{"id": "e4dafcb7-4473-3c57-8923-a47d767e60b5", "vendor": {"name": "Multiple, non-ISC"}}], "isExploited": false}