{"id": "EUVD-2017-17368", "enisaUuid": "3002e2bb-bfaa-3ee3-9dd4-a22a6e93e6b3", "description": "An issue was discovered on D-Link DCS-1100 and DCS-1130 devices. The device runs a custom daemon on UDP port 5978 which is called \"dldps2121\" and listens for broadcast packets sent on 255.255.255.255. This daemon handles custom D-Link UDP based protocol that allows D-Link mobile applications and desktop applications to discover D-Link devices on the local network. The binary processes the received UDP packets sent from any device in \"main\" function. One path in the function traverses towards a block of code that processing of packets which does an unbounded copy operation which allows to overflow the buffer. The custom protocol created by Dlink follows the following pattern: Packetlen, Type of packet; M=MAC address of device or broadcast; D=Device Type;C=base64 encoded command string;test=1111 We can see at address function starting at address 0x0000DBF8 handles the entire UDP packet and performs an insecure copy using strcpy function at address 0x0000DC88. This results in overflowing the stack pointer after 1060 characters and thus allows to control the PC register and results in code execution. The same form of communication can be initiated by any process including an attacker process on the mobile phone or the desktop and this allows a third-party application on the device to execute commands on the device without any authentication by sending just 1 UDP packet with custom base64 encoding.", "datePublished": "2019-07-02T20:26:13", "dateUpdated": "2024-08-05T16:34:23", "baseScore": 8.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H", "references": ["https://packetstormsecurity.com/files/cve/CVE-2017-8416", "https://seclists.org/bugtraq/2019/Jun/8", "http://packetstormsecurity.com/files/153226/Dlink-DCS-1130-Command-Injection-CSRF-Stack-Overflow.html", "https://github.com/ethanhunnt/IoT_vulnerabilities/blob/master/Dlink_DCS_1130_security.pdf"], "aliases": ["CVE-2017-8416"], "assigner": "mitre", "epss": 0.54, "enisaIdProduct": [{"id": "5ed87ed3-206d-31e2-a098-f4aced2071a2", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "e690ac05-99ed-3314-b8b4-6c888c1fe235", "vendor": {"name": "n/a"}}], "isExploited": false}