{"id": "EUVD-2017-14323", "enisaUuid": "81db8c0d-0a15-3b8f-9663-1b6c7fbd7dc5", "description": "Installing a zero-permission Android application on certain Samsung Android devices with KK(4.4), L(5.0/5.1), and M(6.0) software can continually crash the system_server process in the Android OS. The zero-permission app will create an active install session for a separate app that it has embedded within it. The active install session of the embedded app is performed using the android.content.pm.PackageInstaller class and its nested classes in the Android API. The active install session will write the embedded APK file to the /data/app directory, but the app will not be installed since third-party applications cannot programmatically install apps. Samsung has modified AOSP in order to accelerate the parsing of APKs by introducing the com.android.server.pm.PackagePrefetcher class and its nested classes. These classes will parse the APKs present in the /data/app directory and other directories, even if the app is not actually installed. The embedded APK that was written to the /data/app directory via the active install session has a very large but valid AndroidManifest.xml file. Specifically, the AndroidManifest.xml file contains a very large string value for the name of a permission-tree that it declares. When system_server tries to parse the APK file of the embedded app from the active install session, it will crash due to an uncaught error (i.e., java.lang.OutOfMemoryError) or an uncaught exception (i.e., std::bad_alloc) because of memory constraints. The Samsung Android device will encounter a soft reboot due to a system_server crash, and this action will keep repeating since parsing the APKs in the /data/app directory as performed by the system_server process is part of the normal boot process. The Samsung ID is SVE-2016-6917.", "datePublished": "2017-01-09T08:48:00", "dateUpdated": "2024-08-05T14:55:35", "baseScore": 5.5, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:N/A:H", "references": ["http://security.samsungmobile.com/smrupdate.html#SMR-JAN-2017", "http://www.securityfocus.com/bid/95319"], "aliases": ["CVE-2017-5217"], "assigner": "mitre", "epss": 0.15, "enisaIdProduct": [{"id": "e661e9c0-17ba-3d37-95da-4bca6f4b5c1d", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "44af08a3-eeb4-3611-b051-641a0c473ada", "vendor": {"name": "n/a"}}], "isExploited": false}