{"id": "EUVD-2017-3910", "enisaUuid": "6678db7a-1d5b-3950-9658-08bb3ed2179f", "description": "A vulnerability in the upgrade mechanism of Cisco collaboration products based on the Cisco Voice Operating System software platform could allow an unauthenticated, remote attacker to gain unauthorized, elevated access to an affected device. The vulnerability occurs when a refresh upgrade (RU) or Prime Collaboration Deployment (PCD) migration is performed on an affected device. When a refresh upgrade or PCD migration is completed successfully, an engineering flag remains enabled and could allow root access to the device with a known password. If the vulnerable device is subsequently upgraded using the standard upgrade method to an Engineering Special Release, service update, or a new major release of the affected product, this vulnerability is remediated by that action. Note: Engineering Special Releases that are installed as COP files, as opposed to the standard upgrade method, do not remediate this vulnerability. An attacker who can access an affected device over SFTP while it is in a vulnerable state could gain root access to the device. This access could allow the attacker to compromise the affected system completely. Cisco Bug IDs: CSCvg22923, CSCvg55112, CSCvg55128, CSCvg55145, CSCvg58619, CSCvg64453, CSCvg64456, CSCvg64464, CSCvg64475, CSCvg68797.", "datePublished": "2017-11-16T07:00:00", "dateUpdated": "2024-08-05T18:36:56", "baseScore": 9.8, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H", "references": ["http://www.securityfocus.com/bid/101865", "http://www.securitytracker.com/id/1039815", "http://www.securitytracker.com/id/1039817", "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20171115-vos", "http://www.securitytracker.com/id/1039814", "http://www.securitytracker.com/id/1039818", "http://www.securitytracker.com/id/1039819", "http://www.securitytracker.com/id/1039820", "http://www.securitytracker.com/id/1039813", "http://www.securitytracker.com/id/1039816"], "aliases": ["CVE-2017-12337"], "assigner": "cisco", "epss": 12.27, "enisaIdProduct": [], "enisaIdVendor": [{"id": "317a82f5-008b-3351-93bb-484841fa3448", "vendor": {"name": "n/a"}}], "isExploited": false}