{"id": "EUVD-2017-8317", "enisaUuid": "d03eaf2a-2201-3679-bf5f-9ddc0aa5b6bd", "description": "Huawei AR100, AR100-S, AR110-S, AR120, AR120-S, AR1200, AR1200-S, AR150, AR150-S, AR160, AR200, AR200-S, AR2200, AR2200-S, AR3200, AR510, DP300, NetEngine16EX, RP200, SRG1300, SRG2300, SRG3300, TE30, TE40, TE50, TE60, TP3106, TP3206, ViewPoint 8660, and ViewPoint 9030 have an insufficient validation vulnerability. Since packet validation is insufficient, an unauthenticated attacker may send special H323 packets to exploit the vulnerability. Successful exploit could allow the attacker to send malicious packets and result in DOS attacks.", "datePublished": "2018-02-15T16:00:00", "dateUpdated": "2024-08-05T20:43:59", "baseScore": 5.9, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H", "references": ["http://www.huawei.com/en/psirt/security-advisories/huawei-sa-20171206-01-h323-en"], "aliases": ["CVE-2017-17151"], "assigner": "huawei", "epss": 0.13, "enisaIdProduct": [{"id": "d9192072-b204-3566-8e85-68a02633359e", "product": {"name": "AR100,AR100-S,AR110-S,AR120,AR120-S,AR1200,AR1200-S,AR150,AR150-S,AR160,AR200,AR200-S,AR2200,AR2200-S,AR3200,AR510,DP300,NetEngine16EX,RP200,SRG1300,SRG2300,SRG3300,TE30,TE40,TE50,TE60,TP3106,TP3206,ViewPoint 8660,ViewPoint 9030"}, "product_version": "AR100 V200R008C20SPC700, V200R008C20SPC700PWE, V200R008C20SPC800, V200R008C20SPC800PWE, V200R008C30, AR100-S V200R007C00SPCa00, V200R007C00SPCb00, V200R008C20, V200R008C20SPC700, V200R008C20SPC800, V200R008C20SPC800PWE, V200R008C30, AR110-S V200R007C00SPC600, V200R007C00SPC900, V200R007C00SPCb00, V200R008C20SPC800, V200R008C30, AR120 V200R006C10, V200R006C10SPC300, V200R006C10SPC300PWE, V200R007C00, V200R007C00PWE, V200R007C00SPC100, V200R007C00SPC200, V200R007C00SPC600, V200R007C00SPC600PWE, V200R007C00SPC900, V200R007C00SPC900PWE, V200R007C00SPCb00, V200R007C00SPCb00PWE, V200R007C01, V200R008C20, V200R008C20SPC700, V200R008C20SPC800, V200R008C30, AR120-S V200R006C10, V200R006C10SPC300, V200R007C00, V200R007C00SPC100, V200R007C00SPC200, V200R007C00SPC600, V200R007C00SPC900, V200R007C00SPCa00, V200R007C00SPCb00, V200R008C20, V200R008C20SPC700, V200R008C20SPC800, V200R008C30, AR1200 V200R006C10, V200R006C10PWE, V200R006C10SPC030, V200R006C10SPC300, V200R006C10SPC300PWE, V200R006C10SPC600, V200R ...[truncated*]"}], "enisaIdVendor": [{"id": "05777ee2-7ea8-3694-9725-5f38e4a25962", "vendor": {"name": "Huawei Technologies Co., Ltd."}}], "isExploited": false}