{"id": "EUVD-2017-3892", "enisaUuid": "a0bf4237-ea85-370b-a6a9-83f9fbfce536", "description": "A vulnerability in the Border Gateway Protocol (BGP) over an Ethernet Virtual Private Network (EVPN) for Cisco IOS XE Software could allow an unauthenticated, remote attacker to cause the device to reload, resulting in a denial of service (DoS) condition, or potentially corrupt the BGP routing table, which could result in network instability. The vulnerability exists due to changes in the implementation of the BGP MPLS-Based Ethernet VPN RFC (RFC 7432) draft between IOS XE software releases. When the BGP Inclusive Multicast Ethernet Tag Route or BGP EVPN MAC/IP Advertisement Route update packet is received, it could be possible that the IP address length field is miscalculated. An attacker could exploit this vulnerability by sending a crafted BGP packet to an affected device after the BGP session was established. An exploit could allow the attacker to cause the affected device to reload or corrupt the BGP routing table; either outcome would result in a DoS. The vulnerability may be triggered when the router receives a crafted BGP message from a peer on an existing BGP session. This vulnerability affects all releases of Cisco IOS XE Software prior to software release 16.3 that support BGP EVPN configurations. If the device is not configured for EVPN, it is not vulnerable. Cisco Bug IDs: CSCui67191, CSCvg52875.", "datePublished": "2018-03-27T09:00:00", "dateUpdated": "2025-10-21T23:45:55", "baseScore": 5.9, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H", "references": ["https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20171103-bgp", "http://www.securityfocus.com/bid/101676", "https://nvd.nist.gov/vuln/detail/CVE-2017-12319", "https://www.cisa.gov/known-exploited-vulnerabilities-catalog?field_cve=CVE-2017-12319"], "aliases": ["CVE-2017-12319"], "assigner": "cisco", "epss": 0.94, "exploitedSince": "2022-03-03T00:00:00", "enisaIdProduct": [{"id": "8ac5589c-209d-380e-bd5a-f13c765eca6c", "product": {"name": "Cisco IOS XE"}, "product_version": "Cisco IOS XE"}], "enisaIdVendor": [{"id": "f8a90bd0-7c77-38ce-a8af-e3143a0948bb", "vendor": {"name": "n/a"}}], "isExploited": true}