{"id": "EUVD-2017-6806", "enisaUuid": "0bbe02f4-08b7-30e4-9054-3d8d342d42a6", "description": "The Common Open Policy Service Protocol (COPS) module in Huawei DP300 V500R002C00, IPS Module V100R001C10, V100R001C20, V100R001C30, V500R001C00, V500R001C20, V500R001C30, V500R001C50, NGFW Module V100R001C10, V100R001C20, V100R001C30, V500R001C00, V500R001C20, NIP6300 V500R001C00, V500R001C20, V500R001C30, V500R001C50, NIP6600 V500R001C00, V500R001C20, V500R001C30, V500R001C50, NIP6800 V500R001C50, RP200 V500R002C00, V600R006C00, SVN5600 V200R003C00, V200R003C10, SVN5800 V200R003C00, V200R003C10,SVN5800-C V200R003C00, V200R003C10, Secospace USG6300 V100R001C10, V100R001C20, V100R001C30, V500R001C00, V500R001C20, V500R001C30, V500R001C50, Secospace USG6500 V100R001C10, V100R001C20, V100R001C30, V500R001C00, V500R001C20, V500R001C30, V500R001C50, Secospace USG6600 V100R001C00, V100R001C20, V100R001C30, V500R001C00, V500R001C20, V500R001C30, V500R001C50, TE30 V100R001C02, V100R001C10, V500R002C00, V600R006C00, TE40 V500R002C00, V600R006C00, TE50 V500R002C00, V600R006C00, TE60 V100R001C01, V100R001C10, V500R002C00, V600R006C00, TP3206 V100R002C00, V100R002C10,USG9500 V500R001C00, V500R001C20, V500R001C30, V500R001C50 haa a buffer overflow vulnerability. An unauthenticated, remote attacker could exploit this vulnerability by sending specially crafted message to the affected products. The vulnerability is due to insufficient input validation of the message, which could result in a buffer overflow. Successful exploit may cause some services abnormal.", "datePublished": "2018-02-15T16:00:00", "dateUpdated": "2024-08-05T19:57:25", "baseScore": 5.3, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L", "references": ["http://www.huawei.com/en/psirt/security-advisories/huawei-sa-20171206-01-buffer-en"], "aliases": ["CVE-2017-15350"], "assigner": "huawei", "epss": 0.16, "enisaIdProduct": [{"id": "b8c707b4-23be-33e8-927d-6a0baf2ee5af", "product": {"name": "DP300,IPS Module,NGFW Module,NIP6300,NIP6600,NIP6800,RP200,SVN5600,SVN5800,SVN5800-C,Secospace USG6300,Secospace USG6500,Secospace USG6600,TE30,TE40,TE50,TE60,TP3206,USG9500,"}, "product_version": "DP300 V500R002C00,IPS Module V100R001C10, V100R001C20, V100R001C30, V500R001C00, V500R001C20, V500R001C30, V500R001C50,NGFW Module V100R001C10, V100R001C20, V100R001C30, V500R001C00, V500R001C20,NIP6300 V500R001C00, V500R001C20, V500R001C30, V500R001C50,NIP6600 V500R001C00, V500R001C20, V500R001C30, V500R001C50,NIP6800 V500R001C50,RP200 V500R002C00, V600R006C00,SVN5600 V200R003C00, V200R003C10,SVN5800 V200R003C00, V200R003C10,SVN5800-C V200R003C00, V200R003C10,Secospace USG6300 V100R001C10, V100R001C20, V100R001C30, V500R001C00, V500R001C20, V500R001C30, V500R001C50,Secospace USG6500 V100R001C10, V100R001C20, V100R001C30, V500R001C00, V500R001C20, V500R001C30, V500R001C50,Secospace USG6600 V100R001C00, V100R001C20, V100R001C30, V500R001C00, V500R001C20, V500R001C30, V500R001C50,TE30 V100R001C02, V100R001C10, V500R002C00, V600R006C00,TE40 V500R002C00, V600R006C00,TE50 V500R002C00, V600R006C00,TE60 V100R001C01, V100R001C10, V500R002C00, V600R006C00,TP3206 V100R002C00, V100R002C10,USG9500 V500R00 ...[truncated*]"}], "enisaIdVendor": [{"id": "35715edb-6568-39db-9568-23f3b8f5d7c6", "vendor": {"name": "Huawei Technologies Co., Ltd."}}], "isExploited": false}