{"id": "EUVD-2017-17297", "enisaUuid": "d03a2775-2655-3e74-80ca-7cdfe31b8a71", "description": "An issue was discovered on Securifi Almond, Almond+, and Almond 2015 devices with firmware AL-R096. The device provides a user with the capability of adding new routes to the device. It seems that the POST parameters passed in this request to set up routes on the device can be set in such a way that would result in overflowing the stack set up and allow an attacker to control the $ra register stored on the stack. If the firmware version AL-R096 is dissected using binwalk tool, we obtain a cpio-root archive which contains the filesystem set up on the device that contains all the binaries. The binary \"goahead\" is the one that has the vulnerable function that recieves the values sent by the POST request. If we open this binary in IDA-pro we will notice that this follows a MIPS little endian format. The function sub_00420F38 in IDA pro is identified to be receiving the values sent in the POST request. The POST parameter \"gateway\" allows to overflow the stack and control the $ra register after 1546 characters. The value from this post parameter is then copied on the stack at address 0x00421348 as shown below. This allows an attacker to provide the payload of his/her choice and finally take control of the device.", "datePublished": "2019-06-18T18:22:29", "dateUpdated": "2024-08-05T16:34:22", "baseScore": 8.8, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H", "references": ["https://packetstormsecurity.com/files/cve/CVE-2017-8336", "https://seclists.org/bugtraq/2019/Jun/8", "http://packetstormsecurity.com/files/153227/Securifi-Almond-2015-Buffer-Overflow-Command-Injection-XSS-CSRF.html", "https://github.com/ethanhunnt/IoT_vulnerabilities/blob/master/Securifi_Almond_plus_sec_issues.pdf"], "aliases": ["CVE-2017-8336"], "assigner": "mitre", "epss": 1.96, "enisaIdProduct": [{"id": "f4712c58-c121-3fa4-bf7e-903e7462d0db", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "752e4a4b-8cf4-3cdf-a4c6-dffd550834b6", "vendor": {"name": "n/a"}}], "isExploited": false}