{"id": "EUVD-2026-1184", "enisaUuid": "fb59976b-a462-32df-991c-2b7f81324378", "description": "Preact, a lightweight web development framework, JSON serialization protection to prevent Virtual DOM elements from being constructed from arbitrary JSON. A regression introduced in Preact 10.26.5 caused this protection to be softened. In applications where values from JSON payloads are assumed to be strings and passed unmodified to Preact as children, a specially-crafted JSON payload could be constructed that would be incorrectly treated as a valid VNode. When this chain of failures occurs it can result in HTML injection, which can allow arbitrary script execution if not mitigated by CSP or other means. Applications using affected Preact versions are vulnerable if they meet all of the following conditions: first, pass unmodified, unsanitized values from user-modifiable data sources (APIs, databases, local storage, etc.) directly into the render tree; second assume these values are strings but the data source could return actual JavaScript objects instead of JSON strings; and third, the data source either fails to perform type sanitization AND blindly stores/returns raw objects interchangeably with strings, OR is compromised (e.g., poisoned local storage, filesystem, or database). Versions 10.26.10, 10.27.3, and 10.28.2 patch the issue. The patch versions restore the previous strict equality checks that prevent JSON-parsed objects from being treated as valid VNodes. Other mitigations are available for those who cannot immediately upgrade. Validate input types, cast or validate network data, sanitize external data, and use Content Security Policy (CSP).", "datePublished": "2026-01-08T14:16:22", "dateUpdated": "2026-01-08T15:55:06", "baseScore": 7.2, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:P/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N/E:U", "references": ["https://github.com/preactjs/preact/security/advisories/GHSA-36hm-qxxp-pg3m", "https://github.com/preactjs/preact"], "aliases": ["CVE-2026-22028", "GHSA-36hm-qxxp-pg3m"], "assigner": "GitHub_M", "epss": 0.04, "enisaIdProduct": [{"id": "38c64ad0-326b-36c9-bfdf-b70f44c97129", "product": {"name": "preact"}, "product_version": "10.27.0, < 10.27.3"}, {"id": "75576d35-a41e-3866-87e9-ee16174de362", "product": {"name": "preact"}, "product_version": "10.28.0, < 10.28.2"}, {"id": "cd21815e-0e5c-3084-825e-802cdb53a26c", "product": {"name": "preact"}, "product_version": "10.26.5, < 10.26.10"}], "enisaIdVendor": [{"id": "bee3764a-cffa-3868-b758-14878f29d911", "vendor": {"name": "preactjs"}}], "isExploited": false}