{"id": "EUVD-2026-1185", "enisaUuid": "62c313d1-0694-325a-a3f9-e22e07e3eed7", "description": "n8n is an open source workflow automation platform. In versions from 0.150.0 to before 2.2.2, an authentication bypass vulnerability in the Stripe Trigger node allows unauthenticated parties to trigger workflows by sending forged Stripe webhook events. The Stripe Trigger creates and stores a Stripe webhook signing secret when registering the webhook endpoint, but incoming webhook requests were not verified against this secret. As a result, any HTTP client that knows the webhook URL could send a POST request containing a matching event type, causing the workflow to execute as if a legitimate Stripe event had been received. This issue affects n8n users who have active workflows using the Stripe Trigger node. An attacker could potentially fake payment or subscription events and influence downstream workflow behavior. The practical risk is reduced by the fact that the webhook URL contains a high-entropy UUID; however, authenticated n8n users with access to the workflow can view this webhook ID. This issue has been patched in version 2.2.2. A temporary workaround for this issue involves users deactivating affected workflows or restricting access to workflows containing Stripe Trigger nodes to trusted users only.", "datePublished": "2026-01-08T09:56:04", "dateUpdated": "2026-01-08T14:42:36", "baseScore": 6.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:H/A:N", "references": ["https://github.com/n8n-io/n8n/security/advisories/GHSA-jf52-3f2h-h9j5", "https://github.com/n8n-io/n8n", "https://github.com/n8n-io/n8n/pull/22764", "https://github.com/n8n-io/n8n/commit/a61a5991093c41863506888336e808ac1eff8d59"], "aliases": ["CVE-2026-21894", "GHSA-jf52-3f2h-h9j5"], "assigner": "GitHub_M", "epss": 0.05, "enisaIdProduct": [{"id": "0c0f9aeb-f881-3c20-afd6-c045bffcf4f0", "product": {"name": "n8n"}, "product_version": "0.150.0, < 2.2.2"}], "enisaIdVendor": [{"id": "9184bfed-d2c4-3d9b-828f-f51407785e29", "vendor": {"name": "n8n-io"}}], "isExploited": false}