{"id": "EUVD-2024-36468", "enisaUuid": "366739ea-247a-335c-902f-d638ce734c13", "description": "OpenCTI is an open source platform allowing organizations to manage their cyber threat intelligence knowledge and observables. Prior to version 6.1.9, the regex validation used to prevent Introspection queries can be bypassed by removing the extra whitespace, carriage return, and line feed characters from the query. GraphQL Queries in OpenCTI can be validated using the `secureIntrospectionPlugin`. The regex check in the plkugin can be bypassed by removing the carriage return and line feed characters (`\\r\\n`).  Running a curl command against a local instance of OpenCTI will result in a limited error message. By running the same Introspection query without the `\\r\\n` characters, the unauthenticated user is able to successfully run a full Introspection query. Bypassing this restriction allows the attacker to gather a wealth of information about the GraphQL endpoint functionality that can be used to perform actions and/or read data without authorization.  These queries can also be weaponized to conduct a Denial of Service (DoS) attack if sent repeatedly. Users should upgrade to version 6.1.9 to receive a patch for the issue.", "datePublished": "2024-11-18T15:06:32", "dateUpdated": "2024-11-18T21:38:54", "baseScore": 6.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:L", "references": ["https://github.com/OpenCTI-Platform/opencti/security/advisories/GHSA-4mvw-j8r9-xcgc", "https://github.com/OpenCTI-Platform/opencti/commit/f87d96918c63b0c3d3ebfbea6c789d48e2f56ad5", "https://github.com/OpenCTI-Platform/opencti/blob/6343b82b0b0a5d3ded3b30d08ce282328a556268/opencti-platform/opencti-graphql/src/graphql/graphql.js#L83-L94"], "aliases": ["CVE-2024-37155"], "assigner": "GitHub_M", "epss": 0.61, "enisaIdProduct": [{"id": "c0845b67-5b6d-32e9-83c3-f94ae9bbb474", "product": {"name": "opencti"}, "product_version": "< 6.1.9"}], "enisaIdVendor": [{"id": "2b8260f4-e793-3c50-a334-be8e6ed3d853", "vendor": {"name": "OpenCTI-Platform"}}], "isExploited": false}