{"id": "EUVD-2024-22479", "enisaUuid": "2cc60f16-0f85-3210-bf0f-c9fe863ece08", "description": "The CodeQL CLI repo holds binaries for the CodeQL command line interface (CLI). Prior to version 2.16.3, an XML parser used by the CodeQL CLI to read various auxiliary files is vulnerable to an XML External Entity attack. If a vulnerable version of the CLI is used to process either a maliciously modified CodeQL database, or a specially prepared set of QL query sources, the CLI can be made to make an outgoing HTTP request to an URL that contains material read from a local file chosen by the attacker. This may result in a loss of privacy of exfiltration of secrets. Security researchers and QL authors who receive databases or QL source files from untrusted sources may be impacted. A single untrusted `.ql` or `.qll` file cannot be affected, but a zip archive or tarball containing QL sources may unpack auxiliary files that will trigger an attack when CodeQL sees them in the file system. Those using CodeQL for routine analysis of source trees with a preselected set of trusted queries are not affected. In particular, extracting XML files from a source tree into the CodeQL database does not make one vulnerable. The problem is fixed in release 2.16.3 of the CodeQL CLI. Other than upgrading, workarounds include not accepting CodeQL databases or queries from untrusted sources, or only processing such material on a machine without an Internet connection. Customers who use older releases of CodeQL for security scanning in an automated CI system and cannot upgrade for compliance reasons can continue using that version. That use case is safe. If such customers have a private query pack and use the `codeql pack create` command to precompile them before using them in the CI system, they should be using the production CodeQL release to run `codeql pack create`. That command is safe as long as the QL source it precompiled is trusted. All other development of the query pack should use an upgraded CLI.", "datePublished": "2024-02-22T18:23:33", "dateUpdated": "2024-08-01T23:36:21", "baseScore": 2.7, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:H/PR:N/UI:R/S:C/C:L/I:N/A:N", "references": ["https://github.com/github/codeql-cli-binaries/security/advisories/GHSA-gf8p-v3g3-3wph", "https://github.com/github/codeql-cli-binaries/releases/tag/v2.16.3", "https://github.com/github/codeql/blob/main/java/ql/src/Security/CWE/CWE-611/XXELocal.ql"], "aliases": ["CVE-2024-25129"], "assigner": "GitHub_M", "epss": 0.12, "enisaIdProduct": [{"id": "7eb1be86-ab7f-3475-bccc-9bd3edd78dc4", "product": {"name": "codeql-cli-binaries"}, "product_version": "< 2.16.3"}, {"id": "d2ffd6fc-49e0-3c7a-80fe-e14bf5833e6a", "product": {"name": "codeql-cli-binaries"}}], "enisaIdVendor": [{"id": "3cf80626-9d35-3332-85bf-13c5745d1f99", "vendor": {"name": "GitHub"}}], "isExploited": false}