{"id": "EUVD-2024-2719", "enisaUuid": "d354e13a-da71-3333-b6ce-e6d7eec82332", "description": "Navidrome is an open source web-based music collection server and streamer. Navidrome automatically adds parameters in the URL to SQL queries. This can be exploited to access information by adding parameters like `password=...` in the URL (ORM Leak). Furthermore, the names of the parameters are not properly escaped, leading to SQL Injections. Finally, the username is used in a `LIKE` statement, allowing people to log in with `%` instead of their username. When adding parameters to the URL, they are automatically included in an SQL `LIKE` statement (depending on the parameter's name). This allows attackers to potentially retrieve arbitrary information. For example, attackers can use the following request to test whether some encrypted passwords start with `AAA`. This results in an SQL query like `password LIKE 'AAA%'`, allowing attackers to slowly brute-force passwords. When adding parameters to the URL, they are automatically added to an SQL query. The names of the parameters are not properly escaped. This behavior can be used to inject arbitrary SQL code (SQL Injection). These vulnerabilities can be used to leak information and dump the contents of the database and have been addressed in release version 0.53.0. Users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2024-09-20T19:01:09", "dateUpdated": "2024-09-20T19:17:55", "baseScore": 9.4, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:H/SI:H/SA:L", "references": ["https://github.com/navidrome/navidrome/security/advisories/GHSA-58vj-cv5w-v4v6", "https://nvd.nist.gov/vuln/detail/CVE-2024-47062", "https://github.com/navidrome/navidrome/commit/3107170afd9f557a10f7031f23cb3c9e975a71f9", "https://github.com/navidrome/navidrome"], "aliases": ["CVE-2024-47062", "GHSA-58vj-cv5w-v4v6"], "assigner": "GitHub_M", "epss": 84.66, "enisaIdProduct": [{"id": "49b0dc50-ed81-32ba-bb54-0b77be1b591e", "product": {"name": "navidrome"}, "product_version": "< 0.53.0"}], "enisaIdVendor": [{"id": "74488acd-0081-3cbb-b6e1-313696cd3d26", "vendor": {"name": "navidrome"}}], "isExploited": false}