{"id": "EUVD-2024-3603", "enisaUuid": "f9d4a986-2d7e-369c-a75a-bf10d9cc50b9", "description": "Incorrect Implementation of Authentication Algorithm in Apache Kafka's SCRAM implementation.\n\nIssue Summary:\nApache Kafka's implementation of the Salted Challenge Response Authentication Mechanism (SCRAM) did not fully adhere to the requirements of RFC 5802 [1].\nSpecifically, as per RFC 5802, the server must verify that the nonce sent by the client in the second message matches the nonce sent by the server in its first message.\nHowever, Kafka's SCRAM implementation did not perform this validation.\n\nImpact:\nThis vulnerability is exploitable only when an attacker has plaintext access to the SCRAM authentication exchange. However, the usage of SCRAM over plaintext is strongly\ndiscouraged as it is considered an insecure practice [2]. Apache Kafka recommends deploying SCRAM exclusively with TLS encryption to protect SCRAM exchanges from interception [3].\nDeployments using SCRAM with TLS are not affected by this issue.\n\nHow to Detect If You Are Impacted:\nIf your deployment uses SCRAM authentication over plaintext communication channels (without TLS encryption), you are likely impacted.\nTo check if TLS is enabled, review your server.properties configuration file for listeners property. If you have SASL_PLAINTEXT in the listeners, then you are likely impacted.\n\nFix Details:\nThe issue has been addressed by introducing nonce verification in the final message of the SCRAM authentication exchange to ensure compliance with RFC 5802.\n\nAffected Versions:\nApache Kafka versions 0.10.2.0 through 3.9.0, excluding the fixed versions below.\n\nFixed Versions:\n3.9.0\n3.8.1\n3.7.2\n\nUsers are advised to upgrade to 3.7.2 or later to mitigate this issue.\n\nRecommendations for Mitigation:\nUsers unable to upgrade to the fixed versions can mitigate the issue by:\n- Using TLS with SCRAM Authentication:\nAlways deploy SCRAM over TLS to encrypt authentication exchanges and protect against interception.\n- Considering Alternative Authentication Mechanisms:\nEvaluate alternative authentication mechanisms, such as PLAIN, Kerberos or OAuth with TLS, which provide additional layers of security.", "datePublished": "2024-12-18T13:38:03", "dateUpdated": "2024-12-18T17:02:47", "baseScore": 5.3, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N", "references": ["https://nvd.nist.gov/vuln/detail/CVE-2024-56128", "https://github.com/apache/kafka/commit/2cbc5bd3ca22185d9cd357c9db23a2cfb43a0fff", "https://datatracker.ietf.org/doc/html/rfc5802", "https://datatracker.ietf.org/doc/html/rfc5802#section-9", "https://github.com/apache/kafka", "https://kafka.apache.org/documentation/#security_sasl_scram_security", "https://lists.apache.org/thread/84dh4so32lwn7wr6c5s9mwh381vx9wkw", "http://www.openwall.com/lists/oss-security/2024/12/18/3"], "aliases": ["CVE-2024-56128", "GHSA-p7c9-8xx8-h74f"], "assigner": "apache", "epss": 0.12, "enisaIdProduct": [{"id": "095177f0-c97c-3596-8fd8-a1b68b548ec1", "product": {"name": "Apache Kafka"}, "product_version": "0.10.2.0 <3.7.2"}, {"id": "1067fecc-d5c3-37a3-8983-bc6ee308d95e", "product": {"name": "Apache Kafka"}, "product_version": "3.8.0"}], "enisaIdVendor": [{"id": "1907739a-98db-3f6c-baac-663424fce147", "vendor": {"name": "Apache Software Foundation"}}], "isExploited": false}