{"id": "EUVD-2024-22468", "enisaUuid": "39daf56d-da4e-3f32-8dd4-b9621e656b03", "description": "OpenObserve is a observability platform built specifically for logs, metrics, traces, analytics, designed to work at petabyte scale. A critical vulnerability has been identified in the \"/api/{org_id}/users/{email_id}\" endpoint. This vulnerability allows any authenticated user within an organization to remove any other user from that same organization, irrespective of their respective roles. This includes the ability to remove users with \"Admin\" and \"Root\" roles. By enabling any organizational member to unilaterally alter the user base, it opens the door to unauthorized access and can cause considerable disruptions in operations. The core of the vulnerability lies in the `remove_user_from_org` function in the user management system. This function is designed to allow organizational users to remove members from their organization. The function does not check if the user initiating the request has the appropriate administrative privileges to remove a user. Any user who is part of the organization, irrespective of their role, can remove any other user, including those with higher privileges. This vulnerability is categorized as an Authorization issue leading to Unauthorized User Removal. The impact is severe, as it compromises the integrity of user management within organizations. By exploiting this vulnerability, any user within an organization, without the need for administrative privileges, can remove critical users, including \"Admins\" and \"Root\" users. This could result in unauthorized system access, administrative lockout, or operational disruptions. Given that user accounts are typically created by \"Admins\" or \"Root\" users, this vulnerability can be exploited by any user who has been granted access to an organization, thereby posing a critical risk to the security and operational stability of the application. This issue has been addressed in release version 0.8.0. Users are advised to upgrade.", "datePublished": "2024-02-08T23:05:46", "dateUpdated": "2024-08-01T23:36:21", "baseScore": 9.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:L/A:L", "references": ["https://github.com/openobserve/openobserve/security/advisories/GHSA-3m5f-9m66-xgp7"], "aliases": ["CVE-2024-25106"], "assigner": "GitHub_M", "epss": 0.06, "enisaIdProduct": [{"id": "f6ba18af-48a0-3be7-a894-18062dedd71a", "product": {"name": "openobserve"}}, {"id": "f7e78ef0-40be-3dbd-a99b-cf9060bc5397", "product": {"name": "openobserve"}, "product_version": "< 0.8.0"}], "enisaIdVendor": [{"id": "f6ba18af-48a0-3be7-a894-18062dedd71a", "vendor": {"name": "openobserve"}}], "isExploited": false}