{"id": "EUVD-2024-52176", "enisaUuid": "41d468d3-6d1b-35a6-92f1-8d8fdee84dc1", "description": "Centurion ERP (Enterprise Rescource Planning) is a simple application developed to provide open source IT management with a large emphasis on the IT Service Management (ITSM) modules. A user who is authenticated and has view permissions for a ticket, can view the tickets of another organization they are not apart of. Users with following permissions are applicable: 1. `view_ticket_change` permission can view change tickets from organizations they are not apart of. 2. `view_ticket_incident` permission can view incident tickets from organizations they are not apart of. 3. `view_ticket_request` permission can view request tickets from organizations they are not apart of. 4. `view_ticket_problem` permission can view problem tickets from organizations they are not apart of. The access to view the tickets from different organizations is only applicable when browsing the API endpoints for the tickets in question. The Centurion UI is not affected. Project Tasks, although a \"ticket type\" are also **Not** affected. This issue has been addressed in release version 1.3.1 and users are advised to upgrade. Users unable to upgrade may remove the ticket view permissions from users which would alleviate this vulnerability, if this is deemed not-viable, Upgrading is recommended.", "datePublished": "2024-11-27T18:27:04", "dateUpdated": "2024-11-27T19:32:45", "baseScore": 1.9, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:P/AC:L/PR:L/UI:R/S:U/C:L/I:N/A:N", "references": ["https://github.com/nofusscomputing/centurion_erp/security/advisories/GHSA-h9q2-fcc6-r65c", "https://github.com/nofusscomputing/centurion_erp/pull/399", "https://github.com/nofusscomputing/centurion_erp/pull/399/commits/61f34876ed0f8362f7185bd5eecfc830a9de5cb0", "https://github.com/nofusscomputing/centurion_erp/releases/tag/1.3.1"], "aliases": ["CVE-2024-53855"], "assigner": "GitHub_M", "epss": 0.14, "enisaIdProduct": [{"id": "84a9716e-d7d1-3511-bade-b2349c8b2f34", "product": {"name": "centurion_erp"}, "product_version": "1.2.0, < 1.3.1"}], "enisaIdVendor": [{"id": "a645b383-2a9d-3e0d-b139-53779272a7b8", "vendor": {"name": "nofusscomputing"}}], "isExploited": false}