{"id": "EUVD-2024-26214", "enisaUuid": "3b60696c-4425-38b3-8ddb-8a3f398a9108", "description": "FreeScout is a self-hosted help desk and shared mailbox. A Stored Cross-Site Scripting (XSS) vulnerability has been identified within the Signature Input Field of the FreeScout Application prior to version 1.8.128. Stored XSS occurs when user input is not properly sanitized and is stored on the server, allowing an attacker to inject malicious scripts that will be executed when other users access the affected page. In this case, the Support Agent User can inject malicious scripts into their signature, which will then be executed when viewed by the Administrator.\n\nThe application protects users against XSS attacks by enforcing a CSP policy, the CSP Policy is:  `script-src 'self' 'nonce-abcd'  `. The CSP policy only allows the inclusion of JS files that are present on the application server and doesn't allow any inline script or script other than nonce-abcd. The CSP policy was bypassed by uploading a JS file to the server by a POST request to /conversation/upload endpoint. After this, a working XSS payload was crafted by including the uploaded JS file link as the src of the script. This bypassed the CSP policy and XSS attacks became possible.\n\nThe impact of this vulnerability is severe as it allows an attacker to compromise the FreeScout Application. By exploiting this vulnerability, the attacker can perform various malicious actions such as forcing the Administrator to execute actions without their knowledge or consent. For instance, the attacker can force the Administrator to add a new administrator controlled by the attacker, thereby giving the attacker full control over the application. Alternatively, the attacker can elevate the privileges of a low-privileged user to Administrator, further compromising the security of the application. Attackers can steal sensitive information such as login credentials, session tokens, personal identifiable information (PII), and financial data. The vulnerability can also lead to defacement of the Application.\n\nVersion 1.8.128 contains a patch for this issue.", "datePublished": "2024-03-22T17:01:01", "dateUpdated": "2024-08-02T01:10:54", "baseScore": 8.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H", "references": ["https://github.com/freescout-helpdesk/freescout/security/advisories/GHSA-fffc-phh8-5h4v"], "aliases": ["CVE-2024-29184"], "assigner": "GitHub_M", "epss": 0.43, "enisaIdProduct": [{"id": "2ac60dbb-2913-35bc-97b0-0ae1b8b0ebfb", "product": {"name": "freescout"}, "product_version": "< 1.8.128"}, {"id": "d094eee1-925c-3662-95c2-a1f9969cef42", "product": {"name": "freescout"}}], "enisaIdVendor": [{"id": "a92d3a30-7a49-34f7-939d-d38d1356cb92", "vendor": {"name": "freescout-helpdesk"}}], "isExploited": false}