{"id": "EUVD-2024-3375", "enisaUuid": "8c94d2d2-e62c-3915-a13d-4a24d9909df1", "description": "sigstore-java is a sigstore java client for interacting with sigstore infrastructure. sigstore-java has insufficient verification for a situation where a validly-signed but \"mismatched\" bundle is presented as proof of inclusion into a transparency log. This bug impacts clients using any variation of KeylessVerifier.verify(). The verifier may accept a bundle with an unrelated log entry, cryptographically verifying everything but fails to ensure the log entry applies to the artifact in question, thereby \"verifying\" a bundle without any proof the signing event was logged. This allows the creation of a bundle without fulcio certificate and private key combined with an unrelated but time-correct log entry to fake logging of a signing event. A malicious actor using a compromised identity may want to do this to prevent discovery via rekor's log monitors. The signer's identity will still be available to the verifier. The signature on the bundle must still be on the correct artifact for the verifier to pass. sigstore-gradle-plugin and sigstore-maven-plugin are not affected by this as they only provide signing functionality. This issue has been patched in v1.1.0 release with PR #856. All users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2024-11-26T18:41:29", "dateUpdated": "2024-11-26T19:46:41", "baseScore": 5.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:N", "references": ["https://github.com/sigstore/sigstore-java/security/advisories/GHSA-q4xm-6fjc-5f6w", "https://nvd.nist.gov/vuln/detail/CVE-2024-53267", "https://github.com/sigstore/sigstore-conformance/pull/166", "https://github.com/sigstore/sigstore-java/pull/856", "https://github.com/sigstore/sigstore-java"], "aliases": ["CVE-2024-53267", "GHSA-q4xm-6fjc-5f6w"], "assigner": "GitHub_M", "epss": 0.02, "enisaIdProduct": [{"id": "7427a5a1-88b3-3833-871d-67a399acfc3b", "product": {"name": "sigstore-java"}, "product_version": "1.0.0, < 1.1.0"}], "enisaIdVendor": [{"id": "7b43a945-19a0-373f-82ef-b8492413b2fb", "vendor": {"name": "sigstore"}}], "isExploited": false}