{"id": "EUVD-2024-33040", "enisaUuid": "0db6c6d1-2773-3069-98d6-d6008be8b451", "description": "A vulnerability in Okta Verify for iOS versions 9.25.1 (beta) and 9.27.0 (including beta) allows push notification responses through the iOS ContextExtension feature allowing the authentication to proceed regardless of the user’s selection. When a user long-presses the notification banner and selects an option, both options allow the authentication to succeed. \nThe ContextExtension feature is one of several push mechanisms available when using Okta Verify Push on iOS devices. The vulnerable flows include: \n* When a user is presented with a notification on a locked screen, the user presses on the notification directly and selects their reply without unlocking the device; \n* When a user is presented with a notification on the home screen and drags the notification down and selects their reply; \n* When an Apple Watch is used to reply directly to a notification. \n\n A pre-condition for this vulnerability is that the user must have enrolled in Okta Verify while the Okta customer was using Okta Classic. This applies irrespective of whether the organization has since upgraded to Okta Identity Engine.", "datePublished": "2024-10-24T20:17:59", "dateUpdated": "2024-10-25T15:22:54", "baseScore": 8.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:N", "references": ["https://trust.okta.com/security-advisories/okta-verify-for-ios-cve-2024-10327/", "https://help.okta.com/en-us/content/topics/releasenotes/okta-verify-release-notes.htm#panel2"], "aliases": ["CVE-2024-10327"], "assigner": "Okta", "epss": 0.1, "enisaIdProduct": [{"id": "27a665f4-1f47-3a20-a0b5-c6d688df5ecf", "product": {"name": "Okta Verify for iOS"}, "product_version": "9.27.0"}, {"id": "8295f03b-3532-3f57-9254-feccc6532276", "product": {"name": "Okta Verify for iOS"}, "product_version": "9.25.1"}], "enisaIdVendor": [{"id": "74ab5b0d-5ebd-3070-8e2a-780e235fb71d", "vendor": {"name": "Okta"}}], "isExploited": false}