{"id": "EUVD-2024-53116", "enisaUuid": "c430423a-654e-3dfe-b9b2-d59809072bfd", "description": "vaultwarden is an unofficial Bitwarden compatible server written in Rust, formerly known as bitwarden_rs. In affected versions an attacker is capable of updating or deleting groups from an organization given a few conditions: 1. The attacker has a user account in the server. 2. The attacker's account has admin or owner permissions in an unrelated organization. 3. The attacker knows the target organization's UUID and the target group's UUID. Note that this vulnerability is related to group functionality and as such is only applicable for servers who have enabled the `ORG_GROUPS_ENABLED` setting, which is disabled by default. This attack can lead to different situations: 1. Denial of service, the attacker can limit users from accessing the organization's data by removing their membership from the group. 2. Privilege escalation, if the attacker is part of the victim organization, they can escalate their own privileges by joining a group they wouldn't normally have access to. For attackers that aren't part of the organization, this shouldn't lead to any possible plain-text data exfiltration as all the data is encrypted client side. This vulnerability is patched in Vaultwarden `1.32.7`, and users are recommended to update as soon as possible. If it's not possible to update to `1.32.7`,  some possible workarounds are: 1. Disabling `ORG_GROUPS_ENABLED`, which would disable groups functionality on the server. 2. Disabling `SIGNUPS_ALLOWED`, which would not allow an attacker to create new accounts on the server.", "datePublished": "2024-12-20T20:15:35", "dateUpdated": "2024-12-24T15:57:45", "baseScore": 7.6, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:H/A:L", "references": ["https://github.com/dani-garcia/vaultwarden/security/advisories/GHSA-g65h-982x-4m5m"], "aliases": ["CVE-2024-56335"], "assigner": "GitHub_M", "epss": 0.11, "enisaIdProduct": [{"id": "1bd4f924-c3c5-3de8-971d-1bc92042c069", "product": {"name": "vaultwarden"}, "product_version": "< 1.32.7"}], "enisaIdVendor": [{"id": "583e1f1e-a560-3819-92c4-9db405f79637", "vendor": {"name": "dani-garcia"}}], "isExploited": false}