{"id": "EUVD-2024-29114", "enisaUuid": "f6de435a-8bbd-3797-837c-383af2591f9f", "description": "Traccar is an open source GPS tracking system. Traccar versions 5.1 through 5.12 allow arbitrary files to be uploaded through the device image upload API. Attackers have full control over the file contents, full control over the directory where the file is stored, full control over the file extension, and partial control over the file name. While it's not  for an attacker to overwrite an existing file, an attacker can create new files with certain names and attacker-controlled extensions anywhere on the file system. This can potentially lead to remote code execution, XSS, DOS, etc. The default install of Traccar makes this vulnerability more severe. Self-registration is enabled by default, allowing anyone to create an account to exploit this vulnerability. Traccar also runs by default with root/system privileges, allowing files to be placed anywhere on the file system. Version 6.0 contains a fix for the issue. One may also turn off self-registration by default, as that would make most vulnerabilities in the application much harder to exploit by default and reduce the severity considerably.\n", "datePublished": "2024-04-10T17:20:55", "dateUpdated": "2024-08-02T01:46:04", "baseScore": 9.7, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:H/I:H/A:H", "references": ["https://github.com/traccar/traccar/security/advisories/GHSA-3gxq-f2qj-c8v9", "https://github.com/traccar/traccar/commit/3fbdcd81566bc72e319ec05c77cf8a4120b87b8f", "https://github.com/traccar/traccar/blob/master/src/main/java/org/traccar/model/Device.java#L56", "https://github.com/traccar/traccar/blob/v5.12/src/main/java/org/traccar/api/resource/DeviceResource.java#L191"], "aliases": ["CVE-2024-31214"], "assigner": "GitHub_M", "epss": 17.64, "enisaIdProduct": [{"id": "c4a4d029-500a-354d-94ef-e78dac8448d0", "product": {"name": "traccar"}, "product_version": "5.1, < 6.0"}, {"id": "c4dfa12e-de98-3a94-aa21-d43f27c6b89e", "product": {"name": "traccar"}}], "enisaIdVendor": [{"id": "c4dfa12e-de98-3a94-aa21-d43f27c6b89e", "vendor": {"name": "traccar"}}], "isExploited": false}