{"id": "EUVD-2024-0307", "enisaUuid": "dddb329f-05d3-32c1-bafc-7a09836af096", "description": "Argo CD is a declarative, GitOps continuous delivery tool for Kubernetes. The Argo CD API prior to versions 2.10-rc2, 2.9.4, 2.8.8, and 2.7.15 are vulnerable to a cross-server request forgery (CSRF) attack when the attacker has the ability to write HTML to a page on the same parent domain as Argo CD. A CSRF attack works by tricking an authenticated Argo CD user into loading a web page which contains code to call Argo CD API endpoints on the victim’s behalf. For example, an attacker could send an Argo CD user a link to a page which looks harmless but in the background calls an Argo CD API endpoint to create an application running malicious code. Argo CD uses the “Lax” SameSite cookie policy to prevent CSRF attacks where the attacker controls an external domain. The malicious external website can attempt to call the Argo CD API, but the web browser will refuse to send the Argo CD auth token with the request. Many companies host Argo CD on an internal subdomain. If an attacker can place malicious code on, for example, https://test.internal.example.com/, they can still perform a CSRF attack. In this case, the “Lax” SameSite cookie does not prevent the browser from sending the auth cookie, because the destination is a parent domain of the Argo CD API. Browsers generally block such attacks by applying CORS policies to sensitive requests with sensitive content types. Specifically, browsers will send a “preflight request” for POSTs with content type “application/json” asking the destination API “are you allowed to accept requests from my domain?” If the destination API does not answer “yes,” the browser will block the request. Before the patched versions, Argo CD did not validate that requests contained the correct content type header. So an attacker could bypass the browser’s CORS check by setting the content type to something which is considered “not sensitive” such as “text/plain.” The browser wouldn’t send the preflight request, and Argo CD would happily accept the contents (which are actually still JSON) and perform the requested action (such as running malicious code). A patch for this vulnerability has been released in the following Argo CD versions: 2.10-rc2, 2.9.4, 2.8.8, and 2.7.15. The patch contains a breaking API change. The Argo CD API will no longer accept non-GET requests which do not specify application/json as their Content-Type. The accepted content types list is configurable, and it is possible (but discouraged) to disable the content type check completely. Users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2024-01-19T00:25:44", "dateUpdated": "2024-08-01T22:43:34", "baseScore": 8.4, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:R/S:C/C:H/I:H/A:H", "references": ["https://github.com/argoproj/argo-cd/security/advisories/GHSA-92mw-q256-5vwg", "https://nvd.nist.gov/vuln/detail/CVE-2024-22424", "https://github.com/argoproj/argo-cd/issues/2496", "https://github.com/argoproj/argo-cd/pull/16860", "https://github.com/argoproj/argo-cd/commit/0b459f224b3186707809be8240dfc3a6028f42a0", "https://github.com/argoproj/argo-cd/commit/13fe3ca589f6f2ded6001ce114e354602ed058b3", "https://github.com/argoproj/argo-cd/commit/3c5878ecf41581942281e9c95745f073bdfbf9c3", "https://github.com/argoproj/argo-cd/commit/f569aa105e0fe5940bc736c68e2fc90ee4a6ed94", "https://github.com/argoproj/argo-cd"], "aliases": ["CVE-2024-22424", "GHSA-92mw-q256-5vwg"], "assigner": "GitHub_M", "epss": 0.06, "enisaIdProduct": [{"id": "0bfae888-c057-333f-af3f-59e56ef95607", "product": {"name": "argo-cd"}, "product_version": "0.1.0, < 2.7.15"}, {"id": "2f2d1383-40ba-35ef-abeb-036ef11ce3cf", "product": {"name": "argo-cd"}, "product_version": "2.10.0-rc1, < 2.10-rc2"}, {"id": "83b72910-cd92-3ff4-8c62-2669dd03b7ac", "product": {"name": "argo-cd"}}, {"id": "ce8f8e4e-247f-3f28-b827-d85d21f17da9", "product": {"name": "argo-cd"}, "product_version": "2.8.0, < 2.8.8"}, {"id": "f7400709-303b-3106-bb24-ae911920f917", "product": {"name": "argo-cd"}, "product_version": "2.9.0, < 2.9.4"}], "enisaIdVendor": [{"id": "e245e914-90b8-3a02-afe5-9b82d1f5ee6f", "vendor": {"name": "argoproj"}}], "isExploited": false}