{"id": "EUVD-2024-3127", "enisaUuid": "fa3e8ea6-f3ef-370d-9426-a6a11f92ecfc", "description": "Pomerium is an identity and context-aware access proxy. The Pomerium databroker service is responsible for managing all persistent Pomerium application state. Requests to the databroker service API are authorized by the presence of a JSON Web Token (JWT) signed by a key known by all Pomerium services in the same deployment. However, incomplete validation of this JWT meant that some service account access tokens would incorrectly be treated as valid for the purpose of databroker API authorization. Improper access to the databroker API could allow exfiltration of user info, spoofing of user sessions, or tampering with Pomerium routes, policies, and other settings. A Pomerium deployment is susceptible to this issue if all of the following conditions are met, you have issued a service account access token using Pomerium Zero or Pomerium Enterprise, the access token has an explicit expiration date in the future, and the core Pomerium databroker gRPC API is not otherwise secured by network access controls. This vulnerability is fixed in 0.27.1.", "datePublished": "2024-10-02T21:10:24", "dateUpdated": "2024-10-03T15:43:26", "baseScore": 6.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:N", "references": ["https://github.com/pomerium/pomerium/security/advisories/GHSA-r7rh-jww5-5fjr", "https://nvd.nist.gov/vuln/detail/CVE-2024-47616", "https://github.com/pomerium/pomerium/commit/e018cf0fc0979d2abe25ff705db019feb7523444", "https://github.com/pomerium/pomerium", "https://github.com/pomerium/pomerium/releases/tag/v0.27.1", "https://pkg.go.dev/vuln/GO-2024-3179"], "aliases": ["CVE-2024-47616", "GHSA-r7rh-jww5-5fjr"], "assigner": "GitHub_M", "epss": 0.05, "enisaIdProduct": [{"id": "bba94898-ff09-3901-8041-d21a23289df8", "product": {"name": "pomerium"}, "product_version": "< 0.27.1"}], "enisaIdVendor": [{"id": "6a99eb37-7560-361d-a9b6-3d076f2d236d", "vendor": {"name": "pomerium"}}], "isExploited": false}