{"id": "EUVD-2024-46737", "enisaUuid": "b74de2a8-967e-32f5-8698-c6ae1b57d669", "description": "Issue summary: Calling the OpenSSL API function SSL_select_next_proto with an\nempty supported client protocols buffer may cause a crash or memory contents to\nbe sent to the peer.\n\nImpact summary: A buffer overread can have a range of potential consequences\nsuch as unexpected application beahviour or a crash. In particular this issue\ncould result in up to 255 bytes of arbitrary private data from memory being sent\nto the peer leading to a loss of confidentiality. However, only applications\nthat directly call the SSL_select_next_proto function with a 0 length list of\nsupported client protocols are affected by this issue. This would normally never\nbe a valid scenario and is typically not under attacker control but may occur by\naccident in the case of a configuration or programming error in the calling\napplication.\n\nThe OpenSSL API function SSL_select_next_proto is typically used by TLS\napplications that support ALPN (Application Layer Protocol Negotiation) or NPN\n(Next Protocol Negotiation). NPN is older, was never standardised and\nis deprecated in favour of ALPN. We believe that ALPN is significantly more\nwidely deployed than NPN. The SSL_select_next_proto function accepts a list of\nprotocols from the server and a list of protocols from the client and returns\nthe first protocol that appears in the server list that also appears in the\nclient list. In the case of no overlap between the two lists it returns the\nfirst item in the client list. In either case it will signal whether an overlap\nbetween the two lists was found. In the case where SSL_select_next_proto is\ncalled with a zero length client list it fails to notice this condition and\nreturns the memory immediately following the client list pointer (and reports\nthat there was no overlap in the lists).\n\nThis function is typically called from a server side application callback for\nALPN or a client side application callback for NPN. In the case of ALPN the list\nof protocols supplied by the client is guaranteed by libssl to never be zero in\nlength. The list of server protocols comes from the application and should never\nnormally be expected to be of zero length. In this case if the\nSSL_select_next_proto function has been called as expected (with the list\nsupplied by the client passed in the client/client_len parameters), then the\napplication will not be vulnerable to this issue. If the application has\naccidentally been configured with a zero length server list, and has\naccidentally passed that zero length server list in the client/client_len\nparameters, and has additionally failed to correctly handle a \"no overlap\"\nresponse (which would normally result in a handshake failure in ALPN) then it\nwill be vulnerable to this problem.\n\nIn the case of NPN, the protocol permits the client to opportunistically select\na protocol when there is no overlap. OpenSSL returns the first client protocol\nin the no overlap case in support of this. The list of client protocols comes\nfrom the application and should never normally be expected to be of zero length.\nHowever if the SSL_select_next_proto function is accidentally called with a\nclient_len of 0 then an invalid memory pointer will be returned instead. If the\napplication uses this output as the opportunistic protocol then the loss of\nconfidentiality will occur.\n\nThis issue has been assessed as Low severity because applications are most\nlikely to be vulnerable if they are using NPN instead of ALPN - but NPN is not\nwidely used. It also requires an application configuration or programming error.\nFinally, this issue would not typically be under attacker control making active\nexploitation unlikely.\n\nThe FIPS modules in 3.3, 3.2, 3.1 and 3.0 are not affected by this issue.\n\nDue to the low severity of this issue we are not issuing new releases of\nOpenSSL at this time. The fix will be included in the next releases when they\nbecome available.", "datePublished": "2024-06-27T10:30:53", "dateUpdated": "2025-11-03T22:32:30", "baseScore": 9.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:H", "references": ["https://www.openssl.org/news/secadv/20240627.txt", "https://github.com/openssl/openssl/commit/e86ac436f0bd54d4517745483e2315650fae7b2c", "https://github.com/openssl/openssl/commit/99fb785a5f85315b95288921a321a935ea29a51e", "https://github.com/openssl/openssl/commit/4ada436a1946cbb24db5ab4ca082b69c1bc10f37", "https://github.com/openssl/openssl/commit/cf6f91f6121f4db167405db2f0de410a456f260c", "https://github.openssl.org/openssl/extended-releases/commit/b78ec0824da857223486660177d3b1f255c65d87", "https://github.openssl.org/openssl/extended-releases/commit/9947251413065a05189a63c9b7a6c1d4e224c21c", "http://www.openwall.com/lists/oss-security/2024/06/27/1", "http://www.openwall.com/lists/oss-security/2024/06/28/4", "https://security.netapp.com/advisory/ntap-20240712-0005/", "https://nvd.nist.gov/vuln/detail/CVE-2024-5535", "https://lists.debian.org/debian-lts-announce/2024/10/msg00033.html", "https://lists.debian.org/debian-lts-announce/2024/11/msg00000.html", "https://security.netapp.com/advisory/ntap-20241025-0006", "https://security.netapp.com/advisory/ntap-20241025-0010", "http://www.openwall.com/lists/oss-security/2024/08/15/1"], "aliases": ["CVE-2024-5535"], "assigner": "openssl", "epss": 4.49, "enisaIdProduct": [{"id": "110d6860-8edb-388b-84d9-1ddefd866b63", "product": {"name": "OpenSSL"}, "product_version": "1.1.1 <1.1.1za"}, {"id": "211c18ad-29f8-3900-a290-71d9081c4f7b", "product": {"name": "OpenSSL"}, "product_version": "3.1.0 <3.1.7"}, {"id": "974e1c66-abfe-3dc9-afe4-f2bf789c5b46", "product": {"name": "OpenSSL"}, "product_version": "3.2.0 <3.2.3"}, {"id": "bd40f004-1a7b-3958-a01d-cd016f48d015", "product": {"name": "OpenSSL"}, "product_version": "1.0.2 <1.0.2zk"}, {"id": "c358d453-82d3-3501-b54b-8b62f5ec4754", "product": {"name": "OpenSSL"}, "product_version": "3.0.0 <3.0.15"}, {"id": "dbc28a6b-9f1c-3b0f-aecb-965b93738426", "product": {"name": "OpenSSL"}, "product_version": "3.3.0 <3.3.2"}], "enisaIdVendor": [{"id": "98384f52-b812-3c34-94e7-e2aca30196c8", "vendor": {"name": "OpenSSL"}}], "isExploited": false}