{"id": "EUVD-2024-2371", "enisaUuid": "64640890-9435-3005-b971-e021c2c90eb7", "description": "GeoServer is an open source server that allows users to share and edit geospatial data. Starting in version 2.10.0 and prior to versions 2.24.4 and 2.25.1, GeoServer's Server Status page and REST API lists all environment variables and Java properties to any GeoServer user with administrative rights as part of those modules' status message. These variables/properties can also contain sensitive information, such as database passwords or API keys/tokens. Additionally, many community-developed GeoServer container images `export` other credentials from their start-up scripts as environment variables to the GeoServer (`java`) process. The precise scope of the issue depends on which container image is used and how it is configured.\n\nThe `about status` API endpoint which powers the Server Status page is only available to administrators.Depending on the operating environment, administrators might have legitimate access to credentials in other ways, but this issue defeats more sophisticated controls (like break-glass access to secrets or role accounts).By default, GeoServer only allows same-origin authenticated API access. This limits the scope for a third-party attacker to use an administrator’s credentials to gain access to credentials. The researchers who found the vulnerability were unable to determine any other conditions under which the GeoServer REST API may be available more broadly.\n\nUsers should update container images to use GeoServer 2.24.4 or 2.25.1 to get the bug fix. As a workaround, leave environment variables and Java system properties hidden by default. Those who provide the option to re-enable it should communicate the impact and risks so that users can make an informed choice.", "datePublished": "2024-07-01T14:36:05", "dateUpdated": "2024-08-02T02:59:21", "baseScore": 4.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:R/S:U/C:H/I:N/A:N", "references": ["https://github.com/geoserver/geoserver/security/advisories/GHSA-j59v-vgcr-hxvf", "https://nvd.nist.gov/vuln/detail/CVE-2024-34696", "https://github.com/geoserver/geoserver"], "aliases": ["CVE-2024-34696", "GHSA-j59v-vgcr-hxvf"], "assigner": "GitHub_M", "epss": 0.42, "enisaIdProduct": [{"id": "acfb8e62-50fa-3ce5-aedd-d0a5a7d82ee5", "product": {"name": "geoserver"}, "product_version": "2.10.0, < 2.24.4"}, {"id": "d9c7e3ae-3a75-3567-af8f-e73a36231bfc", "product": {"name": "geoserver"}, "product_version": "2.25.0, < 2.25.1"}], "enisaIdVendor": [{"id": "abd5f72e-543f-327f-acad-fc0f14f05b3b", "vendor": {"name": "geoserver"}}], "isExploited": false}