{"id": "EUVD-2024-2637", "enisaUuid": "4fc007b0-b630-3e4f-9607-089c2639d158", "description": "The AWS Cloud Development Kit (CDK) is an open-source framework for defining cloud infrastructure using code. Customers use it to create their own applications which are converted to AWS CloudFormation templates during deployment to a customer’s AWS account. CDK contains pre-built components called \"constructs\" that are higher-level abstractions providing defaults and best practices. This approach enables developers to use familiar programming languages to define complex cloud infrastructure more efficiently than writing raw CloudFormation templates. We identified an issue in AWS Cloud Development Kit (CDK) which, under certain conditions, can result in granting authenticated Amazon Cognito users broader than intended access. Specifically, if a CDK application uses the \"RestApi\" construct with \"CognitoUserPoolAuthorizer\" as the authorizer and uses authorization scopes to limit access. This issue does not affect the availability of the specific API resources. Authenticated Cognito users may gain unintended access to protected API resources or methods, leading to potential data disclosure, and modification issues.  Impacted versions: >=2.142.0;<=2.148.0. A patch is included in CDK versions >=2.148.1. Users are advised to upgrade their AWS CDK version to 2.148.1 or newer and re-deploy their application(s) to address this issue.", "datePublished": "2024-08-27T18:33:31", "dateUpdated": "2024-08-27T19:26:14", "baseScore": 6.4, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:L/I:L/A:N", "references": ["https://github.com/aws/aws-cdk/security/advisories/GHSA-qj85-69xf-2vxq", "https://nvd.nist.gov/vuln/detail/CVE-2024-45037", "https://github.com/aws/aws-cdk/commit/4bee768f07e73ab5fe466f9ad3d1845456a0513b", "https://docs.aws.amazon.com/cdk/v2/guide/home.html", "https://github.com/aws/aws-cdk", "https://github.com/aws/aws-cdk/releases/tag/v2.148.1"], "aliases": ["CVE-2024-45037", "GHSA-qj85-69xf-2vxq"], "assigner": "GitHub_M", "epss": 0.3, "enisaIdProduct": [{"id": "d5b3164a-33f0-3786-a240-1dd809364fff", "product": {"name": "aws-cdk"}, "product_version": "2.142.0, < 2.148.1"}], "enisaIdVendor": [{"id": "1a0a2dfc-bdad-32d1-9abf-b02861b5fade", "vendor": {"name": "aws"}}], "isExploited": false}