{"id": "EUVD-2024-3484", "enisaUuid": "13981609-78f8-31f3-bb34-00d99072ff92", "description": "sigstore-java is a sigstore java client for interacting with sigstore infrastructure. sigstore-java has insufficient verification for a situation where a bundle provides a invalid signature for a checkpoint. This bug impacts clients using any variation of KeylessVerifier.verify(). Currently checkpoints are only used to ensure the root hash of an inclusion proof was provided by the log in question. Failing to validate that means a bundle may provide an inclusion proof that doesn't actually correspond to the log in question. This may eventually lead a monitor/witness being unable to detect when a compromised logs are providing different views of themselves to different clients. There are other mechanisms right now that mitigate this, such as the signed entry timestamp. Sigstore-java currently requires a valid signed entry timestamp. By correctly verifying the signed entry timestamp we can make certain assertions about the log signing the log entry (like the log was aware of the artifact signing event and signed it). Therefore the impact on clients that are not monitors/witnesses is very low. This vulnerability is fixed in 1.2.0.", "datePublished": "2024-12-05T22:08:37", "dateUpdated": "2024-12-10T14:55:08", "baseScore": 2.1, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:L/AC:L/AT:P/PR:N/UI:N/VC:N/VI:L/VA:N/SC:N/SI:N/SA:N", "references": ["https://github.com/sigstore/sigstore-java/security/advisories/GHSA-jp26-88mw-89qr", "https://nvd.nist.gov/vuln/detail/CVE-2024-54140", "https://github.com/sigstore/sigstore-conformance/pull/139", "https://github.com/sigstore/sigstore-java/commit/23fb4885e6704a5df4977f7acf253a745349edf9", "https://github.com/sigstore/sigstore-java"], "aliases": ["CVE-2024-54140", "GHSA-jp26-88mw-89qr"], "assigner": "GitHub_M", "epss": 0.05, "enisaIdProduct": [{"id": "7b7f423f-a3c9-31f6-9a9e-272c03f586e0", "product": {"name": "sigstore-java"}, "product_version": "< 1.2.0"}], "enisaIdVendor": [{"id": "55402cbe-aa0f-3e4c-8ece-2dc5a6746c48", "vendor": {"name": "sigstore"}}], "isExploited": false}