{"id": "EUVD-2024-53110", "enisaUuid": "cd4a24f6-379e-3bee-a603-cc1dd66360bb", "description": "GoCD is a continuous deliver server. GoCD versions 18.9.0 through 24.4.0 (inclusive) can allow GoCD admins to abuse the backup configuration \"post-backup script\" feature to potentially execute arbitrary scripts on the hosting server or container as GoCD's user, rather than pre-configured scripts. In practice the impact of this vulnerability is limited, as in most configurations a user who can log into the GoCD UI as an admin also has host administration permissions for the host/container that GoCD runs on, in order to manage artifact storage and other service-level configuration options. Additionally, since a GoCD admin has ability to configure and schedule pipelines tasks on all GoCD agents available to the server, the fundamental functionality of GoCD allows co-ordinated task execution similar to that of post-backup-scripts. However in restricted environments where the host administration is separated from the role of a GoCD admin, this may be unexpected. The issue is fixed in GoCD 24.5.0. Post-backup scripts can no longer be executed from within certain sensitive locations on the GoCD server. No known workarounds are available.", "datePublished": "2025-01-03T15:41:40", "dateUpdated": "2025-01-03T17:50:41", "baseScore": 3.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:L/I:L/A:N", "references": ["https://github.com/gocd/gocd/security/advisories/GHSA-7jr3-gh3w-vjxq", "https://github.com/gocd/gocd/commit/631f315d17fcb73f310eee6c881974c9b55ca9f0", "https://github.com/gocd/gocd/releases/tag/24.5.0", "https://www.gocd.org/releases/#24-5-0"], "aliases": ["CVE-2024-56321"], "assigner": "GitHub_M", "epss": 0.88, "enisaIdProduct": [{"id": "82d75734-89c3-3745-8337-fba823a8ff5c", "product": {"name": "gocd"}, "product_version": "18.9.0, < 24.5.0"}], "enisaIdVendor": [{"id": "c288c13b-1590-3536-8ba6-d669ddadcd62", "vendor": {"name": "gocd"}}], "isExploited": false}