{"id": "EUVD-2024-1043", "enisaUuid": "5edb7957-2e7b-39b8-ba51-214c28f176c2", "description": "libosdp is an implementation of IEC 60839-11-5 OSDP (Open Supervised Device Protocol) and provides a C library with support for C++, Rust and Python3. In affected versions an unexpected `REPLY_CCRYPT` or `REPLY_RMAC_I` may be introduced into an active stream when they should not be. Once RMAC_I message can be sent during a session, attacker with MITM access to the communication may intercept the original RMAC_I reply and save it. While the session continues, the attacker will record all of the replies and save them, till capturing the message to be replied (can be detected by ID, length or time based on inspection of visual activity next to the reader) Once attacker captures a session with the message to be replayed, he stops resetting the connection and waits for signal to perform the replay to of the PD to CP message (ex: by signaling remotely to the MIMT device or setting a specific timing). In order to replay, the attacker will craft a specific RMAC_I message in the proper seq of the execution, which will result in reverting the RMAC to the beginning of the session. At that phase - attacker can replay all the messages from the beginning of the session. This issue has been addressed in commit `298576d9` which is included in release version 3.0.0. Users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2024-11-11T19:10:48", "dateUpdated": "2024-11-12T14:48:17", "baseScore": 5.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N", "references": ["https://github.com/goToMain/libosdp/security/advisories/GHSA-xhjw-7vh5-qxqm", "https://nvd.nist.gov/vuln/detail/CVE-2024-52288", "https://github.com/goToMain/libosdp/commit/298576d9214b48214092eebdd892ec77be085e5a", "https://github.com/goToMain/libosdp"], "aliases": ["CVE-2024-52288", "GHSA-xhjw-7vh5-qxqm"], "assigner": "GitHub_M", "epss": 0.04, "enisaIdProduct": [{"id": "a87acd77-c882-363e-a891-74d1670ff917", "product": {"name": "libosdp"}, "product_version": "< 3.0.0"}], "enisaIdVendor": [{"id": "45219428-a6d5-31f9-a4de-2b67b7c0998f", "vendor": {"name": "goToMain"}}], "isExploited": false}