{"id": "EUVD-2024-1741", "enisaUuid": "27ba419a-65b8-33b6-a1ee-5f7590a98477", "description": "Apollo Router is a configurable, graph router written in Rust to run a federated supergraph that uses Apollo Federation 2. The affected versions of Apollo Router contain a bug that in limited circumstances, could lead to unexpected operations being executed which can result in unintended data or effects. This only affects Router instances configured to use distributed query plan caching. The root cause of this defect is a bug in Apollo Router’s cache retrieval logic: When this defect is present and distributed query planning caching is enabled, asking the Router to execute an operation (whether it is a query, a mutation, or a subscription) may result in an unexpected variation of that operation being executed or the generation of unexpected errors. The issue stems from inadvertently executing a modified version of a previously executed operation, whose query plan is stored in the underlying cache (specifically, Redis). Depending on the type of the operation, the result may vary. For a query, results may be fetched that don’t match what was requested (e.g., rather than running `fetchUsers(type: ENTERPRISE)` the Router may run `fetchUsers(type: TRIAL)`. For a mutation, this may result in incorrect mutations being sent to underlying subgraph servers (e.g., rather than sending `deleteUser(id: 10)` to a subgraph, the Router may run `deleteUser(id: 12)`. Users who are using distributed query plan caching, are advised to either upgrade to version 1.45.1 or above or downgrade to version 1.43.2 of the Apollo Router. Apollo Router versions 1.44.0 or 1.45.0 are not recommended for use and have been withdrawn. Users unable to upgrade can disable distributed query plan caching to mitigate this issue.", "datePublished": "2024-05-02T06:43:27", "dateUpdated": "2024-08-02T02:27:52", "baseScore": 9.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:C/C:H/I:H/A:H", "references": ["https://github.com/apollographql/router/security/advisories/GHSA-q9p4-hw9m-fj2v", "https://nvd.nist.gov/vuln/detail/CVE-2024-32971", "https://github.com/apollographql/router/commit/ff9f666598cd17661880fe7fc6e9c9611316e529", "https://github.com/apollographql/router", "https://github.com/apollographql/router/releases/tag/v1.45.1", "https://www.apollographql.com/docs/router/configuration/distributed-caching/#distributed-query-plan-caching"], "aliases": ["CVE-2024-32971", "GHSA-q9p4-hw9m-fj2v"], "assigner": "GitHub_M", "epss": 0.21, "enisaIdProduct": [{"id": "9f846036-6783-30a9-94a5-0505e015ed5b", "product": {"name": "Router"}, "product_version": "1.44.0, <1.45.1"}], "enisaIdVendor": [{"id": "b4b129b6-3168-3c4c-bb7c-dd0f9cee04b5", "vendor": {"name": "apollographql"}}], "isExploited": false}