{"id": "EUVD-2024-2661", "enisaUuid": "1e3deecf-b05a-3171-a669-dffd0be4257e", "description": "Nuxt is a free and open-source framework to create full-stack web applications and websites with Vue.js. The `navigateTo` function attempts to blockthe `javascript:` protocol, but does not correctly use API's provided by `unjs/ufo`. This library also contains parsing discrepancies.  The function first tests to see if the specified URL has a protocol. This uses the unjs/ufo package for URL parsing. This function works effectively, and returns true for a javascript: protocol. After this, the URL is parsed using the parseURL function. This function will refuse to parse poorly formatted URLs. Parsing javascript:alert(1) returns null/\"\" for all values. Next, the protocol of the URL is then checked using the isScriptProtocol function. This function simply checks the input against a list of protocols, and does not perform any parsing. The combination of refusing to parse poorly formatted URLs, and not performing additional parsing means that script checks fail as no protocol can be found. Even if a protocol was identified, whitespace is not stripped in the parseURL implementation, bypassing the isScriptProtocol checks. Certain special protocols are identified at the top of parseURL. Inserting a newline or tab into this sequence will block the special protocol check, and bypass the latter checks. This ONLY has impact after SSR has occured, the `javascript:` protocol within a location header does not trigger XSS. This issue has been addressed in release version 3.12.4 and all users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2024-08-05T20:35:13", "dateUpdated": "2024-08-08T15:51:24", "baseScore": 6.3, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L", "references": ["https://github.com/nuxt/nuxt/security/advisories/GHSA-vf6r-87q4-2vjf", "https://nvd.nist.gov/vuln/detail/CVE-2024-34343", "https://github.com/nuxt/nuxt"], "aliases": ["CVE-2024-34343", "GHSA-vf6r-87q4-2vjf"], "assigner": "GitHub_M", "epss": 0.17, "enisaIdProduct": [{"id": "09f20968-66cb-3786-ba85-a53e1c2c7eaa", "product": {"name": "nuxt"}, "product_version": "< 3.12.4"}], "enisaIdVendor": [{"id": "ab5bddf3-724e-395a-be9f-44ee63aee5a2", "vendor": {"name": "nuxt"}}], "isExploited": false}