{"id": "EUVD-2024-35254", "enisaUuid": "ae8bde04-c047-3143-bdc4-4ea44ecccf09", "description": "MIT IdentiBot is an open-source Discord bot written in Node.js that verifies individuals' affiliations with MIT, grants them roles in a Discord server, and stores information about them in a database backend. A vulnerability that exists prior to commit 48e3e5e7ead6777fa75d57c7711c8e55b501c24e impacts all users who have performed verification with an instance of MIT IdentiBot that meets the following conditions: The instance of IdentiBot is tied to a \"public\" Discord application—i.e., users other than the API access registrant can add it to servers; *and* the instance has not yet been patched. In affected versions, IdentiBot does not check that a server is authorized before allowing members to execute slash and user commands in that server. As a result, any user can join IdentiBot to their server and then use commands (e.g., `/kerbid`) to reveal the full name and other information about a Discord user who has verified their affiliation with MIT using IdentiBot. The latest version of MIT IdentiBot contains a patch for this vulnerability (implemented in commit 48e3e5e7ead6777fa75d57c7711c8e55b501c24e). There is no way to prevent exploitation of the vulnerability without the patch. To prevent exploitation of the vulnerability, all vulnerable instances of IdentiBot should be taken offline until they have been updated.", "datePublished": "2024-05-27T17:07:09", "dateUpdated": "2024-08-02T03:07:46", "baseScore": 7.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N", "references": ["https://github.com/ZelnickB/mit-identibot/security/advisories/GHSA-h8r9-7r8x-78v6", "https://github.com/ZelnickB/mit-identibot/commit/48e3e5e7ead6777fa75d57c7711c8e55b501c24e"], "aliases": ["CVE-2024-35237"], "assigner": "GitHub_M", "epss": 0.13, "enisaIdProduct": [{"id": "e046d1a1-43ec-368d-bb38-c8910afe6b71", "product": {"name": "mit-identibot"}, "product_version": "< 48e3e5e7ead6777fa75d57c7711c8e55b501c24e"}], "enisaIdVendor": [{"id": "528fbe22-bc62-3032-b323-d4f5de44290e", "vendor": {"name": "ZelnickB"}}], "isExploited": false}