{"id": "EUVD-2024-2869", "enisaUuid": "6ebfa312-73d5-3294-bcd8-5829933c444b", "description": "Wire UI is a library of components and resources to empower Laravel and Livewire application development. A potential Cross-Site Scripting (XSS) vulnerability has been identified in the `/wireui/button` endpoint, specifically through the `label` query parameter. Malicious actors could exploit this vulnerability by injecting JavaScript into the `label` parameter, leading to the execution of arbitrary code in the victim's browser. The `/wireui/button` endpoint dynamically renders button labels based on user-provided input via the `label` query parameter. Due to insufficient sanitization or escaping of this input, an attacker can inject malicious JavaScript. By crafting such a request, an attacker can inject arbitrary code that will be executed by the browser when the endpoint is accessed. If exploited, this vulnerability could allow an attacker to execute arbitrary JavaScript code in the context of the affected website. This could lead to: **Session Hijacking**: Stealing session cookies, tokens, or other sensitive information. **User Impersonation**: Performing unauthorized actions on behalf of authenticated users. **Phishing**: Redirecting users to malicious websites. **Content Manipulation**: Altering the appearance or behavior of the affected page to mislead users or execute further attacks. The severity of this vulnerability depends on the context of where the affected component is used, but in all cases, it poses a significant risk to user security. This issue has been addressed in release versions 1.19.3 and 2.1.3. Users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2024-09-17T18:22:32", "dateUpdated": "2024-09-18T14:12:18", "baseScore": 5.1, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:A/VC:L/VI:L/VA:N/SC:L/SI:L/SA:N", "references": ["https://github.com/wireui/wireui/security/advisories/GHSA-rw5h-g8xq-6877", "https://nvd.nist.gov/vuln/detail/CVE-2024-45803", "https://github.com/wireui/wireui/commit/784c4f110e58eb41d0f2bdecd4655ea417f16e7e", "https://github.com/wireui/wireui/commit/a457654912055f4dcc559da04d4e319f76b80fc5", "https://github.com/wireui/wireui"], "aliases": ["CVE-2024-45803", "GHSA-rw5h-g8xq-6877"], "assigner": "GitHub_M", "epss": 0.32, "enisaIdProduct": [{"id": "db091cdb-78b6-361e-9238-2396b10a0af7", "product": {"name": "wireui"}, "product_version": "2.0.0, < 2.1.3"}, {"id": "ddbb9eec-d187-3ab1-ad92-816f274730c3", "product": {"name": "wireui"}, "product_version": "< 1.19.3"}], "enisaIdVendor": [{"id": "00a3054a-0f88-3ff7-a9c3-010b124153f2", "vendor": {"name": "wireui"}}], "isExploited": false}