{"id": "EUVD-2024-42267", "enisaUuid": "bc5293bb-8ab1-3ec4-ad88-6398ef9ce6ff", "description": "Power Platform Terraform Provider allows managing environments and other resources within Power Platform. Versions prior to 3.0.0 have an issue in the Power Platform Terraform Provider where sensitive information, specifically the `client_secret` used in the service principal authentication, may be exposed in logs. This exposure occurs due to an error in the logging code that causes the `client_secret` to not be properly masked when logs are persisted or viewed. Users should upgrade to version 3.0.0 to receive a patched version of the provider that removes all logging of sensitive content. Users who have used this provider with the affected versions should take the following additional steps to mitigate the risk: Immediately rotate the `client_secret` for any service principal that has been configured using this Terraform provider. This will invalidate any potentially exposed secrets. Those who have set the `TF_LOG_PATH` environment variable or configured Terraform to persist logs to a file or an external system, consider disabling this until they have updated to a fixed version of the provider. Those who have existing logs that may contain the `client_secret` should remove or sanitize these logs to prevent unauthorized access. This includes logs on disk, in monitoring systems, or in logging services.", "datePublished": "2024-09-25T21:21:28", "dateUpdated": "2024-09-26T15:39:10", "baseScore": 8.8, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:L/AC:L/AT:P/PR:L/UI:N/VC:H/VI:H/VA:H/SC:H/SI:H/SA:H", "references": ["https://github.com/microsoft/terraform-provider-power-platform/security/advisories/GHSA-7w3w-pjm5-m36c", "https://github.com/microsoft/terraform-provider-power-platform/releases/tag/v3.0.0", "https://registry.terraform.io/providers/microsoft/power-platform/latest/docs#authenticating-to-power-platform-using-a-service-principal-with-oidc"], "aliases": ["CVE-2024-47083"], "assigner": "GitHub_M", "epss": 2.09, "enisaIdProduct": [{"id": "292f1109-1357-365c-94dc-356c363756b5", "product": {"name": "terraform-provider-power-platform"}, "product_version": "< 3.0.0"}], "enisaIdVendor": [{"id": "4ad725e1-8cb2-3129-a9c3-33b840a8a377", "vendor": {"name": "Microsoft"}}], "isExploited": false}