{"id": "EUVD-2024-36563", "enisaUuid": "67121fd8-a9f9-3918-8a2d-a58b56914edd", "description": "The AWS Deployment Framework (ADF) is a framework to manage and deploy resources across multiple AWS accounts and regions within an AWS Organization. ADF allows for staged, parallel, multi-account, cross-region deployments of applications or resources via the structure defined in AWS Organizations while taking advantage of services such as AWS CodePipeline, AWS CodeBuild, and AWS CodeCommit to alleviate the heavy lifting and management compared to a traditional CI/CD setup. ADF contains a bootstrap process that is responsible to deploy ADF's bootstrap stacks to facilitate multi-account cross-region deployments. The ADF bootstrap process relies on elevated privileges to perform this task. Two versions of the bootstrap process exist; a code-change driven pipeline using AWS CodeBuild and an event-driven state machine using AWS Lambda. If an actor has permissions to change the behavior of the CodeBuild project or the Lambda function, they would be able to escalate their privileges.\n\nPrior to version 4.0.0, the bootstrap CodeBuild role provides access to the `sts:AssumeRole` operation without further restrictions. Therefore, it is able to assume into any AWS Account in the AWS Organization with the elevated privileges provided by the cross-account access role. By default, this role is not restricted when it is created by AWS Organizations, providing Administrator level access to the AWS resources in the AWS Account. The patches for this issue are included in `aws-deployment-framework` version 4.0.0.\n\nAs a temporary mitigation, add a permissions boundary to the roles created by ADF in the management account. The permissions boundary should deny all IAM and STS actions. This permissions boundary should be in place until you upgrade ADF or bootstrap a new account. While the permissions boundary is in place, the account management and bootstrapping of accounts are unable to create, update, or assume into roles. This mitigates the privilege escalation risk, but also disables ADF's ability to create, manage, and bootstrap accounts.", "datePublished": "2024-06-11T16:49:33", "dateUpdated": "2024-08-02T03:50:55", "baseScore": 7.6, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:C/C:H/I:H/A:H", "references": ["https://github.com/awslabs/aws-deployment-framework/security/advisories/GHSA-mcj7-ppmv-h6jr", "https://github.com/awslabs/aws-deployment-framework/pull/732", "https://docs.aws.amazon.com/IAM/latest/UserGuide/access_policies_boundaries.html", "https://github.com/awslabs/aws-deployment-framework/releases/tag/v4.0.0"], "aliases": ["CVE-2024-37293"], "assigner": "GitHub_M", "epss": 0.15, "enisaIdProduct": [{"id": "dacc3114-5cf7-34d0-bc00-413fbe92ce9b", "product": {"name": "aws-deployment-framework"}, "product_version": "< 4.0.0"}], "enisaIdVendor": [{"id": "d2b3c7d9-d5da-3250-8ebc-bcb6a22634c1", "vendor": {"name": "awslabs"}}], "isExploited": false}