{"id": "EUVD-2024-2401", "enisaUuid": "030d65d3-9df7-3f28-a725-86b7babc0773", "description": "The netty incubator codec.bhttp is a java language binary http parser. In affected versions the `BinaryHttpParser` class does not properly validate input values thus giving attackers almost complete control over the HTTP requests constructed from the parsed output. Attackers can abuse several issues individually to perform various injection attacks including HTTP request smuggling, desync attacks, HTTP header injections, request queue poisoning, caching attacks and Server Side Request Forgery (SSRF). Attacker could also combine several issues to create well-formed messages for other text-based protocols which may result in attacks beyond the HTTP protocol. The BinaryHttpParser class implements the readRequestHead method which performs most of the relevant parsing of the received request. The data structure prefixes values with a variable length integer value. The parsing code below first gets the lengths of the values from the prefixed variable length integer. After it has all of the lengths and calculates all of the indices, the parser casts the applicable slices of the ByteBuf to String. Finally, it passes these values into a new `DefaultBinaryHttpRequest` object where no further parsing or validation occurs. Method is partially validated while other values are not validated at all. Software that relies on netty to apply input validation for binary HTTP data may be vulnerable to various injection and protocol based attacks. This issue has been addressed in version 0.0.13.Final. Users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2024-07-18T22:21:58", "dateUpdated": "2024-08-02T04:33:11", "baseScore": 8.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H", "references": ["https://github.com/netty/netty-incubator-codec-ohttp/security/advisories/GHSA-q8f2-hxq5-cp4h", "https://nvd.nist.gov/vuln/detail/CVE-2024-40642", "https://github.com/netty/netty-incubator-codec-ohttp/commit/b687a0cf6ea1030232ea204d73bce82f2698e571", "https://github.com/netty/netty-incubator-codec-ohttp"], "aliases": ["CVE-2024-40642", "GHSA-q8f2-hxq5-cp4h"], "assigner": "GitHub_M", "epss": 0.92, "enisaIdProduct": [{"id": "93b81811-008c-3f8f-b1ee-e5e85ca1286b", "product": {"name": "netty-incubator-codec-ohttp"}, "product_version": "< 0.0.13.Final"}], "enisaIdVendor": [{"id": "53c7b3ad-2f0c-3f83-b702-a21b47f9449b", "vendor": {"name": "netty"}}], "isExploited": false}