{"id": "EUVD-2024-40398", "enisaUuid": "887629a1-5332-3a3c-8a32-b025d1fd433d", "description": "Improper Neutralization of Special Elements used in a Command ('Command Injection') vulnerability in Iocharger  firmware for AC models allows OS Command Injection as root\nThis issue affects all Iocharger AC EV charger models on a firmware version before 25010801.\n\nLikelihood: Moderate – The <redacted> binary does not seem to be used by the web interface, so it might be more difficult to find. It seems to be largely the same binary as used by the Iocharger Pedestal charging station, however. The attacker will also need a (low privilege) account to gain access to the <redacted> binary, or convince a user with such access to execute a crafted HTTP request.\n\nImpact: Critical – The attacker has full control over the charging station as the root user, and can arbitrarily add, modify and delete\nfiles and services.\n\nCVSS clarification: Any network interface serving the web ui is vulnerable (AV:N) and there are not additional security measures to circumvent (AC:L), nor does the attack require and existing preconditions (AT:N). The attack is authenticated, but the level of authentication does not matter (PR:L), nor is any user interaction required (UI:N). The attack leads to a full compromised (VC:H/VI:H/VA:H), and compromised devices can be used to pivot into networks that should potentially not be accessible (SC:L/SI:L/SA:H). Becuase this is an EV charger handing significant power, there is a potential safety impact (S:P). This attack can be automated (AU:Y).", "datePublished": "2025-01-09T07:56:47", "dateUpdated": "2025-01-09T14:33:30", "baseScore": 9.3, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:L/SI:L/SA:H/S:P/AU:Y", "references": ["https://csirt.divd.nl/DIVD-2024-00035/", "https://csirt.divd.nl/CVE-2024-43654/", "https://iocharger.com"], "aliases": ["CVE-2024-43654"], "assigner": "DIVD", "epss": 2.88, "enisaIdProduct": [{"id": "1b677f31-bda4-32d9-926e-21e61e5dce78", "product": {"name": "Iocharger firmware for AC models"}, "product_version": "0 <25010801"}], "enisaIdVendor": [{"id": "7fa4ad1c-8ef8-3d0a-b537-fd744636050e", "vendor": {"name": "Iocharger"}}], "isExploited": false}