{"id": "EUVD-2024-1206", "enisaUuid": "020cc873-8546-39af-ac59-a5bd41c63118", "description": "Insertion of Sensitive Information into Log File vulnerability in the Apache Solr Operator.\n\nThis issue affects all versions of the Apache Solr Operator from 0.3.0 through 0.8.0.\n\nWhen asked to bootstrap Solr security, the operator will enable basic authentication and create several accounts for accessing Solr: including the \"solr\" and \"admin\" accounts for use by end-users, and a \"k8s-oper\" account which the operator uses for its own requests to Solr.\nOne common source of these operator requests is healthchecks: liveness, readiness, and startup probes are all used to determine Solr's health and ability to receive traffic.\nBy default, the operator configures the Solr APIs used for these probes to be exempt from authentication, but users may specifically request that authentication be required on probe endpoints as well.\nWhenever one of these probes would fail, if authentication was in use, the Solr Operator would create a Kubernetes \"event\" containing the username and password of the \"k8s-oper\" account.\n\nWithin the affected version range, this vulnerability affects any solrcloud resource which (1) bootstrapped security through use of the `.solrOptions.security.authenticationType=basic` option, and (2) required authentication be used on probes by setting `.solrOptions.security.probesRequireAuth=true`.\n\nUsers are recommended to upgrade to Solr Operator version 0.8.1, which fixes this issue by ensuring that probes no longer print the credentials used for Solr requests.  Users may also mitigate the vulnerability by disabling authentication on their healthcheck probes using the setting `.solrOptions.security.probesRequireAuth=false`.", "datePublished": "2024-04-12T15:00:26", "dateUpdated": "2025-03-13T19:45:50", "baseScore": 6.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N", "references": ["https://nvd.nist.gov/vuln/detail/CVE-2024-31391", "https://github.com/apache/solr-operator", "https://lists.apache.org/thread/w7011s78lzywzwyszvy4d8zm99ybt8c7", "http://www.openwall.com/lists/oss-security/2024/04/12/7"], "aliases": ["CVE-2024-31391", "GHSA-g9qx-25vj-rf53"], "assigner": "apache", "epss": 0.04, "enisaIdProduct": [{"id": "635e45ae-ef74-3604-adef-c59381d9e08b", "product": {"name": "Apache Solr Operator"}, "product_version": "0.3.0 ≤0.8.0"}, {"id": "71d68704-c629-3227-99e7-723719fef5f6", "product": {"name": "Apache Solr Operator"}}], "enisaIdVendor": [{"id": "8a90ccc3-bf43-355b-a1f9-d5acce113cdb", "vendor": {"name": "Apache Software Foundation"}}], "isExploited": false}