{"id": "EUVD-2024-36474", "enisaUuid": "b061c36b-4ecc-347c-a0cc-68b4a1018972", "description": "Computer Vision Annotation Tool (CVAT) is an interactive video and image annotation tool for computer vision. CVAT allows users to supply custom endpoint URLs for cloud storages based on Amazon S3 and Azure Blob Storage. Starting in version 2.1.0 and prior to version 2.14.3, an attacker with a CVAT account can exploit this feature by specifying URLs whose host part is an intranet IP address or an internal domain name. By doing this, the attacker may be able to probe the network that the CVAT backend runs in for HTTP(S) servers. In addition, if there is a web server on this network that is sufficiently API-compatible with an Amazon S3 or Azure Blob Storage endpoint, and either allows anonymous access, or allows authentication with credentials that are known by the attacker, then the attacker may be able to create a cloud storage linked to this server. They may then be able to list files on the server; extract files from the server, if these files are of a type that CVAT supports reading from cloud storage (media data (such as images/videos/archives), importable annotations or datasets, task/project backups); and/or overwrite files on this server with exported annotations/datasets/backups. The exact capabilities of the attacker will depend on how the internal server is configured. Users should upgrade to CVAT 2.14.3 to receive a patch. In this release, the existing SSRF mitigation measures are applied to requests to cloud providers, with access to intranet IP addresses prohibited by default. Some workarounds are also available. One may use network security solutions such as virtual networks or firewalls to prohibit network access from the CVAT backend to unrelated servers on your internal network and/or require authentication for access to internal servers.", "datePublished": "2024-06-13T14:10:16", "dateUpdated": "2024-08-02T03:50:54", "baseScore": 7.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:C/C:L/I:H/A:N", "references": ["https://github.com/cvat-ai/cvat/security/advisories/GHSA-q684-4jjh-83g6", "https://github.com/cvat-ai/cvat/commit/f2346934c80bd91740f55c2788ef7d535a291d4c"], "aliases": ["CVE-2024-37164"], "assigner": "GitHub_M", "epss": 0.21, "enisaIdProduct": [{"id": "462c6f38-132a-3f96-b907-43dc5b8ca131", "product": {"name": "cvat"}, "product_version": "2.1.0, < 2.14.3"}], "enisaIdVendor": [{"id": "4778893e-6045-37bd-a76e-82a6e52a7328", "vendor": {"name": "cvat-ai"}}], "isExploited": false}