{"id": "EUVD-2024-0082", "enisaUuid": "be3ee80a-994f-3781-9705-b4166f69e6d2", "description": "Label Studio is an a popular open source data labeling tool. Versions prior to 1.9.2 have a cross-site scripting (XSS) vulnerability that could be exploited when an authenticated user uploads a crafted image file for their avatar that gets rendered as a HTML file on the website. Executing arbitrary JavaScript could result in an attacker performing malicious actions on Label Studio users if they visit the crafted avatar image. For an example, an attacker can craft a JavaScript payload that adds a new Django Super Administrator user if a Django administrator visits the image.\\n\\nThe file `users/functions.py` lines 18-49 show that the only verification check is that the file is an image by extracting the dimensions from the file. Label Studio serves avatar images using Django's built-in `serve` view, which is not secure for production use according to Django's documentation. The issue with the Django `serve` view is that it determines the `Content-Type` of the response by the file extension in the URL path. Therefore, an attacker can upload an image that contains malicious HTML code and name the file with a `.html` extension to be rendered as a HTML page. The only file extension validation is performed on the client-side, which can be easily bypassed.\\n\\nVersion 1.9.2 fixes this issue. Other remediation strategies include validating the file extension on the server side, not in client-side code; removing the use of Django's `serve` view and implement a secure controller for viewing uploaded avatar images; saving file content in the database rather than on the filesystem to mitigate against other file related vulnerabilities; and avoiding trusting user controlled inputs.", "datePublished": "2024-01-24T01:15:00", "dateUpdated": "2024-11-21T04:22:53", "baseScore": 7.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:L", "references": ["https://github.com/HumanSignal/label-studio/security/advisories/GHSA-q68h-xwq5-mm7x", "https://github.com/HumanSignal/label-studio/security/advisories/GHSA-q68h-xwq5-mm7x", "https://github.com/HumanSignal/label-studio/commit/a7a71e594f32ec4af8f3f800d5ccb8662e275da3", "https://docs.djangoproject.com/en/4.2/ref/views/#serving-files-in-development", "https://github.com/HumanSignal/label-studio/blob/1.8.2/label_studio/users/functions.py#L18-L49", "https://github.com/HumanSignal/label-studio/blob/1.8.2/label_studio/users/urls.py#L25-L26", "https://nvd.nist.gov/vuln/detail/CVE-2023-47115", "https://github.com/pypa/advisory-database/tree/main/vulns/label-studio/PYSEC-2024-126.yaml"], "aliases": ["CVE-2023-47115", "GHSA-q68h-xwq5-mm7x", "PYSEC-2024-126"], "assigner": "GitHub_M", "epss": 2.3, "enisaIdProduct": [{"id": "9eb07608-91d1-3764-b930-e0afafbb8521", "product": {"name": "label-studio"}, "product_version": "< 1.9.2"}], "enisaIdVendor": [{"id": "4b1eb47c-8771-30ce-a175-9953f7cfc4b8", "vendor": {"name": "HumanSignal"}}], "isExploited": false}