{"id": "EUVD-2024-40394", "enisaUuid": "950f45b7-8b11-3ef6-b48e-854be3de21f7", "description": "Improper Neutralization of Special Elements used in a Command ('Command Injection') vulnerability in Iocharger firmware for AC models allows OS Command Injection as root\n\nThis issue affects  firmware versions before 24120701.\n\nLikelihood: Moderate – The <redacted> binary does not seem to be used by the web interface, so it might be more difficult to find. It seems to be largely the same binary as used by the Iocharger Pedestal charging station, however. The attacker will also need a (low privilege) account to gain access to the <redacted> binary, or convince a user with such access to execute a crafted HTTP request.\n\nImpact: Critical – The attacker has full control over the charging station as the root user, and can arbitrarily add, modify and delete\nfiles and services.\n\nCVSS clarification: The attack can be executed over any network connection serving the web interface (AV:N). There are no additional measures that need to be circumvented (AC:L) or attack preconditions (AT:N). THe attack is privileged, but the level does not matter (PR:L) and does not require user interaction (UI:N). Attack leads to full system compromised (VC:H/VI:H/VA:H) and compromised devices can be used to \"pivot\" to other networks that should be unreachable (SC:L/SI:L/SA:H). Because this an EV charger using high power, there is a potential safety impact (S:P). The attack can be automated (AU:Y).", "datePublished": "2025-01-09T07:56:45", "dateUpdated": "2025-01-09T15:09:57", "baseScore": 9.3, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:L/SI:L/SA:H/S:P/AU:Y", "references": ["https://csirt.divd.nl/DIVD-2024-00035/", "https://csirt.divd.nl/CVE-2024-43650/", "https://iocharger.com"], "aliases": ["CVE-2024-43650"], "assigner": "DIVD", "epss": 4.66, "enisaIdProduct": [{"id": "501d7ff7-c343-3fdb-9892-4e5eaef627ba", "product": {"name": "Iocharger firmware for AC models"}, "product_version": "0 <24120701"}], "enisaIdVendor": [{"id": "c44dafa6-eb0f-3f21-9dc8-196a76d1f61a", "vendor": {"name": "Iocharger"}}], "isExploited": false}