{"id": "EUVD-2024-40400", "enisaUuid": "9907de46-33dc-327c-9af4-a429c78b768e", "description": "Improper Neutralization of Special Elements used in a Command ('Command Injection') vulnerability allows OS Command Injection as root\n\nThis issue affects Iocharger firmware for AC model chargers before version 24120701.\n\nLikelihood: Moderate – It might be difficult for an attacker to identify the file structure of the <redated> directory, and then modify the backup to add a new CGI script in the correct directory. Furthermore, the attacker will need an account to restore the settings backup, or convince a user with such access to upload a modified backup file.\n\nImpact: Critical – The attacker has full control over the charging station as the root user, and can arbitrarily add, modify and deletefiles and services.\n\nCVSS clarification: Any network interface serving the web ui is vulnerable (AV:N) and there are not additional security measures to circumvent (AC:L), nor does the attack require and existing preconditions (AT:N). The attack is authenticated, but the level of authentication does not matter (PR:L), nor is any user interaction required (UI:N). The attack leads to a full compromised (VC:H/VI:H/VA:H), and compromised devices can be used to pivot into networks that should potentially not be accessible (SC:L/SI:L/SA:H). Becuase this is an EV charger handing significant power, there is a potential safety impact (S:P). This attack can be automated (AU:Y).", "datePublished": "2025-01-09T07:56:45", "dateUpdated": "2025-01-09T14:50:41", "baseScore": 9.3, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:L/SI:L/SA:H/S:P/AU:Y", "references": ["https://csirt.divd.nl/DIVD-2024-00035/", "https://csirt.divd.nl/CVE-2024-43656/", "https://iocharger.com"], "aliases": ["CVE-2024-43656"], "assigner": "DIVD", "epss": 1.75, "enisaIdProduct": [{"id": "ae74c09c-0b4e-319d-8214-e8d7fad0d24e", "product": {"name": "Iocharger firmware for AC models"}, "product_version": "0 <24120701"}], "enisaIdVendor": [{"id": "3088398f-ae45-302b-88ff-7e9d70cd2e7c", "vendor": {"name": "Iocharger"}}], "isExploited": false}