{"id": "EUVD-2024-43133", "enisaUuid": "a67bdfc3-d4cc-36f0-b240-9081e68c629b", "description": "Cursor is a code editor built for programming with AI. Prior to Sep 27, 2024, if a user generated a terminal command via Cursor's Terminal Cmd-K/Ctrl-K feature and if the user explicitly imported a malicious web page into the Terminal Cmd-K prompt, an attacker with control over the referenced web page could have a significant chance of influencing a language model to output arbitrary commands for execution in the user's terminal. This scenario would require the user explicitly opt-in to including the contents of a compromised webpage, and it would require that the attacker display prompt injection text in the the contents of the compromised webpage.\n\nA server-side patch to not stream back newlines or control characters was released on September 27, 2024, within two hours of the issue being reported. Additionally, Cursor 0.42 includes client-side mitigations to prevent any newline or control character from being streamed into the terminal directly. It also contains a new setting, `\"cursor.terminal.usePreviewBox\"`, which, if set to true, streams the response into a preview box whose contents then have to be manually accepted before being inserted into the terminal. This setting is useful if you're working in a shell environment where commands can be executed without pressing enter or any control character. The patch has been applied server-side, so no additional action is needed, even on older versions of Cursor. Separately, Cursor's maintainers also recommend, as best practice, to only include trusted pieces of context in prompts.", "datePublished": "2024-10-22T20:58:21", "dateUpdated": "2024-10-23T14:49:26", "baseScore": 9.2, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:P/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N", "references": ["https://github.com/getcursor/cursor/security/advisories/GHSA-rmj9-23rg-gr67"], "aliases": ["CVE-2024-48919"], "assigner": "GitHub_M", "epss": 0.23, "enisaIdProduct": [{"id": "7bdfe91b-a185-36fd-a57a-ac9acc38b4a2", "product": {"name": "cursor"}, "product_version": "< 0.42"}], "enisaIdVendor": [{"id": "398d2ed6-859d-367b-a2a6-33a75d5faa4d", "vendor": {"name": "getcursor"}}], "isExploited": false}