{"id": "EUVD-2024-2376", "enisaUuid": "6f17d6b7-7705-3c18-9224-96e046de730f", "description": "GeoServer is an open source server that allows users to share and edit geospatial data. Prior to versions 2.23.5 and 2.24.3, if GeoServer is deployed in the Windows operating system using an Apache Tomcat web application server, it is possible to bypass existing input validation in the GeoWebCache ByteStreamController class and read arbitrary classpath resources with specific file name extensions. If GeoServer is also deployed as a web archive using the data directory embedded in the `geoserver.war` file (rather than an external data directory), it will likely be possible to read specific resources to gain administrator privileges. However, it is very unlikely that production environments will be using the embedded data directory since, depending on how GeoServer is deployed, it will be erased and re-installed (which would also reset to the default password) either every time the server restarts or every time a new GeoServer WAR is installed and is therefore difficult to maintain. An external data directory will always be used if GeoServer is running in standalone mode (via an installer or a binary). Versions 2.23.5 and 2.24.3 contain a patch for the issue. Some workarounds are available. One may change from a Windows environment to a Linux environment; or change from Apache Tomcat to Jetty application server. One may also disable anonymous access to the embeded GeoWebCache administration and status pages.", "datePublished": "2024-07-01T14:07:33", "dateUpdated": "2025-11-04T18:29:12", "baseScore": 7.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N", "references": ["https://github.com/geoserver/geoserver/security/advisories/GHSA-jhqx-5v5g-mpf3", "https://nvd.nist.gov/vuln/detail/CVE-2024-24749", "https://github.com/GeoWebCache/geowebcache/pull/1211", "https://github.com/GeoWebCache/geowebcache/commit/c7f76bd8a1d67c3b986146e7a5e0b14dd64a8fef", "https://github.com/geoserver/geoserver", "http://seclists.org/fulldisclosure/2024/Feb/13"], "aliases": ["CVE-2024-24749", "GHSA-jhqx-5v5g-mpf3"], "assigner": "GitHub_M", "epss": 0.3, "enisaIdProduct": [{"id": "22455c55-53e2-3fb3-9915-284ef6e8eff8", "product": {"name": "geoserver"}, "product_version": "< 2.23.5"}, {"id": "5546d2af-82aa-33a3-b726-4e2797290716", "product": {"name": "geoserver"}, "product_version": "2.24.0, < 2.24.3"}], "enisaIdVendor": [{"id": "db93c56d-cb90-3cf7-b77e-b6c95bca5260", "vendor": {"name": "geoserver"}}], "isExploited": false}