{"id": "EUVD-2024-1384", "enisaUuid": "91cc12bc-3e31-3b55-a539-5317204e50d2", "description": "Yamux is a stream multiplexer over reliable, ordered connections such as TCP/IP. The Rust implementation of the Yamux stream multiplexer uses a vector for pending frames. This vector is not bounded in length. Every time the Yamux protocol requires sending of a new frame, this frame gets appended to this vector. This can be remotely triggered in a number of ways, for example by: 1. Opening a new libp2p Identify stream. This causes the node to send its Identify message. Of course, every other protocol that causes the sending of data also works. The larger the response, the more data is enqueued. 2. Sending a Yamux Ping frame. This causes a Pong frame to be enqueued. Under normal circumstances, this queue of pending frames would be drained once they’re sent out over the network. However, the attacker can use TCP’s receive window mechanism to prevent the victim from sending out any data: By not reading from the TCP connection, the receive window will never be increased, and the victim won’t be able to send out any new data (this is how TCP implements backpressure). Once this happens, Yamux’s queue of pending frames will start growing indefinitely. The queue will only be drained once the underlying TCP connection is closed. An attacker can cause a remote node to run out of memory, which will result in the corresponding process getting terminated by the operating system.\n", "datePublished": "2024-05-01T10:45:09", "dateUpdated": "2024-08-02T02:27:53", "baseScore": 7.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H", "references": ["https://github.com/libp2p/rust-yamux/security/advisories/GHSA-3999-5ffv-wp2r", "https://nvd.nist.gov/vuln/detail/CVE-2024-32984", "https://github.com/libp2p/rust-yamux/commit/460baf2ccb7d5982b266cb3cb9c0bdf75b4fb779", "https://github.com/sigp/rust-yamux/commit/6689e227a48258a52347cd1d984adfc94afc6f7a", "https://github.com/libp2p/rust-yamux", "https://github.com/libp2p/rust-yamux/blob/yamux-v0.13.1/yamux/src/connection.rs#L289"], "aliases": ["CVE-2024-32984", "GHSA-3999-5ffv-wp2r"], "assigner": "GitHub_M", "epss": 0.16, "enisaIdProduct": [{"id": "2d3a911f-c2b0-3b47-9876-4b5295a62a1b", "product": {"name": "rust-yamux"}, "product_version": "< 0.13.2"}], "enisaIdVendor": [{"id": "badc6f4a-8f27-31d8-93e7-3449d908dd51", "vendor": {"name": "libp2p"}}], "isExploited": false}