{"id": "EUVD-2024-39872", "enisaUuid": "ca1e788e-37ef-3cf1-87cb-6885da7979c8", "description": "The Versa Director uses PostgreSQL (Postgres) to store operational and configuration data. It is also needed for High Availability function of the Versa Director. The default configuration has a common password across all instances of Versa Director. By default, Versa Director configures Postgres to listen on all network interfaces. This combination allows an unauthenticated attacker to access and administer the database or read local filesystem contents to escalate privileges on the system. \n\nExploitation Status:\nVersa Networks is not aware of this exploitation in any production systems. A proof of concept exists in the lab environment.\n\nWorkarounds or Mitigation:\nStarting with the latest 22.1.4 version of Versa Director, the software will automatically restrict access to the Postgres and HA ports to only the local and peer Versa Directors. For older releases, Versa recommends performing manual hardening of HA ports. Please refer to the following link for the steps https://docs.versa-networks.com/Solutions/System_Hardening/Perform_Manual_Hardening_for_Versa_Director#Secure_HA_Ports  \n\nThis vulnerability is not exploitable on Versa Directors if published Firewall guidelines are implemented. We have validated that no Versa-hosted head ends have been affected by this vulnerability. All Versa-hosted head ends are patched and hardened. \n\nPlease contact Versa Technical Support or Versa account team for any further assistance.\n\nSoftware Download Links:\n22.1.4: https://support.versa-networks.com/support/solutions/articles/23000026708-release-22-1-4", "datePublished": "2024-11-19T17:21:41", "dateUpdated": "2024-11-21T04:55:12", "baseScore": 10.0, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H", "references": ["https://security-portal.versa-networks.com/emailbulletins/6735a300415abb89e9a8a9d3"], "aliases": ["CVE-2024-42450"], "assigner": "hackerone", "epss": 0.36, "enisaIdProduct": [{"id": "22b5b0c6-4b4b-3bd9-ac16-7bbdbd0ff596", "product": {"name": "Director"}, "product_version": "22.1.4 ≤22.1.4"}], "enisaIdVendor": [{"id": "3787a706-c5ce-31d6-bcf5-85599dd711c6", "vendor": {"name": "Versa"}}], "isExploited": false}