{"id": "EUVD-2024-29867", "enisaUuid": "79ebd1a9-2ca0-3681-b694-31a84ee573a2", "description": "Kafka UI is an Open-Source Web UI for Apache Kafka Management. Kafka UI API allows users to connect to different Kafka brokers by specifying their network address and port. As a separate feature, it also provides the ability to monitor the performance of Kafka brokers by connecting to their JMX ports. JMX is based on the RMI protocol, so it is inherently susceptible to deserialization attacks. A potential attacker can exploit this feature by connecting Kafka UI backend to its own malicious broker. This vulnerability affects the deployments where one of the following occurs: 1. dynamic.config.enabled property is set in settings. It's not enabled by default, but it's suggested to be enabled in many tutorials for Kafka UI, including its own README.md. OR  2. an attacker has access to the Kafka cluster that is being connected to Kafka UI. In this scenario the attacker can exploit this vulnerability to expand their access and execute code on Kafka UI as well. Instead of setting up a legitimate JMX port, an attacker can create an RMI listener that returns a malicious serialized object for any RMI call. In the worst case it could lead to remote code execution as Kafka UI has the required gadget chains in its classpath. This issue may lead to post-auth remote code execution. This is particularly dangerous as Kafka-UI does not have authentication enabled by default. This issue has been addressed in version 0.7.2. All users are advised to upgrade. There are no known workarounds for this vulnerability. These issues were discovered and reported by the GitHub Security lab and is also tracked as GHSL-2023-230.", "datePublished": "2024-06-19T16:35:34", "dateUpdated": "2024-08-02T01:59:50", "baseScore": 8.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H", "references": ["https://securitylab.github.com/advisories/GHSL-2023-229_GHSL-2023-230_kafka-ui/", "https://github.com/provectus/kafka-ui/pull/4427", "https://github.com/provectus/kafka-ui/commit/83b5a60cc08501b570a0c4d0b4cdfceb1b88d6b7#diff-37e769f4709c1e78c076a5949bbcead74e969725bfd89c7c4ba6d6f229a411e6R36"], "aliases": ["CVE-2024-32030"], "assigner": "GitHub_M", "epss": 80.07, "enisaIdProduct": [{"id": "68431abd-a797-3ff8-94f5-b04a40a6815c", "product": {"name": "kafka-ui"}, "product_version": "< 0.7.2"}], "enisaIdVendor": [{"id": "b459a051-639f-3cbf-9052-99be006319dc", "vendor": {"name": "provectus"}}], "isExploited": false}