{"id": "EUVD-2024-2583", "enisaUuid": "b6b71cb1-aca0-3c0b-adf8-d9309ca4efc7", "description": "CKAN is an open-source data management system for powering data hubs and data portals. There are a number of CKAN plugins, including XLoader, DataPusher, Resource proxy and ckanext-archiver, that work by downloading the contents of local or remote files in order to perform some actions with their contents (e.g. pushing to the DataStore, streaming contents or saving a local copy). All of them use the resource URL, and there are currently no checks to limit what URLs can be requested. This means that a malicious (or unaware) user can create a resource with a URL pointing to a place where they should not have access in order for one of the previous tools to retrieve it (known as a Server Side Request Forgery). Users wanting to protect against these kinds of attacks can use one or a combination of the following approaches: (1) Use a separate HTTP proxy like Squid that can be used to allow / disallow IPs, domains etc as needed, and make CKAN extensions aware of this setting via the ckan.download_proxy config option. (2) Implement custom firewall rules to prevent access to restricted resources. (3) Use custom validators on the resource url field to block/allow certain domains or IPs. All latest versions of the plugins listed above support the ckan.download_proxy settings. Support for this setting in the Resource Proxy plugin was included in CKAN 2.10.5 and 2.11.0.", "datePublished": "2024-08-21T14:47:31", "dateUpdated": "2024-08-22T19:17:47", "baseScore": 4.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:R/S:U/C:H/I:N/A:N", "references": ["https://github.com/ckan/ckan/security/advisories/GHSA-g9ph-j5vj-f8wm", "https://nvd.nist.gov/vuln/detail/CVE-2024-43371", "https://github.com/ckan/ckan/commit/382beaec98cb331f2a030459ef043c50eaf5ad53", "https://github.com/ckan/ckan/commit/8601183cc2fc87277ea5b33ff75c3a5610812ab5", "https://github.com/ckan/ckan"], "aliases": ["CVE-2024-43371", "GHSA-g9ph-j5vj-f8wm"], "assigner": "GitHub_M", "epss": 0.23, "enisaIdProduct": [{"id": "66067260-a2c6-36f9-93fa-8d35217f0828", "product": {"name": "ckan"}, "product_version": "< 2.10.5"}], "enisaIdVendor": [{"id": "0c17f58b-bf95-37f2-9be9-17ab61e09341", "vendor": {"name": "ckan"}}], "isExploited": false}