{"id": "EUVD-2024-39190", "enisaUuid": "e76aa7a0-7a8f-39ab-a271-787742a3646a", "description": "OpenProject is open source project management software. Prior to version 14.3.0, using a forged HOST header in the default configuration of packaged installations and using the \"Login required\" setting, an attacker could redirect to a remote host to initiate a phishing attack against an OpenProject user's account. This vulnerability affects default packaged installation of OpenProject without any additional configuration or modules on Apache (such as mod_security, manually setting a host name, having a fallthrough VirtualHost). It might also affect other installations that did not take care to fix the HOST/X-Forwarded-Host headers. Version 14.3.0 includes stronger protections for the hostname from within the application using the HostAuthorization middleware of Rails to reject any requests with a host name that does not match the configured one. Also, all generated links by the application are now ensured to use the built-in hostname. Users who aren't able to upgrade immediately may use mod_security for Apache2 or manually fix the Host and X-Forwarded-Host headers in their proxying application before reaching the application server of OpenProject. Alternatively, they can manually apply the patch to opt-in to host header protections in previous versions of OpenProject.", "datePublished": "2024-07-25T16:50:16", "dateUpdated": "2024-08-02T04:46:52", "baseScore": 4.7, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:N/I:L/A:N", "references": ["https://github.com/opf/openproject/security/advisories/GHSA-g92v-vrq6-4fpw", "https://github.com/user-attachments/files/16371759/host-protection.patch", "https://www.openproject.org/docs/release-notes/14-3-0"], "aliases": ["CVE-2024-41801"], "assigner": "GitHub_M", "epss": 0.34, "enisaIdProduct": [{"id": "ae81bb57-22a8-345b-9db1-384db6ed803e", "product": {"name": "openproject"}, "product_version": "< 14.3.0"}], "enisaIdVendor": [{"id": "d7643b0b-db02-3504-9e95-73200b695c22", "vendor": {"name": "opf"}}], "isExploited": false}