{"id": "EUVD-2024-25310", "enisaUuid": "51edb087-f36e-39f1-8bdd-e82c9f695b3f", "description": "FreeScout is an open source help desk and shared inbox built with PHP.\n\nA vulnerability has been identified in the Free Scout Application, which exposes SMTP server credentials used by an organization in the application to users of the application. This issue arises from the application storing complete stack traces of exceptions in its database. The sensitive information is then inadvertently disclosed to users via the `/conversation/ajax-html/send_log?folder_id=&thread_id={id}` endpoint. The stack trace reveals value of parameters, including the username and password, passed to the `Swift_Transport_Esmtp_Auth_LoginAuthenticator->authenticate()` function. Exploiting this vulnerability allows an attacker to gain unauthorized access to SMTP server credentials. With this sensitive information in hand, the attacker can potentially send unauthorized emails from the compromised SMTP server, posing a severe threat to the confidentiality and integrity of email communications. This could lead to targeted attacks on both the application users and the organization itself, compromising the security of email exchange servers. This issue has been addressed in version 1.8.124. Users are advised to upgrade. Users unable to upgrade should adopt the following measures: 1. Avoid Storing Complete Stack Traces, 2. Implement redaction mechanisms to filter and exclude sensitive information, and 3. Review and enhance the application's logging practices.", "datePublished": "2024-03-12T19:36:05", "dateUpdated": "2024-08-02T00:48:49", "baseScore": 7.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:L/A:N", "references": ["https://github.com/freescout-helpdesk/freescout/security/advisories/GHSA-7wcq-2qmv-mvcm", "https://github.com/freescout-helpdesk/freescout/commit/33639a89554998dcac645613130a27ac7872605e"], "aliases": ["CVE-2024-28186"], "assigner": "GitHub_M", "epss": 0.22, "enisaIdProduct": [{"id": "29ec2825-3464-3338-b19c-7bf1fca43137", "product": {"name": "freescout"}, "product_version": "< 1.8.124"}, {"id": "ad1a5335-d1dd-3a99-8c4e-bfa9892f6778", "product": {"name": "freescout"}}], "enisaIdVendor": [{"id": "0535d443-f7f0-3547-a591-275eba8299ce", "vendor": {"name": "freescout-helpdesk"}}], "isExploited": false}