{"id": "EUVD-2024-3523", "enisaUuid": "e85b1266-9b01-3e96-9ec6-4c4054d4f35d", "description": "Winter is a free, open-source content management system (CMS) based on the Laravel PHP framework. Winter CMS prior to versions 1.2.7, 1.1.11, and 1.0.476 allow users with access to the CMS templates sections that modify Twig files to bypass the sandbox placed on Twig files and modify resources such as theme customisation values or modify, or remove, templates in the theme even if not provided direct access via the permissions. As all objects passed through to Twig are references to the live objects, it is also possible to also manipulate model data if models are passed directly to Twig, including changing attributes or even removing records entirely. In most cases, this is unwanted behavior and potentially dangerous. To actively exploit this security issue, an attacker would need access to the Backend with a user account with any of the following permissions: `cms.manage_layouts`; `cms.manage_pages`; or `cms.manage_partials`. The Winter CMS maintainers strongly recommend that these permissions only be reserved to trusted administrators and developers in general. The maintainers of Winter CMS have significantly increased the scope of the sandbox, effectively making all models and datasources read-only in Twig, in versions 1.2.7, 1.1.11, and 1.0.476. Thse who cannot upgrade may apply commit fb88e6fabde3b3278ce1844e581c87dcf7daee22 to their Winter CMS installation manually to resolve the issue. In the rare event that a Winter user was relying on being able to write to models/datasources within their Twig templates, they should instead use or create components to make changes to their models.", "datePublished": "2024-12-09T20:54:41", "dateUpdated": "2024-12-10T17:13:11", "baseScore": 8.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:R/S:C/C:H/I:H/A:H", "references": ["https://github.com/wintercms/winter/security/advisories/GHSA-xhw3-4j3m-hq53", "https://nvd.nist.gov/vuln/detail/CVE-2024-54149", "https://github.com/wintercms/winter/commit/fb88e6fabde3b3278ce1844e581c87dcf7daee22", "https://github.com/wintercms/winter"], "aliases": ["CVE-2024-54149", "GHSA-xhw3-4j3m-hq53"], "assigner": "GitHub_M", "epss": 0.18, "enisaIdProduct": [{"id": "40216173-16c6-3ebb-ac44-39d84a782278", "product": {"name": "winter"}, "product_version": "< 1.0.476"}, {"id": "5bb86393-cead-3a26-b32f-f0ec752168cf", "product": {"name": "winter"}, "product_version": "1.2.0, < 1.2.7"}, {"id": "d4ded824-53da-3283-b91d-df5a678c9962", "product": {"name": "winter"}, "product_version": "1.1.0, < 1.1.11"}], "enisaIdVendor": [{"id": "772a5de9-dcdf-3f1c-8d28-93f544cd5d80", "vendor": {"name": "wintercms"}}], "isExploited": false}