{"id": "EUVD-2024-40407", "enisaUuid": "b5d6cc51-c0de-31c9-a6f0-38d4795ed7a1", "description": "There are many buffer overflow vulnerabilities present in several CGI binaries of the charging station.This issue affects Iocharger firmware for AC model chargers beforeversion 24120701.\n\nLikelihood: High – Given the prevalence of these buffer overflows, and the clear error message of the web server, an attacker is very likely to be able to find these vulnerabilities.\n\nImpact: Low – Usually, overflowing one of these buffers just causes a segmentation fault of the CGI binary, which causes the web server to return a 502 Bad Gateway error. However the webserver itself is not affected, and no DoS can be achieved. Abusing these buffer overflows in a meaningful way requires highly technical knowledge, especially since ASLR also seems to be enabled on the charging station. However, a skilled attacker might be able to use one of these buffer overflows to obtain remote code execution.\n\nCVSS clarification. The attack can be executed over any network connection the station is listening to and serves the web interface (AV:N), and there are no additional security measure sin place that need to be circumvented (AC:L), the attack does not rely on preconditions (AT:N). The attack does require authentication, but the level of authentication is irrelevant (PR:L), it does not require user interaction (UI:N). The attack has a small impact on the availability of the device (VC:N/VI:N/VA:L).  There is no impact on subsequent systems. (SC:N/SI:N/SA:N). While this device is an EV charger handing significant amounts of power, we do not expect  this vulnerability to have a safety impact. The attack can be automated (AU:Y).", "datePublished": "2025-01-09T07:56:45", "dateUpdated": "2025-01-09T14:47:32", "baseScore": 5.3, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:N/VI:N/VA:L/SC:N/SI:N/SA:N/AU:Y/R:A", "references": ["https://csirt.divd.nl/DIVD-2024-00035/", "https://csirt.divd.nl/CVE-2024-43663/", "https://iocharger.com"], "aliases": ["CVE-2024-43663"], "assigner": "DIVD", "epss": 1.42, "enisaIdProduct": [{"id": "e1286352-6e08-3fd1-8eb8-931639d54d2a", "product": {"name": "Iocharger firmware for AC models"}, "product_version": "0 <24120701"}], "enisaIdVendor": [{"id": "d6d78a1d-2bdd-3a8a-a4b5-f6f475e01e56", "vendor": {"name": "Iocharger"}}], "isExploited": false}