{"id": "EUVD-2024-34994", "enisaUuid": "add1583c-091e-36c7-941a-c329b8586655", "description": "FreeScout is a free, self-hosted help desk and shared mailbox. Versions of FreeScout prior to 1.8.139 contain a Prototype Pollution vulnerability in the `/public/js/main.js` source file. The Prototype Pollution arises because the `getQueryParam` Function recursively merges an object containing user-controllable properties into an existing object (For URL Query Parameters Parsing), without first sanitizing the keys. This can allow an attacker to inject a property with a key `__proto__`, along with arbitrarily nested properties. The merge operation assigns the nested properties to the `params` object's prototype instead of the target object itself. As a result, the attacker can pollute the prototype with properties containing harmful values, which are then inherited by user-defined objects and subsequently used by the application dangerously. The vulnerability lets an attacker control properties of objects that would otherwise be inaccessible. If the application subsequently handles an attacker-controlled property in an unsafe way, this can potentially be chained with other vulnerabilities like DOM-based XSS, Open Redirection, Cookie Manipulation, Link Manipulation, HTML Injection, etc. Version 1.8.139 contains a patch for the issue.", "datePublished": "2024-05-13T15:50:34", "dateUpdated": "2024-08-02T02:59:21", "baseScore": 4.6, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:R/S:U/C:L/I:L/A:L", "references": ["https://github.com/freescout-helpdesk/freescout/security/advisories/GHSA-rx6j-4c33-9h3r", "https://github.com/freescout-helpdesk/freescout/commit/2614514bc6d6c4ad563202a1c9cae5a97b195cc5"], "aliases": ["CVE-2024-34698"], "assigner": "GitHub_M", "epss": 0.79, "enisaIdProduct": [{"id": "dd79c69a-3a72-350c-996a-eba73a8fd806", "product": {"name": "freescout"}, "product_version": "< 1.8.139"}], "enisaIdVendor": [{"id": "f0f9b6a1-bcd1-3b0a-8f41-6558c3578408", "vendor": {"name": "freescout-helpdesk"}}], "isExploited": false}