{"id": "EUVD-2024-45833", "enisaUuid": "7ccf26eb-8c84-364f-940b-c262614dc3be", "description": "Stirling-PDF is a locally hosted web application that allows you to perform various operations on PDF files. In affected versions the Merge functionality takes untrusted user input (file name) and uses it directly in the creation of HTML pages allowing any unauthenticated to execute JavaScript code in the context of the user. The issue stems to the code starting at `Line 24` in `src/main/resources/static/js/merge.js`. The file name is directly being input into InnerHTML with no sanitization on the file name, allowing a malicious user to be able to upload files with names containing HTML tags. As HTML tags can include JavaScript code, this can be used to execute JavaScript code in the context of the user. This is a self-injection style attack and relies on a user uploading the malicious file themselves and it impact only them, not other users. A user might be social engineered into running this to launch a phishing attack. Nevertheless, this breaks the expected security restrictions in place by the application. This issue has been addressed in version 0.32.0 and all users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2024-11-11T19:14:47", "dateUpdated": "2025-01-09T14:29:29", "baseScore": 2.0, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:P/PR:L/UI:A/VC:L/VI:L/VA:N/SC:N/SI:N/SA:N", "references": ["https://github.com/Stirling-Tools/Stirling-PDF/security/advisories/GHSA-9j55-gvf2-cqwv", "https://github.com/Stirling-Tools/Stirling-PDF/commit/404e31468ec98413f1906cc7ee3d49091638c693"], "aliases": ["CVE-2024-52286"], "assigner": "GitHub_M", "epss": 0.17, "enisaIdProduct": [{"id": "4ceb603f-e1ed-313c-ba88-b5985545f8e9", "product": {"name": "Stirling-PDF"}, "product_version": "< 0.32.0"}], "enisaIdVendor": [{"id": "d66cd2e1-f9dd-37ab-add9-8420a7540e96", "vendor": {"name": "Stirling-Tools"}}], "isExploited": false}