{"id": "EUVD-2024-40403", "enisaUuid": "5900acc4-e7b4-37e5-98a9-239d5cd89f21", "description": "After gaining access to the firmware of a charging station, a file at <redacted> can be accessed to obtain default credentials that are the same across all Iocharger AC model EV chargers.\n\nThis issue affects Iocharger firmware for AC models before firmware version 25010801. \n\nThe issue is addressed by requiring a mandatory password change on first login, it is still recommended to change the password on older models.\n\nLikelihood: Moderate – The attacker will first have to abuse a code execution or file inclusion vulnerability (for example by using <redacted>.sh) to gain access to the <redacted>.json file, or obtain a firmware dump of the charging station or obtain the firmware via other channels.\n\nImpact: Critical – All chargers using Iocharger firmware for AC models started with the same initial password. For models with firmware version before 25010801 a password change was not mandatory. It is therefore very likely that this firmware password is still active on many chargers. These credentials could, once obtained, allow an attacker to log into many Iocharger charging station, and allow them to execute arbitrary commands via the System → Custom page.\n\nCVSS clarification: Any network interface serving the web ui is vulnerable (AV:N) and there are not additional security measures to circumvent (AC:L), nor does the attack require and existing preconditions (AT:N). The attack is authenticated, and requires high privileges (PR:H), there is no user interaction required (UI:N). The attack leads to a compromised of the confidentialy of the \"super user\" credentials of the device (VC:H/VI:N/VA:N), and can subsequently be used to full compromise and other devices (SC:H/SI:H/SA:H). Becuase this is an EV charger handing significant power, there is a potential safety impact (S:P). This attack can be automated (AU:Y).", "datePublished": "2025-01-09T07:56:45", "dateUpdated": "2025-01-09T14:48:39", "baseScore": 8.3, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:L/AC:L/AT:N/PR:H/UI:N/VC:H/VI:N/VA:N/SC:H/SI:H/SA:H/S:P/AU:N", "references": ["https://csirt.divd.nl/DIVD-2024-00035/", "https://csirt.divd.nl/CVE-2024-43659/", "https://iocharger.com"], "aliases": ["CVE-2024-43659"], "assigner": "DIVD", "epss": 0.1, "enisaIdProduct": [{"id": "9f116871-a042-3f4c-ae2a-1f2ced844467", "product": {"name": "Iocharger firmware for AC models"}, "product_version": "0 <25010801"}], "enisaIdVendor": [{"id": "d3d4334b-0d16-3c0c-8d9b-b9ee24a0c504", "vendor": {"name": "Iocharger"}}], "isExploited": false}