{"id": "EUVD-2024-41531", "enisaUuid": "6a01c4a9-4fc6-391e-9d68-f9315ba0cf84", "description": "Cursor is an artificial intelligence code editor. Prior to version 0.41.0, if a user on macOS has granted Cursor access to the camera or microphone, any program that is run on the machine is able to access the camera or the microphone without explicitly being granted access, through a DyLib Injection using DYLD_INSERT_LIBRARIES environment variable. The usage of `com.apple.security.cs.allow-dyld-environment-variables` and `com.apple.security.cs.disable-library-validation` allows an external dynamic library to be injected into the application using DYLD_INSERT_LIBRARIES environment variable. \nMoreover, the entitlement `com.apple.security.device.camera` allows the application to use the host camera and `com.apple.security.device.audio-input` allows the application to use the microphone. This means that untrusted code that is executed on the user's machine can access the camera or the microphone, if the user has already given permission for Cursor to do so. In version 0.41.0, the entitlements have been split by process: the main process gets the camera and microphone entitlements, but not the DyLib entitlements, whereas the extension host process gets the DyLib entitlements but not the camera or microphone entitlements. As a workaround, do not explicitly give Cursor the permission to access the camera or microphone if untrusted users can run arbitrary commands on the affected machine.", "datePublished": "2024-09-24T18:02:18", "dateUpdated": "2024-09-24T18:35:10", "baseScore": 3.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:L/I:N/A:N", "references": ["https://github.com/getcursor/cursor/security/advisories/GHSA-x352-xv29-r74m"], "aliases": ["CVE-2024-45599"], "assigner": "GitHub_M", "epss": 0.03, "enisaIdProduct": [{"id": "82f3ea42-75e3-39ad-b74e-ebe16c6fea7d", "product": {"name": "cursor"}, "product_version": "< 0.41.0"}], "enisaIdVendor": [{"id": "1253ea03-fb1e-3b7e-a704-c8d5930819ad", "vendor": {"name": "getcursor"}}], "isExploited": false}