{"id": "EUVD-2024-0886", "enisaUuid": "b456519a-3bc3-3c7c-9757-4c378a314dea", "description": "ESPHome is a system to control your ESP8266/ESP32 for Home Automation systems. Starting in version 2023.12.9 and prior to version 2024.2.2, editing the configuration file API in dashboard component of ESPHome version 2023.12.9 (command line installation and Home Assistant add-on) serves unsanitized data with `Content-Type: text/html; charset=UTF-8`, allowing a remote authenticated user to inject arbitrary web script and exfiltrate session cookies via Cross-Site scripting. It is possible for a malicious authenticated user to inject arbitrary Javascript in configuration files using a POST request to the /edit endpoint, the configuration parameter allows to specify the file to write. To trigger the XSS vulnerability, the victim must visit the page` /edit?configuration=[xss file]`. Abusing this vulnerability a malicious actor could perform operations on the dashboard on the behalf of a logged user, access sensitive information, create, edit and delete configuration files and flash firmware on managed boards.\nIn addition to this, cookies are not correctly secured, allowing the exfiltration of session cookie values. Version 2024.2.2 contains a patch for this issue.\n", "datePublished": "2024-03-06T18:19:48", "dateUpdated": "2024-08-26T14:04:49", "baseScore": 6.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:N", "references": ["https://github.com/esphome/esphome/security/advisories/GHSA-9p43-hj5j-96h5", "https://github.com/esphome/esphome/commit/37d2b3c7977a4ccbec59726ca7549cb776661455", "https://github.com/esphome/esphome"], "aliases": ["CVE-2024-27287", "GHSA-9p43-hj5j-96h5"], "assigner": "GitHub_M", "epss": 0.15, "enisaIdProduct": [{"id": "8b9ca07b-59f2-39dd-8841-06ff504d5f0c", "product": {"name": "esphome"}, "product_version": "2023.12.9, < 2024.2.2"}, {"id": "c7397a76-f0c2-3006-bc44-6f6a783efe5a", "product": {"name": "esphome"}}], "enisaIdVendor": [{"id": "c7397a76-f0c2-3006-bc44-6f6a783efe5a", "vendor": {"name": "esphome"}}], "isExploited": false}