{"id": "EUVD-2024-40404", "enisaUuid": "d2e8c4da-e4c0-36c3-a450-81791ae10f7f", "description": "The CGI script <redacted>.sh can be used to download any file on the filesystem.\n\nThis issue affects Iocharger firmware for AC model chargers beforeversion 24120701.\n\nLikelihood: High, but credentials required.\n\nImpact: Critical – The script can be used to download any file on the filesystem, including sensitive files such as /etc/shadow, the CGI script source code or binaries and configuration files.\n\nCVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N/S:P/AU:Y\nCVSS clarification. The attack can be executed over any network connection the station is listening to and serves the web interface (AV:N), and there are no additional security measure sin place that need to be circumvented (AC:L), the attack does not rely on preconditions (AT:N). The attack does require authentication, but the level of authentication is irrelevant (PR:L), it does not require user interaction (UI:N). The confidentiality of all files of the devicd can be compromised (VC:H/VI:N/VA:N).  There is no impact on subsequent systems. (SC:N/SI:N/SA:N). While this device is an EV charger handing significant amounts of power, this attack in isolation does not have a safety impact. The attack can be automated (AU:Y).", "datePublished": "2025-01-09T07:56:46", "dateUpdated": "2025-01-09T14:38:13", "baseScore": 7.1, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N/AU:Y", "references": ["https://csirt.divd.nl/DIVD-2024-00035/", "https://csirt.divd.nl/CVE-2024-43660/", "https://iocharger.com"], "aliases": ["CVE-2024-43660"], "assigner": "DIVD", "epss": 0.18, "enisaIdProduct": [{"id": "3758bdc1-4648-35e6-bdea-5a1aee18c3a8", "product": {"name": "Iocharger firmware for AC models"}, "product_version": "0 <24120701"}], "enisaIdVendor": [{"id": "52f7d315-b9e7-301b-b648-a9390c83c4e5", "vendor": {"name": "Iocharger"}}], "isExploited": false}