{"id": "EUVD-2024-2381", "enisaUuid": "79eba51c-263d-3c1e-8241-c321389da99c", "description": "gitoxide An idiomatic, lean, fast & safe pure Rust implementation of Git. `gix-path` can be tricked into running another `git.exe` placed in an untrusted location by a limited user account on Windows systems. Windows permits limited user accounts without administrative privileges to create new directories in the root of the system drive. While `gix-path` first looks for `git` using a `PATH` search, in version 0.10.8 it also has a fallback strategy on Windows of checking two hard-coded paths intended to be the 64-bit and 32-bit Program Files directories. Existing functions, as well as the newly introduced `exe_invocation` function, were updated to make use of these alternative locations. This causes facilities in `gix_path::env` to directly execute `git.exe` in those locations, as well as to return its path or whatever configuration it reports to callers who rely on it. Although unusual setups where the system drive is not `C:`, or even where Program Files directories have non-default names, are technically possible, the main problem arises on a 32-bit Windows system. Such a system has no `C:\\Program Files (x86)` directory. A limited user on a 32-bit Windows system can therefore create the `C:\\Program Files (x86)` directory and populate it with arbitrary contents. Once a payload has been placed at the second of the two hard-coded paths in this way, other user accounts including administrators will execute it if they run an application that uses `gix-path` and do not have `git` in a `PATH` directory. (While having `git` found in a `PATH` search prevents exploitation, merely having it installed in the default location under the real `C:\\Program Files` directory does not. This is because the first hard-coded path's `mingw64` component assumes a 64-bit installation.). Only Windows is affected. Exploitation is unlikely except on a 32-bit system. In particular, running a 32-bit build on a 64-bit system is not a risk factor. Furthermore, the attacker must have a user account on the system, though it may be a relatively unprivileged account. Such a user can perform privilege escalation and execute code as another user, though it may be difficult to do so reliably because the targeted user account must run an application or service that uses `gix-path` and must not have `git` in its `PATH`. The main exploitable configuration is one where Git for Windows has been installed but not added to `PATH`. This is one of the options in its installer, though not the default option. Alternatively, an affected program that sanitizes its `PATH` to remove seemingly nonessential directories could allow exploitation. But for the most part, if the target user has configured a `PATH` in which the real `git.exe` can be found, then this cannot be exploited. This issue has been addressed in release version 0.10.9 and all users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2024-07-18T16:56:35", "dateUpdated": "2024-08-02T04:33:11", "baseScore": 6.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:L", "references": ["https://github.com/Byron/gitoxide/security/advisories/GHSA-mgvv-9p9g-3jv4", "https://github.com/git-for-windows/git/security/advisories/GHSA-vw2c-22j4-2fh2", "https://github.com/Byron/gitoxide", "https://github.com/Byron/gitoxide/blob/6cd8b4665bb7582f744c3244abaef812be39ec35/gix-path/src/env/git.rs#L9-L14", "https://github.com/Byron/gitoxide/commit/15235bf7968042da0493d431bbc955d6f9f54188"], "aliases": ["CVE-2024-40644", "GHSA-mgvv-9p9g-3jv4"], "assigner": "GitHub_M", "epss": 0.03, "enisaIdProduct": [{"id": "62d045e4-9b60-332d-abe9-0440905b9910", "product": {"name": "gitoxide"}, "product_version": "< 0.10.9"}], "enisaIdVendor": [{"id": "c34b87c2-8ab8-3225-995b-552da36bb828", "vendor": {"name": "Byron"}}], "isExploited": false}