{"id": "EUVD-2024-1066", "enisaUuid": "2b9ff2a0-8380-3d4f-a50c-31afcbc6bbcd", "description": "PsiTransfer is an open source, self-hosted file sharing solution. Prior to version 2.2.0, the absence of restrictions on the endpoint, which is designed for uploading files, allows an attacker who received the id of a file distribution to change the files that are in this distribution. The vulnerability allows an attacker to influence those users who come to the file distribution after them and slip the victim files with a malicious or phishing signature. Version 2.2.0 contains a patch for this issue.\n\nCVE-2024-31454 allows users to violate the integrity of a file that is uploaded by another user. In this case, additional files are not loaded into the file bucket. Violation of integrity at the level of individual files. While the vulnerability with the number CVE-2024-31453 allows users to violate the integrity of a file bucket without violating the integrity of files uploaded by other users. Thus, vulnerabilities are reproduced differently, require different security recommendations and affect different objects of the application’s business logic.", "datePublished": "2024-04-09T17:19:24", "dateUpdated": "2024-09-04T14:25:47", "baseScore": 6.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N", "references": ["https://github.com/psi-4ward/psitransfer/security/advisories/GHSA-2p2x-p7wj-j5h2", "https://nvd.nist.gov/vuln/detail/CVE-2024-31454", "https://github.com/psi-4ward/psitransfer/commit/0014d81141e0f1664ccb6841970ef1ea0237cca3", "https://github.com/psi-4ward/psitransfer"], "aliases": ["CVE-2024-31454", "GHSA-2p2x-p7wj-j5h2"], "assigner": "GitHub_M", "epss": 0.11, "enisaIdProduct": [{"id": "9212a8c4-1094-307a-ad2b-1af0c5f0451e", "product": {"name": "psitransfer"}, "product_version": "< 2.2.0"}, {"id": "960f4b9d-c3ff-3fc3-a8ae-8f74373dc36e", "product": {"name": "psitransfer"}}], "enisaIdVendor": [{"id": "3a709c20-d372-309d-abc5-f20eb0151177", "vendor": {"name": "psi-4ward"}}], "isExploited": false}