{"id": "EUVD-2024-0464", "enisaUuid": "51e1db67-a024-3605-b8e1-a0959aafecbd", "description": "pkg is tool design to bundle Node.js projects into an executables. Any native code packages built by `pkg` are written to a hardcoded directory. On unix systems, this is `/tmp/pkg/*` which is a shared directory for all users on the same local system. There is no uniqueness to the package names within this directory, they are predictable. An attacker who has access to the same local system has the ability to replace the genuine executables in the shared directory with malicious executables of the same name. A user may then run the malicious executable without realising it has been modified. This package is deprecated. Therefore, there will not be a patch provided for this vulnerability. To check if your executable build by pkg depends on native code and is vulnerable, run the executable and check if `/tmp/pkg/` was created. Users should transition to actively maintained alternatives. We would recommend investigating Node.js 21’s support for single executable applications. Given the decision to deprecate the pkg package, there are no official workarounds or remediations provided by our team. Users should prioritize migrating to other packages that offer similar functionality with enhanced security.", "datePublished": "2024-02-09T22:21:04", "dateUpdated": "2024-08-22T13:25:19", "baseScore": 6.6, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:N", "references": ["https://github.com/vercel/pkg/security/advisories/GHSA-22r3-9w55-cj54", "https://nvd.nist.gov/vuln/detail/CVE-2024-24828", "https://github.com/vercel/pkg", "https://nodejs.org/api/single-executable-applications.html"], "aliases": ["CVE-2024-24828", "GHSA-22r3-9w55-cj54"], "assigner": "GitHub_M", "epss": 0.11, "enisaIdProduct": [{"id": "b1717613-d98d-31e7-bcfc-11846e1b602a", "product": {"name": "pkg"}, "product_version": "≤ 5.8.1"}, {"id": "ba907187-46dc-3fe1-936e-65924e344dc0", "product": {"name": "pkg"}}], "enisaIdVendor": [{"id": "30046ef5-03ee-3041-92bb-de7824f67e67", "vendor": {"name": "vercel"}}], "isExploited": false}