{"id": "EUVD-2024-2552", "enisaUuid": "948b70be-a895-35eb-a294-cf8f26a16071", "description": "Reposilite is an open source, lightweight and easy-to-use repository manager for Maven based artifacts in JVM ecosystem. As a Maven repository manager, Reposilite provides the ability to view the artifacts content in the browser, as well as perform administrative tasks via API. The problem lies in the fact that the artifact's content is served via the same origin (protocol/host/port) as the Admin UI. If the artifact contains HTML content with javascript inside, the javascript is executed within the same origin. Therefore, if an authenticated user is viewing the artifacts content, the javascript inside can access the browser's local storage where the user's password (aka 'token-secret') is stored. It is especially dangerous in scenarios where Reposilite is configured to mirror third party repositories, like the Maven Central Repository. Since anyone can publish an artifact to Maven Central under its own name, such malicious packages can be used to attack the Reposilite instance. This issue may lead to the full Reposilite instance compromise. If this attack is performed against the admin user, it's possible to use the admin API to modify settings and artifacts on the instance. In the worst case scenario, an attacker would be able to obtain the Remote code execution on all systems that use artifacts from Reposilite. It's important to note that the attacker does not need to lure a victim user to use a malicious artifact, but just open a link in the browser. This link can be silently loaded among the other HTML content, making this attack unnoticeable. Even if the Reposilite instance is located in an isolated environment, such as behind a VPN or in the local network, this attack is still possible as it can be performed from the admin browser. Reposilite has addressed this issue in version 3.5.12. Users are advised to upgrade. There are no known workarounds for this vulnerability. This issue was discovered and reported by the GitHub Security lab and is also tracked as GHSL-2024-072.", "datePublished": "2024-06-19T17:37:20", "dateUpdated": "2024-08-02T03:30:13", "baseScore": 7.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:R/S:U/C:H/I:H/A:H", "references": ["https://github.com/dzikoysk/reposilite/security/advisories/GHSA-9w8w-34vr-65j2", "https://nvd.nist.gov/vuln/detail/CVE-2024-36115", "https://github.com/dzikoysk/reposilite/commit/279a472015ec675c1da449d902dc82e4dd578484", "https://github.com/dzikoysk/reposilite/commit/d11609f427aba255e0f6f54b1105d5d20ab043cf", "https://github.com/dzikoysk/reposilite", "https://github.com/dzikoysk/reposilite/releases/tag/3.5.12"], "aliases": ["CVE-2024-36115", "GHSA-9w8w-34vr-65j2"], "assigner": "GitHub_M", "epss": 3.07, "enisaIdProduct": [{"id": "53d89514-e162-3a14-b8f5-77112c15a2f1", "product": {"name": "reposilite"}, "product_version": "3.3.0, < 3.5.12"}], "enisaIdVendor": [{"id": "28fddc3e-a9ff-3360-93a8-ce1cc958dc23", "vendor": {"name": "dzikoysk"}}], "isExploited": false}