{"id": "EUVD-2024-40393", "enisaUuid": "c6f88836-cb2a-36b8-9a0a-e350a27deaaf", "description": "Authenticated command injection in the filename of a <redacted>.exe request leads to remote code execution as the root user.\n\nThis issue affects Iocharger firmware for AC models before version 24120701.\n\nLikelihood: Moderate – This action is not a common place for command injection vulnerabilities to occur. Thus, an attacker will likely only be able to find this vulnerability by reverse-engineering the firmware or trying it on all <redacted> fields. The attacker will also need a (low privilege) account to gain access to the <redacted> binary, or convince a user with such access to execute a payload.\n\nImpact: Critical – The attacker has full control over the charging station as the root user, and can arbitrarily add, modify and delete files and services.\n\nCVSS clarification: This attack can be performed over any network conenction serving the web interfacr (AV:N), and there are not additional mitigating measures that need to be circumvented (AC:L) or other prerequisites (AT:N). The attack does require privileges, but the level does not matter (PR:L), there is no user interaction required (UI:N). The attack leeds to a full compromised of the charger (VC:H/VI:H/VA:H) and a compromised charger can be used to \"pivot\" to networks that should normally not be reachable (SC:L/SI:L/SA:H). Because this is an EV chargers with significant pwoer, there is a potential safety imp0act (S:P). THis attack can be automated (AU:Y).", "datePublished": "2025-01-09T07:56:46", "dateUpdated": "2025-01-09T14:36:23", "baseScore": 9.3, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:H/SC:L/SI:L/SA:H/S:P/AU:Y", "references": ["https://csirt.divd.nl/DIVD-2024-00035/", "https://csirt.divd.nl/CVE-2024-43649/", "https://iocharger.com"], "aliases": ["CVE-2024-43649"], "assigner": "DIVD", "epss": 1.08, "enisaIdProduct": [{"id": "e8af4d56-0988-355c-af0b-4fe3597fa72a", "product": {"name": "Iocharger firmware for AC models"}, "product_version": "0 <24120701"}], "enisaIdVendor": [{"id": "4591cec0-5dac-3938-a86d-feac2867ee30", "vendor": {"name": "Iocharger"}}], "isExploited": false}