{"id": "EUVD-2024-2747", "enisaUuid": "ec548847-ea47-3cd6-a2ca-48a867bcaf26", "description": "Nuclei is a vulnerability scanner powered by YAML based templates. Starting in version 3.0.0 and prior to version 3.3.2, a vulnerability in Nuclei's template signature verification system could allow an attacker to bypass the signature check and possibly execute malicious code via custom code template. The vulnerability is present in the template signature verification process, specifically in the `signer` package. The vulnerability stems from a discrepancy between how the signature verification process and the YAML parser handle newline characters, combined with the way multiple signatures are processed. This allows an attacker to inject malicious content into a template while maintaining a valid signature for the benign part of the template. CLI users are affected if they execute custom code templates from unverified sources. This includes templates authored by third parties or obtained from unverified repositories. SDK Users are affected if they are developers integrating Nuclei into their platforms, particularly if they permit the execution of custom code templates by end-users. The vulnerability is addressed in Nuclei v3.3.2. Users are strongly recommended to update to this version to mitigate the security risk. As an interim measure, users should refrain from using custom templates if unable to upgrade immediately. Only trusted, verified templates should be executed. Those who are unable to upgrade Nuclei should disable running custom code templates as a workaround.", "datePublished": "2024-09-04T15:36:23", "dateUpdated": "2024-09-04T16:21:54", "baseScore": 7.4, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:H/PR:N/UI:R/S:C/C:H/I:H/A:N", "references": ["https://github.com/projectdiscovery/nuclei/security/advisories/GHSA-7h5p-mmpp-hgmm", "https://nvd.nist.gov/vuln/detail/CVE-2024-43405", "https://github.com/projectdiscovery/nuclei/commit/0da993afe6d41b4b1b814e8fad23a2acba13c60a", "https://github.com/projectdiscovery/nuclei", "https://pkg.go.dev/vuln/GO-2024-3114"], "aliases": ["CVE-2024-43405", "GHSA-7h5p-mmpp-hgmm"], "assigner": "GitHub_M", "epss": 3.4, "enisaIdProduct": [{"id": "e74dda1f-bf48-350d-9d86-e7fbf978bb6c", "product": {"name": "nuclei"}, "product_version": "3.0.0, < 3.3.2"}], "enisaIdVendor": [{"id": "afb24f78-9df4-300b-a566-accd027cd3f1", "vendor": {"name": "projectdiscovery"}}], "isExploited": false}