{"id": "EUVD-2024-1522", "enisaUuid": "afaac526-6a05-3d2d-9d32-76e54cc26b5e", "description": "Minder by Stacklok is an open source software supply chain security platform. Minder prior to version 0.0.51 is vulnerable to a denial-of-service (DoS) attack which could allow an attacker to crash the Minder server and deny other users access to it. The root cause of the vulnerability is that Minders sigstore verifier reads an untrusted response entirely into memory without enforcing a limit on the response body. An attacker can exploit this by making Minder make a request to an attacker-controlled endpoint which returns a response with a large body which will crash the Minder server. Specifically, the point of failure is where Minder parses the response from the GitHub attestations endpoint in `getAttestationReply`. Here, Minder makes a request to the `orgs/$owner/attestations/$checksumref` GitHub endpoint (line 285) and then parses the response into the `AttestationReply` (line 295). The way Minder parses the response on line 295 makes it prone to DoS if the response is large enough. Essentially, the response needs to be larger than the machine has available memory.  Version 0.0.51 contains a patch for this issue.\n\nThe content that is hosted at the `orgs/$owner/attestations/$checksumref` GitHub attestation endpoint is controlled by users including unauthenticated users to Minders threat model. However, a user will need to configure their own Minder settings to cause Minder to make Minder send a request to fetch the attestations. The user would need to know of a package whose attestations were configured in such a way that they would return a large response when fetching them. As such, the steps needed to carry out this attack would look as such:\n\n1. The attacker adds a package to ghcr.io with attestations that can be fetched via the `orgs/$owner/attestations/$checksumref` GitHub endpoint.\n2. The attacker registers on Minder and makes Minder fetch the attestations.\n3. Minder fetches attestations and crashes thereby being denied of service.", "datePublished": "2024-05-27T17:12:20", "dateUpdated": "2024-09-03T15:27:31", "baseScore": 5.3, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:N/I:N/A:H", "references": ["https://github.com/stacklok/minder/security/advisories/GHSA-8fmj-33gw-g7pw", "https://nvd.nist.gov/vuln/detail/CVE-2024-35238", "https://github.com/stacklok/minder/commit/fe321d345b4f738de6a06b13207addc72b59f892", "https://github.com/stacklok/minder", "https://github.com/stacklok/minder/blob/daccbc12e364e2d407d56b87a13f7bb24cbdb074/internal/verifier/sigstore/container/container.go#L271-L300"], "aliases": ["CVE-2024-35238", "GHSA-8fmj-33gw-g7pw"], "assigner": "GitHub_M", "epss": 0.36, "enisaIdProduct": [{"id": "5f34c5c1-f0f7-37e4-900c-82cff42197c3", "product": {"name": "minder"}, "product_version": "< 0.0.51"}], "enisaIdVendor": [{"id": "ddeaeb25-c046-311c-a2c3-b0fc9991dc58", "vendor": {"name": "stacklok"}}], "isExploited": false}