{"id": "EUVD-2024-3554", "enisaUuid": "47945147-18f5-3fc9-a007-36bb7d723492", "description": "Password Pusher is an open source application to communicate sensitive information over the web. A vulnerability has been reported in versions 1.50.3 and prior where an attacker can copy the session cookie before a user logs out, potentially allowing session hijacking. Although the session token is replaced and invalidated upon logout, if an attacker manages to capture the session cookie before this process, they can use the token to gain unauthorized access to the user's session until the token expires or is manually cleared. This vulnerability hinges on the attacker's ability to access the session cookie during an active session, either through a man-in-the-middle attack, by exploiting another vulnerability like XSS, or via direct access to the victim's device. Although there is no direct resolution to this vulnerability, it is recommended to always use the latest version of Password Pusher to best mitigate risk. If self-hosting, ensure Password Pusher is hosted exclusively over SSL connections to encrypt traffic and prevent session cookies from being intercepted in transit. Additionally, implement best practices in local security to safeguard user systems, browsers, and data against unauthorized access.", "datePublished": "2024-12-30T16:46:37", "dateUpdated": "2024-12-30T17:33:25", "baseScore": 5.7, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:N", "references": ["https://github.com/pglombardo/PasswordPusher/security/advisories/GHSA-4fwj-m62q-pp47", "https://nvd.nist.gov/vuln/detail/CVE-2024-56733", "https://github.com/pglombardo/PasswordPusher", "https://github.com/rubysec/ruby-advisory-db/blob/master/gems/pwpush/CVE-2024-56733.yml"], "aliases": ["CVE-2024-56733", "GHSA-4fwj-m62q-pp47"], "assigner": "GitHub_M", "epss": 0.03, "enisaIdProduct": [{"id": "8844ed29-f7d6-36d9-9ae9-6b2750ff4aa5", "product": {"name": "PasswordPusher"}, "product_version": "≤ 1.50.3"}], "enisaIdVendor": [{"id": "8508711f-d15d-3238-a428-c7afa54025e2", "vendor": {"name": "pglombardo"}}], "isExploited": false}