{"id": "EUVD-2020-24713", "enisaUuid": "7c035a2f-5c64-3d71-bd51-a08636ea024b", "description": "The DuoConnect client enables users to establish SSH connections to hosts protected by a DNG instance. When a user initiates an SSH connection to a DNG-protected host for the first time using DuoConnect, the user’s browser is opened to a login screen in order to complete authentication determined by the contents of the '-relay' argument. If the ‘-relay’ is set to a URL beginning with \"http://\", then the browser will initially attempt to load the URL over an insecure HTTP connection, before being immediately redirected to HTTPS (in addition to standard redirect mechanisms, the DNG uses HTTP Strict Transport Security headers to enforce this). After successfully authenticating to a DNG, DuoConnect stores an authentication token in a local system cache, so users do not have to complete this browser-based authentication workflow for every subsequent SSH connection. These tokens are valid for a configurable period of time, which defaults to 8 hours. If a user running DuoConnect already has a valid token, then instead of opening a web browser, DuoConnect directly contacts the DNG, again using the configured '-relay' value, and sends this token, as well as the intended SSH server hostname and port numbers. If the '-relay' argument begins with \"http://\", then this request will be sent over an insecure connection, and could be exposed to an attacker who is sniffing the traffic on the same network. The DNG authentication tokens that may be exposed during SSH relay may be used to gain network-level access to the servers and ports protected by that given relay host. The DNG provides network-level access only to the protected SSH servers. It does not interact with the independent SSH authentication and encryption. An attacker cannot use a stolen token on its own to authenticate against a DNG-protected SSH server.", "datePublished": "2020-07-20T20:45:17", "dateUpdated": "2024-11-13T18:18:39", "baseScore": 4.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:A/AC:H/PR:N/UI:R/S:U/C:H/I:N/A:N", "references": ["https://duo.com/labs/psa/duo-psa-2020-003"], "aliases": ["CVE-2020-3442"], "assigner": "cisco", "epss": 0.02, "enisaIdProduct": [{"id": "628c7b14-ece4-3cfb-9f8f-47f0edd49d11", "product": {"name": "DUO Connect"}, "product_version": "unspecified <1.1.1"}], "enisaIdVendor": [{"id": "a54d3574-0d1f-3362-bbc1-081448605fbb", "vendor": {"name": "Cisco"}}], "isExploited": false}