{"id": "EUVD-2020-0242", "enisaUuid": "6decbbe2-b555-3bd4-be09-6808363b2da5", "description": "In xmpp-http-upload before version 0.4.0, when the GET method is attacked, attackers can read files which have a `.data` suffix and which are accompanied by a JSON file with the `.meta` suffix. This can lead to Information Disclosure and in some shared-hosting scenarios also to circumvention of authentication or other limitations on the outbound (GET) traffic. For example, in a scenario where a single server has multiple instances of the application running (with separate DATA_ROOT settings), an attacker who has knowledge about the directory structure is able to read files from any other instance to which the process has read access. If instances have individual authentication (for example, HTTP authentication via a reverse proxy, source IP based filtering) or other restrictions (such as quotas), attackers may circumvent those limits in such a scenario by using the Directory Traversal to retrieve data from the other instances. If the associated XMPP server (or anyone knowing the SECRET_KEY) is malicious, they can write files outside the DATA_ROOT. The files which are written are constrained to have the `.meta` and the `.data` suffixes; the `.meta` file will contain the JSON with the Content-Type of the original request and the `.data` file will contain the payload. The issue is patched in version 0.4.0.", "datePublished": "2020-10-06T19:15:00", "dateUpdated": "2020-10-23T03:09:00", "baseScore": 3.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:C/C:L/I:N/A:N", "references": ["https://github.com/horazont/xmpp-http-upload/security/advisories/GHSA-hwv5-w8gm-fq9f", "https://github.com/horazont/xmpp-http-upload/commit/82056540191e89f0cd697c81f57714c00962ed75", "https://github.com/horazont/xmpp-http-upload/pull/12", "https://pypi.org/project/xmpp-http-upload/#history", "https://nvd.nist.gov/vuln/detail/CVE-2020-15239", "https://github.com/pypa/advisory-database/tree/main/vulns/xmpp-http-upload/PYSEC-2020-158.yaml"], "aliases": ["CVE-2020-15239", "GHSA-hwv5-w8gm-fq9f", "PYSEC-2020-158"], "assigner": "GitHub_M", "epss": 0.13, "enisaIdProduct": [{"id": "2a4e7d84-4219-3c9e-b538-2e9d3bc1f2eb", "product": {"name": "xmpp-http-upload"}, "product_version": "< 0.4.0"}], "enisaIdVendor": [{"id": "dfd57fee-58a0-38a2-884e-d9e0c9bb67ab", "vendor": {"name": "horazont"}}], "isExploited": false}