{"id": "EUVD-2020-25315", "enisaUuid": "881296ef-50b6-37b6-ba56-087e2f56b841", "description": "In Conjur OSS Helm Chart before 2.0.0, a recently identified critical vulnerability resulted in the installation of the Conjur Postgres database with an open port. This allows an attacker to gain full read & write access to the Conjur Postgres database, including escalating the attacker's privileges to assume full control. A malicious actor who knows the IP address and port number of the Postgres database and has access into the Kubernetes cluster where Conjur runs can gain full read & write access to the Postgres database. This enables the attacker to write a policy that allows full access to retrieve any secret. This Helm chart is a method to install Conjur OSS into a Kubernetes environment. Hence, the systems impacted are only Conjur OSS systems that were deployed using this chart. Other deployments including Docker and the CyberArk Dynamic Access Provider (DAP) are not affected. To remediate this vulnerability, clone the latest Helm Chart and follow the upgrade instructions. If you are not able to fully remediate this vulnerability immediately, you can mitigate some of the risk by making sure Conjur OSS is deployed on an isolated Kubernetes cluster or namespace. The term \"isolated\" refers to: - No other workloads besides Conjur OSS and its backend database are running in that Kubernetes cluster/namespace. - Kubernetes and helm access to the cluster/namespace is limited to security administrators via Role-Based Access Control (RBAC).", "datePublished": "2020-06-22T15:20:16", "dateUpdated": "2024-08-04T07:52:20", "baseScore": 8.7, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:C/C:H/I:H/A:N", "references": ["https://github.com/cyberark/conjur-oss-helm-chart/security/advisories/GHSA-mg2m-623j-wpxw", "https://github.com/cyberark/conjur-oss-helm-chart/commit/2dab801ed4ab591c626fc6674f306fcf0d004c1e"], "aliases": ["CVE-2020-4062"], "assigner": "GitHub_M", "epss": 0.42, "enisaIdProduct": [{"id": "15c48077-6c2e-364c-9bb6-6e7e0e133b3f", "product": {"name": "Conjur OSS Helm Chart"}, "product_version": "< 2.0.0"}], "enisaIdVendor": [{"id": "5f6ec4e4-41af-3865-942d-e0569da3c0a7", "vendor": {"name": "CyberArk"}}], "isExploited": false}