{"id": "EUVD-2020-23357", "enisaUuid": "660811c0-5c71-38c4-b639-abf20f89e47a", "description": "Thinkific Thinkific Online Course Creation Platform 1.0 is affected by: Cross Site Scripting (XSS). The impact is: execute arbitrary code (remote). The component is: Affected Source code of the website CMS which is been used by many to host their online courses using the Thinkific Platform. The attack vector is: To exploit the vulnerability any user has to just visit the link - https://hacktify.thinkific.com/account/billing?success=%E2%80%AA%3Cscript%3Ealert(1)%3C/script%3E. ¶¶ Thinkific is a Website based Learning Platform Product which is used by thousands of users worldwide. There is a Cross Site Scripting (XSS) based vulnerability in the code of the CMS where any attacker can execute a XSS attack. Proof of Concept & Steps to Reproduce: Step1 : Go to Google.com Step 2 : Search for this Dork site:thinkific.com -www Step 3 : You will get a list of websites which are running on the thinkific domains. Step 4 : Create account and signin in any of the website Step 5 : Add this endpoint at the end of the domain and you will see that there is a XSS Alert /account/billing?success=%E2%80%AA<script>alert(1)</script> Step 6 : Choose any domains from google for any website this exploit will work on all the websites as it is a code based flaw in the CMS Step 7 : Thousands of websites are vulnerable due to this vulnerable code in the CMS itself which is giving rise to the XSS attack.", "datePublished": "2023-07-25T00:00:00", "dateUpdated": "2024-10-23T20:05:50", "baseScore": 6.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:C/C:L/I:L/A:N", "references": ["https://medium.com/@rohitgautam26/cve-2020-35698-a922189c42ef", "https://medium.com/%40rohitgautam26/cve-2020-35698-a922189c42ef"], "aliases": ["CVE-2020-35698"], "assigner": "mitre", "epss": 0.08, "enisaIdProduct": [{"id": "5ddeff4a-d86f-3472-896f-e6119d91a11a", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "34f882e9-7d39-38a8-9890-b284a3d7d91b", "vendor": {"name": "n/a"}}], "isExploited": false}