{"id": "EUVD-2020-2747", "enisaUuid": "33d74481-20b5-3a3f-b776-6166e6aa89de", "description": "Visual Components (owned by KUKA) is a robotic simulator that allows simulating factories and robots in order toimprove planning and decision-making processes. Visual Components software requires a special license which can beobtained from a network license server. The network license server binds to all interfaces (0.0.0.0) and listensfor packets over UDP port 5093. No authentication/authorization is required in order to communicate with theserver. The protocol being used is a property protocol by RMS Sentinel which provides the licensing infrastructurefor the network license server. RMS Sentinel license manager service exposes UDP port 5093 which provides sensitivesystem information that could be leveraged for further exploitation without any kind of authentication. Thisinformation includes detailed hardware and OS characteristics.After a decryption process, a textual protocol is found which contains a simple header with the requested command,application-identifier, and some arguments. The protocol is vulnerable to DoS through an arbitrary pointerderreference. This flaw allows an attacker to to pass a specially crafted package that, when processed by theservice, causes an arbitrary pointer from the stack to be dereferenced, causing an uncaught exception thatterminates the service. This can be further contructed in combination with RVDP#710 which exploits an informationdisclosure leak, or with RVDP#711 for an stack-overflow and potential code execution.Beyond denying simulations, Visual Components provides capabilities to interface with industrial machinery andautomate certain processes (e.g. testing, benchmarking, etc.) which depending on the DevOps setup might beintegrated into the industrial flow. Accordingly, a DoS in the simulation might have higher repercusions, dependingon the Industrial Control System (ICS) ICS infrastructure.", "datePublished": "2020-11-06T11:20:12", "dateUpdated": "2024-09-17T04:29:05", "baseScore": 8.2, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:H", "references": ["https://www.visualcomponents.com/products/visual-components/"], "aliases": ["CVE-2020-10292"], "assigner": "Alias", "epss": 0.66, "enisaIdProduct": [{"id": "ad2af70f-8032-32e3-84dc-8a1fe072b5d0", "product": {"name": "Visual Components Network License Server 2.0.8"}, "product_version": "unspecified"}], "enisaIdVendor": [{"id": "d5a34baf-370a-3c0b-8b99-6004033b29ab", "vendor": {"name": "KUKA Roboter GmbH"}}], "isExploited": false}