{"id": "EUVD-2020-12256", "enisaUuid": "90ae67bc-b663-3a7c-9dce-10bf87c5d6b6", "description": "A remote code execution vulnerability exists in the way that the scripting engine handles objects in memory in Internet Explorer. The vulnerability could corrupt memory in such a way that an attacker could execute arbitrary code in the context of the current user. An attacker who successfully exploited the vulnerability could gain the same user rights as the current user. If the current user is logged on with administrative user rights, an attacker who successfully exploited the vulnerability could take control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights.\nIn a web-based attack scenario, an attacker could host a specially crafted website that is designed to exploit the vulnerability through Internet Explorer and then convince a user to view the website. An attacker could also embed an ActiveX control marked &quot;safe for initialization&quot; in an application or Microsoft Office document that hosts the IE rendering engine. The attacker could also take advantage of compromised websites and websites that accept or host user-provided content or advertisements. These websites could contain specially crafted content that could exploit the vulnerability.\nThe security update addresses the vulnerability by modifying how the scripting engine handles objects in memory.\n", "datePublished": "2020-08-17T19:13:00", "dateUpdated": "2025-10-21T23:35:37", "baseScore": 7.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H/E:P/RL:O/RC:C", "references": ["https://packetstormsecurity.com/files/cve/CVE-2020-1380", "https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2020-1380", "http://packetstormsecurity.com/files/163056/Internet-Explorer-jscript9.dll-Memory-Corruption.html", "https://nvd.nist.gov/vuln/detail/CVE-2020-1380", "https://www.cisa.gov/known-exploited-vulnerabilities-catalog?field_cve=CVE-2020-1380"], "aliases": ["CVE-2020-1380"], "assigner": "microsoft", "epss": 91.73, "exploitedSince": "2021-11-03T00:00:00", "enisaIdProduct": [{"id": "1cd3bf38-5a4d-3c31-86d1-4b1014db7d57", "product": {"name": "Internet Explorer 11"}, "product_version": "1.0.0 <publication"}], "enisaIdVendor": [{"id": "9aed7e36-c066-38c8-934e-f2dec720e3fd", "vendor": {"name": "Microsoft"}}], "isExploited": true}