{"id": "EUVD-2020-6716", "enisaUuid": "8a53ec99-3f91-3161-8e86-e01596795e87", "description": "Vulnerability in the Oracle Communications Session Border Controller product of Oracle Communications Applications (component: System Admin). Supported versions that are affected are 8.1.0, 8.2.0 and 8.3.0. Easily exploitable vulnerability allows low privileged attacker with network access via SSH to compromise Oracle Communications Session Border Controller. Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in Oracle Communications Session Border Controller, attacks may significantly impact additional products. Successful attacks of this vulnerability can result in unauthorized access to critical data or complete access to all Oracle Communications Session Border Controller accessible data as well as unauthorized update, insert or delete access to some of Oracle Communications Session Border Controller accessible data and unauthorized ability to cause a partial denial of service (partial DOS) of Oracle Communications Session Border Controller. CVSS 3.1 Base Score 8.2 (Confidentiality, Integrity and Availability impacts). CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:H/I:L/A:L).", "datePublished": "2020-07-15T17:34:28", "dateUpdated": "2024-09-27T18:37:48", "baseScore": 8.2, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:H/I:L/A:L", "references": ["https://www.oracle.com/security-alerts/cpujul2020.html"], "aliases": ["CVE-2020-14580"], "assigner": "oracle", "epss": 0.58, "enisaIdProduct": [{"id": "1cfe6926-47e5-3316-8786-a312ce2542d7", "product": {"name": "Communications Session Border Controller"}, "product_version": "8.1.0"}, {"id": "2f3a67ec-5441-33af-b13a-935092a98d8d", "product": {"name": "Communications Session Border Controller"}, "product_version": "8.3.0"}, {"id": "9347f798-76bc-3e31-a778-e7a3c07bf140", "product": {"name": "Communications Session Border Controller"}, "product_version": "8.2.0"}], "enisaIdVendor": [{"id": "102f044e-eeb3-333d-b42a-7a3a12a594ab", "vendor": {"name": "Oracle Corporation"}}], "isExploited": false}