{"id": "EUVD-2020-1289", "enisaUuid": "da5ff852-2a45-3daf-b06d-8d36bce8bb98", "description": "An issue was discovered in Pivotal Spring Security before 3.2.10, 4.1.x before 4.1.4, and 4.2.x before 4.2.1. Spring Security does not consider URL path parameters when processing security constraints. By adding a URL path parameter with an encoded \"/\" to a request, an attacker may be able to bypass a security constraint. The root cause of this issue is a lack of clarity regarding the handling of path parameters in the Servlet Specification. Some Servlet containers include path parameters in the value returned for getPathInfo() and some do not. Spring Security uses the value returned by getPathInfo() as part of the process of mapping requests to security constraints. The unexpected presence of path parameters can cause a constraint to be bypassed. Users of Apache Tomcat (all current versions) are not affected by this vulnerability since Tomcat follows the guidance previously provided by the Servlet Expert group and strips path parameters from the value returned by getContextPath(), getServletPath(), and getPathInfo(). Users of other Servlet containers based on Apache Tomcat may or may not be affected depending on whether or not the handling of path parameters has been modified. Users of IBM WebSphere Application Server 8.5.x are known to be affected. Users of other containers that implement the Servlet specification may be affected.", "datePublished": "2017-01-06T22:00:00", "dateUpdated": "2024-08-06T03:07:30", "baseScore": 7.5, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N", "references": ["https://nvd.nist.gov/vuln/detail/CVE-2016-9879", "https://access.redhat.com/errata/RHSA-2017:1832", "https://pivotal.io/security/cve-2016-9879", "http://www.securityfocus.com/bid/95142"], "aliases": ["CVE-2016-9879", "GHSA-v35c-49j6-q8hq"], "assigner": "dell", "epss": 0.32, "enisaIdProduct": [], "enisaIdVendor": [{"id": "7d6e813a-703f-390c-bf4d-24d4eb493d34", "vendor": {"name": "n/a"}}], "isExploited": false}