{"id": "EUVD-2020-12357", "enisaUuid": "69994f04-017e-3d42-926f-5d698acfdb27", "description": "A remote code execution vulnerability exists in Microsoft Outlook when the software fails to properly handle objects in memory. An attacker who successfully exploited the vulnerability could run arbitrary code in the context of the current user. If the current user is logged on with administrative user rights, an attacker could take control of the affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights.\nExploitation of the vulnerability requires that a user open a specially crafted file with an affected version of Microsoft Outlook software. In an email attack scenario, an attacker could exploit the vulnerability by sending the specially crafted file to the user and convincing the user to open the file. In a web-based attack scenario, an attacker could host a website (or leverage a compromised website that accepts or hosts user-provided content) that contains a specially crafted file designed to exploit the vulnerability. An attacker would have no way to force users to visit the website. Instead, an attacker would have to convince users to click a link, typically by way of an enticement in an email or instant message, and then convince them to open the specially crafted file.\nNote that where severity is indicated as Critical in the Affected Products table, the Preview Pane is an attack vector.\nThe security update addresses the vulnerability by correcting how Outlook handles objects in memory.\n", "datePublished": "2020-08-17T19:13:09", "dateUpdated": "2024-08-04T06:39:10", "baseScore": 5.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:R/S:U/C:H/I:N/A:N/E:P/RL:O/RC:C", "references": ["https://portal.msrc.microsoft.com/en-US/security-guidance/advisory/CVE-2020-1483"], "aliases": ["CVE-2020-1483"], "assigner": "microsoft", "epss": 19.04, "enisaIdProduct": [{"id": "4c1c449c-5cd4-3998-b29e-42f86bff5de1", "product": {"name": "Microsoft 365 Apps for Enterprise"}, "product_version": "16.0.1 <https://aka.ms/OfficeSecurityReleases"}, {"id": "65ab1fd6-cfbb-3091-a1ce-56eb1d4ea8ae", "product": {"name": "Microsoft Outlook 2016"}, "product_version": "16.0.0.0 <publication"}, {"id": "aa2d6f75-c999-3f43-a06d-6091cb6bffc4", "product": {"name": "Microsoft Office 2019"}, "product_version": "19.0.0 <https://aka.ms/OfficeSecurityReleases"}, {"id": "aad34117-fbc2-35fc-92ff-f9ebc8fb12ef", "product": {"name": "Microsoft Outlook 2010 Service Pack 2"}, "product_version": "13.0.0.0 <publication"}, {"id": "b54f0da8-b3c4-31d9-995b-1cb42a14b424", "product": {"name": "Microsoft Outlook 2013 Service Pack 1"}, "product_version": "15.0.0.0 <publication"}], "enisaIdVendor": [{"id": "eab2e79c-5b21-38a6-9c85-297e3b905465", "vendor": {"name": "Microsoft"}}], "isExploited": false}