{"id": "EUVD-2020-22049", "enisaUuid": "5bd30d75-ae44-3858-8d69-4926be39c42a", "description": "When Security Assertion Markup Language (SAML) authentication is enabled and the 'Validate Identity Provider Certificate' option is disabled (unchecked), improper verification of signatures in PAN-OS SAML authentication enables an unauthenticated network-based attacker to access protected resources. The attacker must have network access to the vulnerable server to exploit this vulnerability. This issue affects PAN-OS 9.1 versions earlier than PAN-OS 9.1.3; PAN-OS 9.0 versions earlier than PAN-OS 9.0.9; PAN-OS 8.1 versions earlier than PAN-OS 8.1.15, and all versions of PAN-OS 8.0 (EOL). This issue does not affect PAN-OS 7.1. This issue cannot be exploited if SAML is not used for authentication. This issue cannot be exploited if the 'Validate Identity Provider Certificate' option is enabled (checked) in the SAML Identity Provider Server Profile. Resources that can be protected by SAML-based single sign-on (SSO) authentication are: GlobalProtect Gateway, GlobalProtect Portal, GlobalProtect Clientless VPN, Authentication and Captive Portal, PAN-OS next-generation firewalls (PA-Series, VM-Series) and Panorama web interfaces, Prisma Access In the case of GlobalProtect Gateways, GlobalProtect Portal, Clientless VPN, Captive Portal, and Prisma Access, an unauthenticated attacker with network access to the affected servers can gain access to protected resources if allowed by configured authentication and Security policies. There is no impact on the integrity and availability of the gateway, portal or VPN server. An attacker cannot inspect or tamper with sessions of regular users. In the worst case, this is a critical severity vulnerability with a CVSS Base Score of 10.0 (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:N). In the case of PAN-OS and Panorama web interfaces, this issue allows an unauthenticated attacker with network access to the PAN-OS or Panorama web interfaces to log in as an administrator and perform administrative actions. In the worst-case scenario, this is a critical severity vulnerability with a CVSS Base Score of 10.0 (CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H). If the web interfaces are only accessible to a restricted management network, then the issue is lowered to a CVSS Base Score of 9.6 (CVSS:3.1/AV:A/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H). Palo Alto Networks is not aware of any malicious attempts to exploit this vulnerability.", "datePublished": "2020-06-29T15:10:11", "dateUpdated": "2025-10-21T23:35:41", "baseScore": 10.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H", "references": ["https://security.paloaltonetworks.com/CVE-2020-2021", "https://nvd.nist.gov/vuln/detail/CVE-2020-2021", "https://www.cisa.gov/known-exploited-vulnerabilities-catalog?field_cve=CVE-2020-2021"], "aliases": ["CVE-2020-2021"], "assigner": "palo_alto", "epss": 16.87, "exploitedSince": "2022-03-25T00:00:00", "enisaIdProduct": [{"id": "5afb053e-e575-3042-9a62-16647d69ed55", "product": {"name": "PAN-OS"}, "product_version": "8.0.*"}, {"id": "5f0e9c25-f7f3-331e-9c5e-8f9afb8f409b", "product": {"name": "PAN-OS"}, "product_version": "9.1 <9.1.3"}, {"id": "6c492a1d-4010-315c-9943-9ec24957d46f", "product": {"name": "PAN-OS"}, "product_version": "9.0 <9.0.9"}, {"id": "afa15f07-2bc0-38f7-84ba-d1dc7e1c3828", "product": {"name": "PAN-OS"}, "product_version": ""}, {"id": "b6fa23f2-f27d-310a-a822-d7564f8338bf", "product": {"name": "PAN-OS"}, "product_version": "8.1 <8.1.15"}], "enisaIdVendor": [{"id": "805fd64b-fb0b-3a65-9e14-8292c26c6114", "vendor": {"name": "Palo Alto Networks"}}], "isExploited": true}