{"id": "EUVD-2020-0528", "enisaUuid": "de5b31f7-38a4-3f41-80bc-d5d2dd1e613a", "description": "In TimelineJS before version 3.7.0, some user data renders as HTML. An attacker could implement an XSS exploit with maliciously crafted content in a number of data fields. This risk is present whether the source data for the timeline is stored on Google Sheets or in a JSON configuration file. Most TimelineJS users configure their timeline with a Google Sheets document. Those users are exposed to this vulnerability if they grant write access to the document to a malicious inside attacker, if the access of a trusted user is compromised, or if they grant public write access to the document. Some TimelineJS users configure their timeline with a JSON document. Those users are exposed to this vulnerability if they grant write access to the document to a malicious inside attacker, if the access of a trusted user is compromised, or if write access to the system hosting that document is otherwise compromised. Version 3.7.0 of TimelineJS addresses this in two ways. For content which is intended to support limited HTML markup for styling and linking, that content is \"sanitized\" before being added to the DOM. For content intended for simple text display, all markup is stripped. Very few users of TimelineJS actually install the TimelineJS code on their server. Most users publish a timeline using a URL hosted on systems we control. The fix for this issue is published to our system such that **those users will automatically begin using the new code**. The only exception would be users who have deliberately edited the embed URL to \"pin\" their timeline to an earlier version of the code. Some users of TimelineJS use it as a part of a wordpress plugin (knight-lab-timelinejs). Version 3.7.0.0 of that plugin and newer integrate the updated code. Users are encouraged to update the plugin rather than manually update the embedded version of TimelineJS.", "datePublished": "2020-07-09T18:25:12", "dateUpdated": "2024-08-04T13:08:21", "baseScore": 7.2, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H", "references": ["https://github.com/NUKnightLab/TimelineJS3/security/advisories/GHSA-2jpm-827p-j44g", "https://nvd.nist.gov/vuln/detail/CVE-2020-15092", "https://knightlab.northwestern.edu/2020/07/09/timelinejs-update/index.html", "https://knightlab.northwestern.edu/posts", "https://knightlab.northwestern.edu/posts/"], "aliases": ["CVE-2020-15092", "GHSA-2jpm-827p-j44g"], "assigner": "GitHub_M", "epss": 1.32, "enisaIdProduct": [{"id": "dbf79d52-f356-3bc7-a6dc-7cff54c54957", "product": {"name": "TimelineJS3"}, "product_version": "< 3.7.0"}], "enisaIdVendor": [{"id": "5066af24-4705-3cdf-a3a9-166659ca3288", "vendor": {"name": "nuknightlab"}}], "isExploited": false}