{"id": "EUVD-2020-24458", "enisaUuid": "865c87e7-2170-3fcc-847f-e7daa3ead1c4", "description": "A vulnerability in the web services interface of Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to conduct directory traversal attacks and obtain read and delete access to sensitive files on a targeted system. The vulnerability is due to a lack of proper input validation of the HTTP URL. An attacker could exploit this vulnerability by sending a crafted HTTP request containing directory traversal character sequences. An exploit could allow the attacker to view or delete arbitrary files on the targeted system. When the device is reloaded after exploitation of this vulnerability, any files that were deleted are restored. The attacker can only view and delete files within the web services file system. This file system is enabled when the affected device is configured with either WebVPN or AnyConnect features. This vulnerability can not be used to obtain access to ASA or FTD system files or underlying operating system (OS) files. Reloading the affected device will restore all files within the web services file system.", "datePublished": "2020-05-06T16:41:01", "dateUpdated": "2024-11-15T17:25:50", "baseScore": 9.1, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N", "references": ["https://packetstormsecurity.com/files/cve/CVE-2020-3187", "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-asaftd-path-JE3azWw43", "http://packetstormsecurity.com/files/158648/Cisco-Adaptive-Security-Appliance-Software-9.7-Arbitrary-File-Deletion.html"], "aliases": ["CVE-2020-3187"], "assigner": "cisco", "epss": 94.34, "enisaIdProduct": [{"id": "94575605-b52b-3c5c-b112-2e3337643016", "product": {"name": "Cisco Adaptive Security Appliance (ASA) Software"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "188c85ae-c5c3-3488-9d96-a598ecd2ec2b", "vendor": {"name": "Cisco"}}], "isExploited": false}