{"id": "EUVD-2020-22061", "enisaUuid": "0904aaeb-0268-3439-ba8e-00e9dcc693da", "description": "When SSL/TLS Forward Proxy Decryption mode has been configured to decrypt the web transactions, the PAN-OS URL filtering feature inspects the HTTP Host and URL path headers for policy enforcement on the decrypted HTTPS web transactions but does not consider Server Name Indication (SNI) field within the TLS Client Hello handshake. This allows a compromised host in a protected network to evade any security policy that uses URL filtering on a firewall configured with SSL Decryption in the Forward Proxy mode. A malicious actor can then use this technique to evade detection of communication on the TLS handshake phase between a compromised host and a remote malicious server. This technique does not increase the risk of a host being compromised in the network. It does not impact the confidentiality or availability of a firewall. This is considered to have a low impact on the integrity of the firewall because the firewall fails to enforce a policy on certain traffic that should have been blocked. This issue does not impact the URL filtering policy enforcement on clear text or encrypted web transactions. This technique can be used only after a malicious actor has compromised a host in the protected network and the TLS/SSL Decryption feature is enabled for the traffic that the attacker controls. Palo Alto Networks is not aware of any malware that uses this technique to exfiltrate data. This issue is applicable to all current versions of PAN-OS. This issue does not impact Panorama or WF-500 appliances.", "datePublished": "2020-08-12T17:05:15", "dateUpdated": "2024-09-17T04:10:07", "baseScore": 3.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:H/UI:N/S:C/C:N/I:L/A:N", "references": ["https://security.paloaltonetworks.com/CVE-2020-2035", "https://www.mnemonic.no/blog/introducing-snicat/"], "aliases": ["CVE-2020-2035"], "assigner": "palo_alto", "epss": 0.21, "enisaIdProduct": [{"id": "0b3f2758-15ef-3b70-b6ab-b3e8b52b87b9", "product": {"name": "PAN-OS"}, "product_version": "9.1.*"}, {"id": "43cbd55a-c688-3365-a30c-a933ee20f174", "product": {"name": "PAN-OS"}, "product_version": "10.0.*"}, {"id": "a1d3bac0-bf26-3cd2-8dae-1ad998700044", "product": {"name": "PAN-OS"}, "product_version": "9.0.*"}, {"id": "f4163cf1-5115-3644-a101-afecb82aefce", "product": {"name": "PAN-OS"}, "product_version": "8.1.*"}, {"id": "f9d4c116-8a50-3d88-9381-f8ca6d9890dc", "product": {"name": "PAN-OS"}, "product_version": "10.1.*"}], "enisaIdVendor": [{"id": "d633c261-98a8-369c-b32c-4833a48d08d6", "vendor": {"name": "Palo Alto Networks"}}], "isExploited": false}