{"id": "EUVD-2020-12485", "enisaUuid": "ecc2c8d0-ba87-3065-8be5-3f934c140b57", "description": "This issue occurs on Juniper Networks Junos OS devices which do not support Advanced Forwarding Interface (AFI) / Advanced Forwarding Toolkit (AFT). Devices using AFI and AFT are not exploitable to this issue. An improper initialization of memory in the packet forwarding architecture in Juniper Networks Junos OS non-AFI/AFT platforms which may lead to a Denial of Service (DoS) vulnerability being exploited when a genuine packet is received and inspected by non-AFT/AFI sFlow and when the device is also configured with firewall policers. This first genuine packet received and inspected by sampled flow (sFlow) through a specific firewall policer will cause the device to reboot. After the reboot has completed, if the device receives and sFlow inspects another genuine packet seen through a specific firewall policer, the device will generate a core file and reboot. Continued inspection of these genuine packets will create an extended Denial of Service (DoS) condition. Depending on the method for service restoration, e.g. hard boot or soft reboot, a core file may or may not be generated the next time the packet is received and inspected by sFlow. This issue affects: Juniper Networks Junos OS 17.4 versions prior to 17.4R2-S9, 17.4R3 on PTX1000 and PTX10000 Series, QFX10000 Series; 18.1 versions prior to 18.1R3-S9 on PTX1000 and PTX10000 Series, QFX10000 Series; 18.2X75 versions prior to 18.2X75-D12, 18.2X75-D30 on PTX1000 and PTX10000 Series, QFX10000 Series; 18.2 versions prior to 18.2R3 on PTX1000 and PTX10000 Series, QFX10000 Series; 18.3 versions prior to 18.3R3 on PTX1000 and PTX10000 Series, QFX10000 Series. This issue is not applicable to Junos OS versions before 17.4R1. This issue is not applicable to Junos OS Evolved or Junos OS with Advanced Forwarding Toolkit (AFT) forwarding implementations which use a different implementation of sFlow. The following example information is unrelated to this issue and is provided solely to assist you with determining if you have AFT or not. Example: A Junos OS device which supports the use of EVPN signaled VPWS with Flexible Cross Connect uses the AFT implementation. Since this configuration requires support and use of the AFT implementation to support this configuration, the device is not vulnerable to this issue as the sFlow implementation is different using the AFT architecture. For further details about AFT visit the AFI / AFT are in the links below. If you are uncertain if you use the AFI/AFT implementation or not, there are configuration examples in the links below which you may use to determine if you are vulnerable to this issue or not. If the commands work, you are. If not, you are not. You may also use the Feature Explorer to determine if AFI/AFT is supported or not. If you are still uncertain, please contact your support resources.", "datePublished": "2020-04-08T19:25:54", "dateUpdated": "2024-09-16T18:03:44", "baseScore": 7.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H", "references": ["https://kb.juniper.net/JSA11000", "https://github.com/Juniper/AFI", "https://www.juniper.net/documentation/en_US/junos/topics/example/example-configuring-vpws-service-with-evpn-signaling-mechanisms.html"], "aliases": ["CVE-2020-1617"], "assigner": "juniper", "epss": 0.66, "enisaIdProduct": [{"id": "3adbaa39-9f2b-34c5-8a41-b5054733b171", "product": {"name": "Junos OS"}, "product_version": "18.2 <18.2R3"}, {"id": "b1331c7a-709f-37c7-be24-8e757e5715d4", "product": {"name": "Junos OS"}, "product_version": "18.1 ≤18.1R3-S9"}, {"id": "cc96980a-2b1a-3487-9900-9b663118516e", "product": {"name": "Junos OS"}, "product_version": "18.2X75 <18.2X75-D12, 18.2X75-D30"}, {"id": "dd841157-5e65-33ba-9245-7c0eb99f13be", "product": {"name": "Junos OS"}, "product_version": "17.4 <17.4R2-S9, 17.4R3"}, {"id": "f5af5ba5-0a75-3e54-b059-51ff47e587ad", "product": {"name": "Junos OS"}, "product_version": "18.3 <18.3R3"}], "enisaIdVendor": [{"id": "b48374d6-4419-3d6b-9eba-6370d8f8c2cd", "vendor": {"name": "Juniper Networks"}}], "isExploited": false}