{"id": "EUVD-2020-21848", "enisaUuid": "55172a38-6df5-3f07-8869-ca109f3a6a17", "description": "An issue was discovered in Xen through 4.14.x. Neither xenstore implementation does any permission checks when reporting a xenstore watch event. A guest administrator can watch the root xenstored node, which will cause notifications for every created, modified, and deleted key. A guest administrator can also use the special watches, which will cause a notification every time a domain is created and destroyed. Data may include: number, type, and domids of other VMs; existence and domids of driver domains; numbers of virtual interfaces, block devices, vcpus; existence of virtual framebuffers and their backend style (e.g., existence of VNC service); Xen VM UUIDs for other domains; timing information about domain creation and device setup; and some hints at the backend provisioning of VMs and their devices. The watch events do not contain values stored in xenstore, only key names. A guest administrator can observe non-sensitive domain and device lifecycle events relating to other guests. This information allows some insight into overall system configuration (including the number and general nature of other guests), and configuration of other guests (including the number and general nature of other guests' devices). This information might be commercially interesting or might make other attacks easier. There is not believed to be exposure of sensitive data. Specifically, there is no exposure of VNC passwords, port numbers, pathnames in host and guest filesystems, cryptographic keys, or within-guest data.", "datePublished": "2020-12-15T17:08:13", "dateUpdated": "2024-08-04T16:55:10", "baseScore": 2.3, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:U/C:L/I:N/A:N", "references": ["https://www.suse.com/security/cve/CVE-2020-29480.html", "https://www.debian.org/security/2020/dsa-4812", "https://linux.oracle.com/cve/CVE-2020-29480.html", "https://xenbits.xenproject.org/xsa/advisory-115.html", "https://lists.fedoraproject.org/archives/list/package-announce%40lists.fedoraproject.org/message/OBLV6L6Q24PPQ2CRFXDX4Q76KU776GKI/", "https://lists.fedoraproject.org/archives/list/package-announce%40lists.fedoraproject.org/message/2C6M6S3CIMEBACH6O7V4H2VDANMO6TVA/"], "aliases": ["CVE-2020-29480"], "assigner": "mitre", "epss": 0.06, "enisaIdProduct": [{"id": "bc47ba52-a686-345d-ba4a-bbba424c5ed6", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "8eed0097-3b86-3f71-8f88-819fbe3dc3d6", "vendor": {"name": "n/a"}}], "isExploited": false}