{"id": "EUVD-2015-5317", "enisaUuid": "300c4907-9292-3706-ac8e-6aded020535c", "description": "Background For regular, unencrypted FTP traffic, the FTP ALG can inspect the unencrypted control channel and open related sessions for the FTP data channel. These related sessions (gates) are specific to source and destination IPs and ports of client and server. The design intent of the ftps-extensions option (which is disabled by default) is to provide similar functionality when the SRX secures the FTP/FTPS client. As the control channel is encrypted, the FTP ALG cannot inspect the port specific information and will open a wider TCP data channel (gate) from client IP to server IP on all destination TCP ports. In FTP/FTPS client environments to an enterprise network or the Internet, this is the desired behavior as it allows firewall policy to be written to FTP/FTPS servers on well-known control ports without using a policy with destination IP ANY and destination port ANY. Issue The ftps-extensions option is not intended or recommended where the SRX secures the FTPS server, as the wide data channel session (gate) will allow the FTPS client temporary access to all TCP ports on the FTPS server. The data session is associated to the control channel and will be closed when the control channel session closes. Depending on the configuration of the FTPS server, supporting load-balancer, and SRX inactivity-timeout values, the server/load-balancer and SRX may keep the control channel open for an extended period of time, allowing an FTPS client access for an equal duration.​ Note that the ftps-extensions option is not enabled by default.", "datePublished": "2020-02-28T22:25:24", "dateUpdated": "2024-09-16T16:39:13", "baseScore": 6.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:N", "references": ["https://kb.juniper.net/JSA10706"], "aliases": ["CVE-2015-5361"], "assigner": "mitre", "epss": 0.14, "enisaIdProduct": [{"id": "b591979a-b158-3a49-b514-d6b28be18dc6", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "b95bb28e-fc34-3382-811c-0ec86b02a782", "vendor": {"name": "n/a"}}], "isExploited": false}