{"id": "EUVD-2015-8423", "enisaUuid": "8059358f-044c-3e0f-812c-6d2d92f17ba3", "description": "An issue was discovered in Open-Xchange Guard before 2.2.0-rev8. The \"getprivkeybyid\" API call is used to download a PGP Private Key for a specific user after providing authentication credentials. Clients provide the \"id\" and \"cid\" parameter to specify the current user by its user- and context-ID. The \"auth\" parameter contains a hashed password string which gets created by the client by asking the user to enter his or her OX Guard password. This parameter is used as single point of authentication when accessing PGP Private Keys. In case a user has set the same password as another user, it is possible to download another user's PGP Private Key by iterating the \"id\" and \"cid\" parameters. This kind of attack would also be able by brute-forcing login credentials, but since the \"id\" and \"cid\" parameters are sequential they are much easier to predict than a user's login name. At the same time, there are some obvious insecure standard passwords that are widely used. A attacker could send the hashed representation of typically weak passwords and randomly fetch Private Key of matching accounts. The attack can be executed by both internal users and \"guests\" which use the external mail reader.", "datePublished": "2016-12-15T06:31:00", "dateUpdated": "2024-08-06T08:20:43", "baseScore": 8.8, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H", "references": ["http://www.securityfocus.com/archive/1/537678/100/0/threaded", "http://www.securitytracker.com/id/1035174", "http://packetstormsecurity.com/files/136069/Open-Xchange-Guard-2.2.0-2.0-Private-Key-Disclosure.html"], "aliases": ["CVE-2015-8542"], "assigner": "mitre", "epss": 0.16, "enisaIdProduct": [{"id": "b77ec1a8-b872-33a7-bb7d-06ae4d698168", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "4f2f69eb-cc12-3a12-9ce6-172e9709e68f", "vendor": {"name": "n/a"}}], "isExploited": false}