{"id": "EUVD-2021-15478", "enisaUuid": "ba0f0c67-d795-3d76-85f0-43c5c26c7202", "description": "The Enterprise Message Service Server (tibemsd), Enterprise Message Service Central Administration (tibemsca), Enterprise Message Service JSON configuration generator (tibemsconf2json), and Enterprise Message Service C API components of TIBCO Software Inc.'s TIBCO Enterprise Message Service, TIBCO Enterprise Message Service - Community Edition, and TIBCO Enterprise Message Service - Developer Edition contain a vulnerability that theoretically allows a low privileged attacker with local access on the Windows operating system to insert malicious software. The affected component can be abused to execute the malicious software inserted by the attacker with the elevated privileges of the component. This vulnerability results from the affected component searching for run-time artifacts outside of the installation hierarchy. Affected releases are TIBCO Software Inc.'s TIBCO Enterprise Message Service: versions 8.5.1 and below, TIBCO Enterprise Message Service - Community Edition: versions 8.5.1 and below, and TIBCO Enterprise Message Service - Developer Edition: versions 8.5.1 and below.", "datePublished": "2021-03-23T20:15:24", "dateUpdated": "2024-09-17T03:47:42", "baseScore": 8.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H", "references": ["http://www.tibco.com/services/support/advisories"], "aliases": ["CVE-2021-28822"], "assigner": "tibco", "epss": 0.13, "enisaIdProduct": [{"id": "156c6b4e-379e-3128-8c6f-fe830c644319", "product": {"name": "TIBCO Enterprise Message Service - Community Edition"}, "product_version": "unspecified ≤8.5.1"}, {"id": "c55a0f30-d3dc-35eb-a7c6-702881c6307e", "product": {"name": "TIBCO Enterprise Message Service"}, "product_version": "unspecified ≤8.5.1"}, {"id": "d62e2414-f9ab-3b18-bdc2-820379cd33a5", "product": {"name": "TIBCO Enterprise Message Service - Developer Edition"}, "product_version": "unspecified ≤8.5.1"}], "enisaIdVendor": [{"id": "cfa993ed-551a-3738-91d5-ed36da4b47ae", "vendor": {"name": "TIBCO Software Inc."}}], "isExploited": false}