{"id": "EUVD-2021-28268", "enisaUuid": "fdfe5561-7663-3861-8ad2-faabac0f134f", "description": "FreeSWITCH is a Software Defined Telecom Stack enabling the digital transformation from proprietary telecom switches to a software implementation that runs on any commodity hardware. Prior to version 1.10.7, an attacker can perform a SIP digest leak attack against FreeSWITCH and receive the challenge response of a gateway configured on the FreeSWITCH server. This is done by challenging FreeSWITCH's SIP requests with the realm set to that of the gateway, thus forcing FreeSWITCH to respond with the challenge response which is based on the password of that targeted gateway. Abuse of this vulnerability allows attackers to potentially recover gateway passwords by performing a fast offline password cracking attack on the challenge response. The attacker does not require special network privileges, such as the ability to sniff the FreeSWITCH's network traffic, to exploit this issue. Instead, what is required for this attack to work is the ability to cause the victim server to send SIP request messages to the malicious party. Additionally, to exploit this issue, the attacker needs to specify the correct realm which might in some cases be considered secret. However, because many gateways are actually public, this information can easily be retrieved. The vulnerability appears to be due to the code which handles challenges in `sofia_reg.c`, `sofia_reg_handle_sip_r_challenge()` which does not check if the challenge is originating from the actual gateway. The lack of these checks allows arbitrary UACs (and gateways) to challenge any request sent by FreeSWITCH with the realm of the gateway being targeted. This issue is patched in version 10.10.7. Maintainers recommend that one should create an association between a SIP session for each gateway and its realm to make a check be put into place for this association when responding to challenges.", "datePublished": "2021-10-26T13:55:10", "dateUpdated": "2024-08-04T02:59:31", "baseScore": 5.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:L/I:N/A:N", "references": ["https://packetstormsecurity.com/files/cve/CVE-2021-41158", "https://github.com/signalwire/freeswitch/releases/tag/v1.10.7", "https://github.com/signalwire/freeswitch/security/advisories/GHSA-3v3f-99mv-qvj4", "http://seclists.org/fulldisclosure/2021/Oct/40"], "aliases": ["CVE-2021-41158"], "assigner": "GitHub_M", "epss": 0.36, "enisaIdProduct": [{"id": "903636fa-296d-39b4-ae59-019fd1813001", "product": {"name": "freeswitch"}, "product_version": "< 1.10.7"}], "enisaIdVendor": [{"id": "ee51084a-c166-391a-a5c6-5c7467a7c2c3", "vendor": {"name": "signalwire"}}], "isExploited": false}