{"id": "EUVD-2021-15344", "enisaUuid": "78ada163-2b85-3991-964a-53eb85c02f32", "description": "HVM soft-reset crashes toolstack libxl requires all data structures passed across its public interface to be initialized before use and disposed of afterwards by calling a specific set of functions. Many internal data structures also require this initialize / dispose discipline, but not all of them. When the \"soft reset\" feature was implemented, the libxl__domain_suspend_state structure didn't require any initialization or disposal. At some point later, an initialization function was introduced for the structure; but the \"soft reset\" path wasn't refactored to call the initialization function. When a guest nwo initiates a \"soft reboot\", uninitialized data structure leads to an assert() when later code finds the structure in an unexpected state. The effect of this is to crash the process monitoring the guest. How this affects the system depends on the structure of the toolstack. For xl, this will have no security-relevant effect: every VM has its own independent monitoring process, which contains no state. The domain in question will hang in a crashed state, but can be destroyed by `xl destroy` just like any other non-cooperating domain. For daemon-based toolstacks linked against libxl, such as libvirt, this will crash the toolstack, losing the state of any in-progress operations (localized DoS), and preventing further administrator operations unless the daemon is configured to restart automatically (system-wide DoS). If crashes \"leak\" resources, then repeated crashes could use up resources, also causing a system-wide DoS.", "datePublished": "2021-06-11T14:54:14", "dateUpdated": "2024-08-03T21:47:33", "baseScore": 5.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H", "references": ["https://www.suse.com/security/cve/CVE-2021-28687.html", "https://xenbits.xenproject.org/xsa/advisory-368.txt", "https://security.gentoo.org/glsa/202107-30"], "aliases": ["CVE-2021-28687"], "assigner": "XEN", "epss": 0.05, "enisaIdProduct": [{"id": "94b265e1-db5e-3488-aa3a-1d5239134a43", "product": {"name": "Xen"}, "product_version": "4.14.x"}, {"id": "da86cb02-7b81-3baa-82d7-2f3d0dd8f109", "product": {"name": "Xen"}, "product_version": "4.12.x <unspecified"}, {"id": "f95ef691-7356-3bfa-8d57-2dd4d2dd5a94", "product": {"name": "Xen"}, "product_version": "xen-unstable"}], "enisaIdVendor": [{"id": "f6e9d605-323a-343b-bbf1-4bb2c777c577", "vendor": {"name": "Xen"}}], "isExploited": false}