{"id": "EUVD-2021-6835", "enisaUuid": "ee857093-fabe-3680-a983-c7c71841cde3", "description": "A vulnerability in the Unidirectional Link Detection (UDLD) feature of Cisco FXOS Software and Cisco NX-OS Software could allow an unauthenticated, adjacent attacker to execute arbitrary code with administrative privileges or cause a denial of service (DoS) condition on an affected device. This vulnerability is due to insufficient input validation. An attacker could exploit this vulnerability by sending crafted Cisco UDLD protocol packets to a directly connected, affected device. A successful exploit could allow the attacker to execute arbitrary code with administrative privileges or cause the Cisco UDLD process to crash and restart multiple times, causing the affected device to reload and resulting in a DoS condition. Note: The UDLD feature is disabled by default, and the conditions to exploit this vulnerability are strict. The attacker needs full control of a directly connected device. That device must be connected over a port channel that has UDLD enabled. To trigger arbitrary code execution, both the UDLD-enabled port channel and specific system conditions must exist. In the absence of either the UDLD-enabled port channel or the system conditions, attempts to exploit this vulnerability will result in a DoS condition. It is possible, but highly unlikely, that an attacker could control the necessary conditions for exploitation. The CVSS score reflects this possibility. However, given the complexity of exploitation, Cisco has assigned a Medium Security Impact Rating (SIR) to this vulnerability.", "datePublished": "2021-02-24T19:30:49", "dateUpdated": "2024-11-08T23:37:56", "baseScore": 8.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:A/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H", "references": ["https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-nxos-udld-rce-xetH6w35"], "aliases": ["CVE-2021-1368"], "assigner": "cisco", "epss": 0.27, "enisaIdProduct": [{"id": "e659c197-a7a6-32d3-9ed1-c0ce945c6e29", "product": {"name": "Cisco NX-OS Software"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "ec0c46f5-24ca-3d67-a4f2-55ade0fcfd21", "vendor": {"name": "Cisco"}}], "isExploited": false}