{"id": "EUVD-2021-8688", "enisaUuid": "798c5a4d-eab9-3327-a8a0-da860725d72c", "description": "Restund is an open source NAT traversal server. The restund TURN server can be instructed to open a relay to the loopback address range. This allows you to reach any other service running on localhost which you might consider private. In the configuration that we ship (https://github.com/wireapp/ansible-restund/blob/master/templates/restund.conf.j2#L40-L43) the `status` interface of restund is enabled and is listening on `127.0.0.1`.The `status` interface allows users to issue administrative commands to `restund` like listing open relays or draining connections. It would be possible for an attacker to contact the status interface and issue administrative commands by setting `XOR-PEER-ADDRESS` to `127.0.0.1:{{restund_udp_status_port}}` when opening a TURN channel. We now explicitly disallow relaying to loopback addresses, 'any' addresses, link local addresses, and the broadcast address. As a workaround disable the `status` module in your restund configuration. However there might still be other services running on `127.0.0.0/8` that you do not want to have exposed. The `turn` module can be disabled. Restund will still perform STUN and this might already be enough for initiating calls in your environments. TURN is only used as a last resort when other NAT traversal options do not work. One should also make sure that the TURN server is set up with firewall rules so that it cannot relay to other addresses that you don't want the TURN server to relay to. For example other services in the same VPC where the TURN server is running. Ideally TURN servers should be deployed in an isolated fashion where they can only reach what they need to reach to perform their task of assisting NAT-traversal.", "datePublished": "2021-06-11T20:50:14", "dateUpdated": "2024-08-03T18:09:16", "baseScore": 8.6, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N", "references": ["https://github.com/wireapp/restund/security/advisories/GHSA-96j5-w9jq-pv2x", "https://github.com/coturn/coturn/security/advisories/GHSA-6g6j-r9rf-cm7p", "https://github.com/wireapp/restund/pull/7", "https://docs.wire.com/understand/restund.html", "https://github.com/wireapp/ansible-restund/blob/master/templates/restund.conf.j2#L40-L43", "https://talosintelligence.com/vulnerability_reports/TALOS-2018-0732", "https://www.rtcsec.com/post/2021/01/details-about-cve-2020-26262-bypass-of-coturns-default-access-control-protection/#further-concerns-what-else"], "aliases": ["CVE-2021-21382"], "assigner": "GitHub_M", "epss": 0.46, "enisaIdProduct": [{"id": "86087540-76e7-3eae-99f2-5026ef8e4bad", "product": {"name": "restund"}, "product_version": "< 0.4.15"}], "enisaIdVendor": [{"id": "9f0adca1-6b05-3a23-bf4b-87242def7940", "vendor": {"name": "wireapp"}}], "isExploited": false}