{"id": "EUVD-2021-28242", "enisaUuid": "cf0df0be-5bc6-3f3a-82a2-06fec6f6223f", "description": "FreeSWITCH is a Software Defined Telecom Stack enabling the digital transformation from proprietary telecom switches to a software implementation that runs on any commodity hardware. When handling SRTP calls, FreeSWITCH prior to version 1.10.7 is susceptible to a DoS where calls can be terminated by remote attackers. This attack can be done continuously, thus denying encrypted calls during the attack. When a media port that is handling SRTP traffic is flooded with a specially crafted SRTP packet, the call is terminated leading to denial of service. This issue was reproduced when using the SDES key exchange mechanism in a SIP environment as well as when using the DTLS key exchange mechanism in a WebRTC environment. The call disconnection occurs due to line 6331 in the source file `switch_rtp.c`, which disconnects the call when the total number of SRTP errors reach a hard-coded threshold (100). By abusing this vulnerability, an attacker is able to disconnect any ongoing calls that are using SRTP. The attack does not require authentication or any special foothold in the caller's or the callee's network. This issue is patched in version 1.10.7.", "datePublished": "2021-10-25T22:05:16", "dateUpdated": "2024-08-04T02:59:31", "baseScore": 7.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H", "references": ["https://packetstormsecurity.com/files/cve/CVE-2021-41105", "https://github.com/signalwire/freeswitch/releases/tag/v1.10.7", "https://github.com/signalwire/freeswitch/security/advisories/GHSA-jh42-prph-gp36", "http://seclists.org/fulldisclosure/2021/Oct/43"], "aliases": ["CVE-2021-41105"], "assigner": "GitHub_M", "epss": 4.42, "enisaIdProduct": [{"id": "63cd03a0-470c-3c61-b39f-19dc72a4e969", "product": {"name": "freeswitch"}, "product_version": "< 1.10.7"}], "enisaIdVendor": [{"id": "d108311f-0b12-3755-8f41-741ace418d30", "vendor": {"name": "signalwire"}}], "isExploited": false}