{"id": "EUVD-2021-25574", "enisaUuid": "b4d2cb27-f937-3ddd-980b-be14dd54d727", "description": "OpenOLAT is a web-based learning management system (LMS). A path traversal vulnerability exists in versions prior to 15.3.18, 15.5.3, and 16.0.0. Using a specially prepared ZIP file, it is possible to overwrite any file that is writable by the application server user (e.g. the tomcat user). Depending on the configuration this can be limited to files of the OpenOlat user data directory, however, if not properly set up, the attack could also be used to overwrite application server config files, java code or even operating system files. The attack could be used to corrupt or modify any OpenOlat file such as course structures, config files or temporary test data. Those attack would require in-depth knowledge of the installation and thus more theoretical. If the app server configuration allows the execution of jsp files and the path to the context is known, it is also possible to execute java code. If the app server runs with the same user that is used to deploy the OpenOlat code or has write permissions on the OpenOlat code files and the path to the context is know, code injection is possible. The attack requires an OpenOlat user account to upload a ZIP file and trigger the unzip method. It can not be exploited by unregistered users. The problem is fixed in versions 15.3.18, 15.5.3 and 16.0.0. There are no known workarounds aside from upgrading.", "datePublished": "2021-08-31T17:55:14", "dateUpdated": "2024-08-04T01:58:18", "baseScore": 8.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:H", "references": ["https://github.com/OpenOLAT/OpenOLAT/security/advisories/GHSA-x95v-2pgj-9x8j", "https://github.com/OpenOLAT/OpenOLAT/commit/2cf73c972e23ccd69cc1e103e43c2c8253571d3e", "https://github.com/OpenOLAT/OpenOLAT/commit/5668a41ab3f1753102a89757be013487544279d5", "https://github.com/OpenOLAT/OpenOLAT/commit/699490be8e931af0ef1f135c55384db1f4232637", "https://jira.openolat.org/browse/OO-5549"], "aliases": ["CVE-2021-39180"], "assigner": "GitHub_M", "epss": 1.22, "enisaIdProduct": [{"id": "77805aa3-bed8-3e74-97af-02c47883b7d4", "product": {"name": "OpenOLAT"}, "product_version": "15.4.0, < 15.5.3"}, {"id": "7bb02ff8-3f18-3ad4-9352-ca1721c8691c", "product": {"name": "OpenOLAT"}, "product_version": "< 15.3.18"}], "enisaIdVendor": [{"id": "084f93e9-08f7-3e60-aecf-70d439d69c5a", "vendor": {"name": "OpenOLAT"}}], "isExploited": false}