{"id": "EUVD-2021-2413", "enisaUuid": "12fa423b-3c94-309e-a3b5-9108b818223b", "description": "Kirby is an open source file structured CMS ### Impact Kirby's writer field stores its formatted content as HTML code. Unlike with other field types, it is not possible to escape HTML special characters against cross-site scripting (XSS) attacks, otherwise the formatting would be lost. If the user is logged in to the Panel, a harmful script can for example trigger requests to Kirby's API with the permissions of the victim. Because the writer field did not securely sanitize its contents on save, it was possible to inject malicious HTML code into the content file by sending it to Kirby's API directly without using the Panel. This malicious HTML code would then be displayed on the site frontend and executed in the browsers of site visitors and logged in users who are browsing the site. Attackers must be in your group of authenticated Panel users in order to exploit this weakness. Users who do not make use of the writer field are not affected. This issue has been patched in Kirby 3.5.8 by sanitizing all writer field contents on the backend whenever the content is modified via Kirby's API. Please update to this or a later version to fix the vulnerability.", "datePublished": "2021-11-16T18:05:10", "dateUpdated": "2024-08-04T03:08:31", "baseScore": 7.3, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:N", "references": ["https://github.com/getkirby/kirby/security/advisories/GHSA-x7j7-qp7j-hw3q", "https://nvd.nist.gov/vuln/detail/CVE-2021-41252", "https://github.com/getkirby/kirby/commit/25fc5c6b330442e6433c99befc688f3698c5d1fc", "https://github.com/getkirby/kirby", "https://github.com/getkirby/kirby/releases/tag/3.5.8"], "aliases": ["CVE-2021-41252", "GHSA-x7j7-qp7j-hw3q"], "assigner": "GitHub_M", "epss": 0.44, "enisaIdProduct": [{"id": "6f466c76-808c-32da-a928-a010ca97a51c", "product": {"name": "kirby"}, "product_version": "3.5.0, < 3.5.8"}], "enisaIdVendor": [{"id": "666253d1-1667-3dfa-8b86-565c4c0a6ec0", "vendor": {"name": "getkirby"}}], "isExploited": false}