{"id": "EUVD-2021-19515", "enisaUuid": "ac7f3444-37e7-361a-85c9-fcd0432278a0", "description": "Icinga is a monitoring system which checks the availability of network resources, notifies users of outages, and generates performance data for reporting. In versions prior to 2.11.10 and from version 2.12.0 through version 2.12.4, some of the Icinga 2 features that require credentials for external services expose those credentials through the API to authenticated API users with read permissions for the corresponding object types. IdoMysqlConnection and IdoPgsqlConnection (every released version) exposes the password of the user used to connect to the database. IcingaDB (added in 2.12.0) exposes the password used to connect to the Redis server. ElasticsearchWriter (added in 2.8.0)exposes the password used to connect to the Elasticsearch server. An attacker who obtains these credentials can impersonate Icinga to these services and add, modify and delete information there. If credentials with more permissions are in use, this increases the impact accordingly. Starting with the 2.11.10 and 2.12.5 releases, these passwords are no longer exposed via the API. As a workaround, API user permissions can be restricted to not allow querying of any affected objects, either by explicitly listing only the required object types for object query permissions, or by applying a filter rule.", "datePublished": "2021-07-15T16:05:12", "dateUpdated": "2025-11-03T21:44:46", "baseScore": 8.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H", "references": ["https://www.suse.com/security/cve/CVE-2021-32743.html", "https://github.com/Icinga/icinga2/security/advisories/GHSA-wrpw-pmr8-qgj7", "https://icinga.com/blog/2021/07/15/releasing-icinga-2-12-5-and-2-11-10/", "https://lists.debian.org/debian-lts-announce/2021/11/msg00010.html"], "aliases": ["CVE-2021-32743"], "assigner": "GitHub_M", "epss": 0.98, "enisaIdProduct": [{"id": "4af3a505-9d1d-3665-b297-1589ec19c875", "product": {"name": "icinga2"}, "product_version": "< 2.11.10"}, {"id": "b66b244d-0ea8-39eb-8e8f-cea5605ebe39", "product": {"name": "icinga2"}, "product_version": "2.12.0, ≤ 2.12.4"}], "enisaIdVendor": [{"id": "b39316b3-3918-3e20-82d1-ecb6db937b8d", "vendor": {"name": "Icinga"}}], "isExploited": false}