{"id": "EUVD-2021-2305", "enisaUuid": "26db8d0e-be4b-3a20-be1a-42ba2e64c261", "description": "Functions SDK for EdgeX is meant to provide all the plumbing necessary for developers to get started in processing/transforming/exporting data out of the EdgeX IoT platform. In affected versions broken encryption in app-functions-sdk “AES” transform in EdgeX Foundry releases prior to Jakarta allows attackers to decrypt messages via unspecified vectors. The app-functions-sdk exports an “aes” transform that user scripts can optionally call to encrypt data in the processing pipeline. No decrypt function is provided. Encryption is not enabled by default, but if used, the level of protection may be less than the user may expects due to a broken implementation. Version v2.1.0 (EdgeX Foundry Jakarta release and later) of app-functions-sdk-go/v2 deprecates the “aes” transform and provides an improved “aes256” transform in its place. The broken implementation will remain in a deprecated state until it is removed in the next EdgeX major release to avoid breakage of existing software that depends on the broken implementation. As the broken transform is a library function that is not invoked by default, users who do not use the AES transform in their processing pipelines are unaffected. Those that are affected are urged to upgrade to the Jakarta EdgeX release and modify processing pipelines to use the new \"aes256\" transform.", "datePublished": "2021-11-18T23:50:11", "dateUpdated": "2024-08-04T03:08:31", "baseScore": 5.4, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:H/PR:L/UI:R/S:U/C:H/I:L/A:N", "references": ["https://github.com/edgexfoundry/app-functions-sdk-go/security/advisories/GHSA-6c7m-qwxj-mvhp", "https://nvd.nist.gov/vuln/detail/CVE-2021-41278", "https://github.com/edgexfoundry/app-functions-sdk-go/commit/8fa13c6388ce76a6b878b54490eac61aa7d81165", "https://github.com/edgexfoundry/app-functions-sdk-go"], "aliases": ["CVE-2021-41278", "GHSA-6c7m-qwxj-mvhp"], "assigner": "GitHub_M", "epss": 0.08, "enisaIdProduct": [{"id": "ab376d07-7434-3829-976b-9878e6f9b8ac", "product": {"name": "app-functions-sdk-go"}, "product_version": "< 2.1.0"}], "enisaIdVendor": [{"id": "eabb3f8b-0b0a-3e53-ae86-df7066e87f04", "vendor": {"name": "edgexfoundry"}}], "isExploited": false}