{"id": "EUVD-2021-30715", "enisaUuid": "4d2845b9-41d4-38ed-bee9-ce804e6ff012", "description": "MSEdgeRedirect is a tool to redirect news, search, widgets, weather, and more to a user's default browser. MSEdgeRedirect versions before 0.5.0.1 are vulnerable to Remote Code Execution via specifically crafted URLs. This vulnerability requires user interaction and the acceptance of a prompt. With how MSEdgeRedirect is coded, parameters are impossible to pass to any launched file. However, there are two possible scenarios in which an attacker can do more than a minor annoyance. In Scenario 1 (confirmed), a user visits an attacker controlled webpage; the user is prompted with, and downloads, an executable payload; the user is prompted with, and accepts, the aforementioned crafted URL prompt; and RCE executes the payload the user previously downloaded, if the download path is successfully guessed. In Scenario 2 (not yet confirmed), a user visits an attacked controlled webpage; the user is prompted with, and accepts, the aforementioned crafted URL prompt; and a payload on a remote, attacker controlled, SMB server is executed. The issue was found in the _DecodeAndRun() function, in which I incorrectly assumed _WinAPI_UrlIs() would only accept web resources. Unfortunately, file:/// passes the default _WinAPI_UrlIs check(). File paths are now directly checked for and must fail. There is no currently known exploitation of this vulnerability in the wild. A patched version, 0.5.0.1, has been released that checks for and denies these crafted URLs. There are no workarounds for this issue. Users are advised not to accept any unexpected prompts from web pages.", "datePublished": "2021-12-20T21:20:11", "dateUpdated": "2024-08-04T04:10:16", "baseScore": 8.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H", "references": ["https://github.com/rcmaehl/MSEdgeRedirect/security/advisories/GHSA-95v4-748v-fmf9", "https://github.com/rcmaehl/MSEdgeRedirect/releases/tag/0.5.0.1"], "aliases": ["CVE-2021-43844"], "assigner": "GitHub_M", "epss": 2.5, "enisaIdProduct": [{"id": "1843403b-71bc-34ad-8bb5-8b8def60f1a7", "product": {"name": "MSEdgeRedirect"}, "product_version": "< 0.5.0.1"}], "enisaIdVendor": [{"id": "0036ad07-c4c3-3ee4-95d2-6805f1111d4e", "vendor": {"name": "rcmaehl"}}], "isExploited": false}