{"id": "EUVD-2021-2157", "enisaUuid": "cde41fe7-ac68-343a-8f13-f4522a202b9e", "description": "async-h1 is an asynchronous HTTP/1.1 parser for Rust (crates.io). There is a request smuggling vulnerability in async-h1 before version 2.3.0. This vulnerability affects any webserver that uses async-h1 behind a reverse proxy, including all such Tide applications. If the server does not read the body of a request which is longer than some buffer length, async-h1 will attempt to read a subsequent request from the body content starting at that offset into the body. One way to exploit this vulnerability would be for an adversary to craft a request such that the body contains a request that would not be noticed by a reverse proxy, allowing it to forge forwarded/x-forwarded headers. If an application trusted the authenticity of these headers, it could be misled by the smuggled request. Another potential concern with this vulnerability is that if a reverse proxy is sending multiple http clients' requests along the same keep-alive connection, it would be possible for the smuggled request to specify a long content and capture another user's request in its body. This content could be captured in a post request to an endpoint that allows the content to be subsequently retrieved by the adversary. This has been addressed in async-h1 2.3.0 and previous versions have been yanked.", "datePublished": "2020-12-21T21:50:13", "dateUpdated": "2024-08-04T15:56:03", "baseScore": 6.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:C/C:N/I:H/A:N", "references": ["https://github.com/http-rs/async-h1/security/advisories/GHSA-4vr9-8cjf-vf9c", "https://nvd.nist.gov/vuln/detail/CVE-2020-26281", "https://github.com/http-rs/async-h1", "https://github.com/http-rs/async-h1/releases/tag/v2.3.0", "https://rustsec.org/advisories/RUSTSEC-2020-0093.html"], "aliases": ["CVE-2020-26281", "GHSA-4vr9-8cjf-vf9c"], "assigner": "GitHub_M", "epss": 0.3, "enisaIdProduct": [{"id": "8e3d3f6e-015c-3358-bc62-b64234ead5b4", "product": {"name": "async-h1"}, "product_version": "< 2.3.0"}], "enisaIdVendor": [{"id": "9965ebd0-5437-3a25-9553-cc63d7a9c922", "vendor": {"name": "http-rs"}}], "isExploited": false}