{"id": "EUVD-2021-0503", "enisaUuid": "2f3e83db-0fca-3164-9b46-9cf5f57d2d56", "description": "Flarum is an open source discussion platform for websites. The \"Flarum Sticky\" extension versions 0.1.0-beta.14 and 0.1.0-beta.15 has a cross-site scripting vulnerability. A change in release beta 14 of the Sticky extension caused the plain text content of the first post of a pinned discussion to be injected as HTML on the discussion list. The issue was discovered following an internal audit. Any HTML would be injected through the m.trust() helper. This resulted in an HTML injection where <script> tags would not be executed. However it was possible to run javascript from other HTML attributes, enabling a cross-site scripting (XSS) attack to be performed. Since the exploit only happens with the first post of a pinned discussion, an attacker would need the ability to pin their own discussion, or be able to edit a discussion that was previously pinned. On forums where all pinned posts are authored by your staff, you can be relatively certain the vulnerability has not been exploited. Forums where some user-created discussions were pinned can look at the first post edit date to find whether the vulnerability might have been exploited. Because Flarum doesn't store the post content history, you cannot be certain if a malicious edit was reverted. The fix will be available in version v0.1.0-beta.16 with Flarum beta 16. The fix has already been back-ported to Flarum beta 15 as version v0.1.0-beta.15.1 of the Sticky extension. Forum administrators can disable the Sticky extension until they are able to apply the update. The vulnerability cannot be exploited while the extension is disabled.", "datePublished": "2021-01-26T20:45:24", "dateUpdated": "2024-08-03T18:09:15", "baseScore": 5.4, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:L/A:N", "references": ["https://github.com/flarum/sticky/security/advisories/GHSA-h3gg-7wx2-cq3h", "https://nvd.nist.gov/vuln/detail/CVE-2021-21283", "https://github.com/flarum/sticky/pull/24", "https://github.com/flarum/sticky/commit/7ebd30462bd405c4c0570b93a6d48710e6c3db19", "https://discuss.flarum.org/d/26042-security-update-to-flarum-sticky-010-beta151)", "https://discuss.flarum.org/d/26042-security-update-to-flarum-sticky-010-beta151%29"], "aliases": ["CVE-2021-21283", "GHSA-h3gg-7wx2-cq3h"], "assigner": "GitHub_M", "epss": 0.35, "enisaIdProduct": [{"id": "8646482a-20b4-3c97-a0bb-c0bdc2d97bab", "product": {"name": "sticky"}, "product_version": "v0.1.0-beta.14 ≤v0.1.0-beta.15"}], "enisaIdVendor": [{"id": "2301ab68-0dd5-33fd-afd6-6c05c7b238d8", "vendor": {"name": "flarum"}}], "isExploited": false}