{"id": "EUVD-2021-28253", "enisaUuid": "df40c011-85e7-35f9-bb4e-9e0cc830c809", "description": "Extensible Service Proxy, a.k.a. ESP is a proxy which enables API management capabilities for JSON/REST or gRPC API services. ESPv1 can be configured to authenticate a JWT token. Its verified JWT claim is passed to the application by HTTP header \"X-Endpoint-API-UserInfo\", the application can use it to do authorization. But if there are two \"X-Endpoint-API-UserInfo\" headers from the client, ESPv1 only replaces the first one, the 2nd one will be passed to the application. An attacker can send two \"X-Endpoint-API-UserInfo\" headers, the second one with a fake JWT claim. Application may use the fake JWT claim to do the authorization. This impacts following ESPv1 usages: 1) Users have configured ESPv1 to do JWT authentication with Google ID Token as described in the referenced google endpoint document. 2) Users backend application is using the info in the \"X-Endpoint-API-UserInfo\" header to do the authorization. It has been fixed by v1.58.0. You need to patch it in the following ways: * If your docker image is using tag \":1\", needs to re-start the container to pick up the new version. The tag \":1\" will automatically point to the latest version. * If your docker image tag pings to a specific minor version, e.g. \":1.57\". You need to update it to \":1.58\" and re-start the container. There are no workaround for this issue.", "datePublished": "2021-10-07T18:30:17", "dateUpdated": "2024-08-04T02:59:31", "baseScore": 6.4, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:L/I:L/A:N", "references": ["https://github.com/cloudendpoints/esp/security/advisories/GHSA-43wx-8qmj-9r9q", "https://github.com/cloudendpoints/esp/commit/e310c4f91d229a072507f80c73811489b4cdff27", "https://cloud.google.com/endpoints/docs/openapi/authenticating-users-google-id", "https://github.com/cloudendpoints/esp/releases/tag/v1.58.0"], "aliases": ["CVE-2021-41130"], "assigner": "GitHub_M", "epss": 0.11, "enisaIdProduct": [{"id": "ae5a0149-004d-32dc-a39a-beed0d8a1213", "product": {"name": "esp"}, "product_version": "< 1.58.0"}], "enisaIdVendor": [{"id": "b2160db5-021a-3a18-8b2b-3a018f1f5cd5", "vendor": {"name": "cloudendpoints"}}], "isExploited": false}