{"id": "EUVD-2021-19465", "enisaUuid": "e797517b-159e-3685-9a78-09c082ecf854", "description": "Github's CodeQL action is provided to run CodeQL-based code scanning on non-GitHub CI/CD systems and requires a GitHub access token to connect to a GitHub repository. The runner and its documentation previously suggested passing the GitHub token as a command-line parameter to the process instead of reading it from a file, standard input, or an environment variable. This approach made the token visible to other processes on the same machine, for example in the output of the `ps` command. If the CI system publicly exposes the output of `ps`, for example by logging the output, then the GitHub access token can be exposed beyond the scope intended. Users of the CodeQL runner on 3rd-party systems, who are passing a GitHub token via the `--github-auth` flag, are affected. This applies to both GitHub.com and GitHub Enterprise users. Users of the CodeQL Action on GitHub Actions are not affected. The `--github-auth` flag is now considered insecure and deprecated. The undocumented `--external-repository-token` flag has been removed. To securely provide a GitHub access token to the CodeQL runner, users should **do one of the following instead**: Use the `--github-auth-stdin` flag and pass the token on the command line via standard input OR set the `GITHUB_TOKEN` environment variable to contain the token, then call the command without passing in the token. The old flag remains present for backwards compatibility with existing workflows. If the user tries to specify an access token using the `--github-auth` flag, there is a deprecation warning printed to the terminal that directs the user to one of the above options. All CodeQL runner releases codeql-bundle-20210304 onwards contain the patches. We recommend updating to a recent version of the CodeQL runner, storing a token in your CI system's secret storage mechanism, and passing the token to the CodeQL runner using `--github-auth-stdin` or the `GITHUB_TOKEN` environment variable. If still using the old flag, ensure that process output, such as from `ps`, is not persisted in CI logs.", "datePublished": "2021-05-25T17:10:11", "dateUpdated": "2024-08-03T23:25:30", "baseScore": 4.4, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:U/C:H/I:N/A:N", "references": ["https://github.com/github/codeql-action/security/advisories/GHSA-g36v-2xff-pv5m", "https://github.com/github/codeql-action/commit/58defc0652e935f6f2ffc70a82828b98d75476fb", "https://github.com/github/codeql-action/commit/88714e3a60e72ec53caa0e6a203652ee1f3fb1db", "https://github.com/github/codeql-action/releases/tag/codeql-bundle-20210304", "https://www.netmeister.org/blog/passing-passwords.html"], "aliases": ["CVE-2021-32638"], "assigner": "GitHub_M", "epss": 0.07, "enisaIdProduct": [{"id": "02304615-ba70-3d51-a2a7-f658ff2244c2", "product": {"name": "codeql-action"}, "product_version": "< codeql-bundle-20210304"}], "enisaIdVendor": [{"id": "be61de33-13d4-32b1-a524-0ec9692324f5", "vendor": {"name": "GitHub"}}], "isExploited": false}