{"id": "EUVD-2021-28849", "enisaUuid": "c31773c3-6757-3e7c-b47c-a9a1d921820b", "description": "An issue was discovered in Luna Simo PPR1.180610.011/202001031830. It mishandles software updates such that local third-party apps can provide a spoofed software update file that contains an arbitrary shell script and arbitrary ARM binary, where both will be executed as the root user with an SELinux domain named osi. To exploit this vulnerability, a local third-party app needs to have write access to external storage to write the spoofed update at the expected path. The vulnerable system binary (i.e., /system/bin/osi_bin) does not perform any authentication of the update file beyond ensuring that it is encrypted with an AES key (that is hard-coded in the vulnerable system binary). Processes executing with the osi SELinux domain can programmatically perform the following actions: install apps, grant runtime permissions to apps (including permissions with protection levels of dangerous and development), access extensive Personally Identifiable Information (PII) using the programmatically grant permissions, uninstall apps, set the default launcher app to a malicious launcher app that spoofs other apps, set a network proxy to intercept network traffic, unload kernel modules, set the default keyboard to a keyboard that has keylogging functionality, examine notification contents, send text messages, and more. The spoofed update can optionally contain an arbitrary ARM binary that will be locally stored in internal storage and executed at system startup to achieve persistent code execution as the root user with the osi SELinux domain. This ARM binary will continue to execute at startup even if the app that provided the spoofed update is uninstalled.", "datePublished": "2022-03-11T22:17:42", "dateUpdated": "2024-08-04T03:22:25", "baseScore": 7.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H", "references": ["https://simowireless.com/", "https://www.kryptowire.com/android-firmware-2022/", "https://athack.com/session-details/401", "https://www.kryptowire.com/blog/vsim-vulnerability-within-simo-android-phones-exposed/"], "aliases": ["CVE-2021-41848"], "assigner": "mitre", "epss": 0.08, "enisaIdProduct": [{"id": "9cb79cda-1381-3d1e-9d36-0dbefbd0fcd0", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "bbf0c22d-7b3f-3e60-8c7d-0f2b8f3b5a1a", "vendor": {"name": "n/a"}}], "isExploited": false}