{"id": "EUVD-2021-0862", "enisaUuid": "d4095c25-d5a7-3bd1-9e15-36cb69d5a329", "description": "Kirby is an open source CMS. An editor with write access to the Kirby Panel can upload an SVG file that contains harmful content like `<script>` tags. The direct link to that file can be sent to other users or visitors of the site. If the victim opens that link in a browser where they are logged in to Kirby, the script will run and can for example trigger requests to Kirby's API with the permissions of the victim. This vulnerability is critical if you might have potential attackers in your group of authenticated Panel users, as they can escalate their privileges if they get access to the Panel session of an admin user. Depending on your site, other JavaScript-powered attacks are possible. Visitors without Panel access can only use this attack vector if your site allows SVG file uploads in frontend forms and you don't already sanitize uploaded SVG files. The problem has been patched in Kirby 3.5.4. Please update to this or a later version to fix the vulnerability. Frontend upload forms need to be patched separately depending on how they store the uploaded file(s). If you use `File::create()`, you are protected by updating to 3.5.4+. As a work around you can disable the upload of SVG files in your file blueprints.", "datePublished": "2021-04-27T20:10:13", "dateUpdated": "2024-08-03T22:02:51", "baseScore": 7.6, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:H/I:L/A:N", "references": ["https://github.com/getkirby/kirby/security/advisories/GHSA-qgp4-5qx6-548g", "https://nvd.nist.gov/vuln/detail/CVE-2021-29460", "https://github.com/getkirby/kirby/releases/tag/3.5.4", "http://packetstormsecurity.com/files/162359/Kirby-CMS-3.5.3.1-Cross-Site-Scripting.html", "https://packetstormsecurity.com/files/cve/CVE-2021-29460"], "aliases": ["CVE-2021-29460", "GHSA-qgp4-5qx6-548g"], "assigner": "GitHub_M", "epss": 1.12, "enisaIdProduct": [{"id": "f13d040c-2e4f-38a1-9738-6431eb01b091", "product": {"name": "kirby"}, "product_version": "< 3.5.4"}], "enisaIdVendor": [{"id": "bd8eb2fc-2619-389a-976d-bddd10513cf4", "vendor": {"name": "getkirby"}}], "isExploited": false}