{"id": "EUVD-2021-8670", "enisaUuid": "198bca4b-5ffc-3143-967a-0c888fde880d", "description": "GLPI is an open-source asset and IT management software package that provides ITIL Service Desk features, licenses tracking and software auditing. In GLPI before version 9.5.4 there is an Insecure Direct Object Reference (IDOR) on \"Solutions\". This vulnerability gives an unauthorized user the ability to enumerate GLPI items names (including users logins) using the knowbase search form (requires authentication). To Reproduce: Perform a valid authentication at your GLPI instance, Browse the ticket list and select any open ticket, click on Solution form, then Search a solution form that will redirect you to the endpoint /\"glpi/front/knowbaseitem.php?item_itemtype=Ticket&item_items_id=18&forcetab=Knowbase$1\", and the item_itemtype=Ticket parameter present in the previous URL will point to the PHP alias of glpi_tickets table, so just replace it with \"Users\" to point to glpi_users table instead; in the same way, item_items_id=18 will point to the related column id, so changing it too you should be able to enumerate all the content which has an alias. Since such id(s) are obviously incremental, a malicious party could exploit the vulnerability simply by guessing-based attempts.", "datePublished": "2021-03-08T17:00:33", "dateUpdated": "2024-08-03T18:09:15", "baseScore": 6.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:H/I:N/A:N", "references": ["https://github.com/glpi-project/glpi/commit/aade65b7f67d46f23d276a8acb0df70651c3b1dc", "https://github.com/glpi-project/glpi/releases/tag/9.5.4", "https://github.com/glpi-project/glpi/security/advisories/GHSA-jvwm-gq36-3v7v"], "aliases": ["CVE-2021-21324"], "assigner": "GitHub_M", "epss": 0.31, "enisaIdProduct": [{"id": "ea0eb041-b08c-3e3c-bc47-342f7e7f7be8", "product": {"name": "glpi"}, "product_version": "< 9.5.4"}], "enisaIdVendor": [{"id": "81611369-7586-3420-8332-2710100ffcb5", "vendor": {"name": "glpi-project"}}], "isExploited": false}