{"id": "EUVD-2021-28239", "enisaUuid": "af0b7c51-9334-306e-ba0d-fbee1776e9f4", "description": "Wire-server is the backing server for the open source wire secure messaging application. In affected versions it is possible to trigger email address change of a user with only the short-lived session token in the `Authorization` header. As the short-lived token is only meant as means of authentication by the client for less critical requests to the backend, the ability to change the email address with a short-lived token constitutes a privilege escalation attack. Since the attacker can change the password after setting the email address to one that they control, changing the email address can result in an account takeover by the attacker. Short-lived tokens can be requested from the backend by Wire clients using the long lived tokens, after which the long lived tokens can be stored securely, for example on the devices key chain. The short lived tokens can then be used to authenticate the client towards the backend for frequently performed actions such as sending and receiving messages. While short-lived tokens should not be available to an attacker per-se, they are used more often and in the shape of an HTTP header, increasing the risk of exposure to an attacker relative to the long-lived tokens, which are stored and transmitted in cookies. If you are running an on-prem instance and provision all users with SCIM, you are not affected by this issue (changing email is blocked for SCIM users). SAML single-sign-on is unaffected by this issue, and behaves identically before and after this update. The reason is that the email address used as SAML NameID is stored in a different location in the databse from the one used to contact the user outside wire. Version 2021-08-16 and later provide a new end-point that requires both the long-lived client cookie and `Authorization` header. The old end-point has been removed. If you are running an on-prem instance with at least some of the users invited or provisioned via SAML SSO and you cannot update then you can block `/self/email` on nginz (or in any other proxies or firewalls you may have set up). You don't need to discriminate by verb: `/self/email` only accepts `PUT` and `DELETE`, and `DELETE` is almost never used.", "datePublished": "2021-10-04T18:25:10", "dateUpdated": "2024-08-04T02:59:31", "baseScore": 7.4, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:N", "references": ["https://github.com/wireapp/wire-server/security/advisories/GHSA-9rm2-w6pq-333m"], "aliases": ["CVE-2021-41100"], "assigner": "GitHub_M", "epss": 0.3, "enisaIdProduct": [{"id": "c15f3619-9108-36c8-848b-4dc82abb46a8", "product": {"name": "wire-server"}, "product_version": "< 2021-08-16"}], "enisaIdVendor": [{"id": "8220f703-f8e5-30a6-a972-91edc743c8ff", "vendor": {"name": "wireapp"}}], "isExploited": false}