{"id": "EUVD-2021-19523", "enisaUuid": "8072d37b-fb9f-3fd4-87f5-61f9dd46a3ca", "description": "Gradle is a build tool with a focus on build automation. In versions prior to 7.2, start scripts generated by the `application` plugin and the `gradlew` script are both vulnerable to arbitrary code execution when an attacker is able to change environment variables for the user running the script. This may impact those who use `gradlew` on Unix-like systems or use the scripts generated by Gradle in thieir application on Unix-like systems. For this vulnerability to be exploitable, an attacker needs to be able to set the value of particular environment variables and have those environment variables be seen by the vulnerable scripts. This issue has been patched in Gradle 7.2 by removing the use of `eval` and requiring the use of the `bash` shell. There are a few workarounds available. For CI/CD systems using the Gradle build tool, one may ensure that untrusted users are unable to change environment variables for the user that executes `gradlew`. If one is unable to upgrade to Gradle 7.2, one may generate a new `gradlew` script with Gradle 7.2 and use it for older versions of Gradle. Fpplications using start scripts generated by Gradle, one may ensure that untrusted users are unable to change environment variables for the user that executes the start script. A vulnerable start script could be manually patched to remove the use of `eval` or the use of environment variables that affect the application's command-line. If the application is simple enough, one may be able to avoid the use of the start scripts by running the application directly with Java command.", "datePublished": "2021-07-20T22:55:12", "dateUpdated": "2024-08-03T23:33:55", "baseScore": 7.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H", "references": ["https://www.suse.com/security/cve/CVE-2021-32751.html", "https://security.archlinux.org/CVE-2021-32751", "https://github.com/gradle/gradle/security/advisories/GHSA-6j2p-252f-7mw8", "https://medium.com/dot-debug/the-perils-of-bash-eval-cc5f9e309cae", "https://mywiki.wooledge.org/BashFAQ/048"], "aliases": ["CVE-2021-32751"], "assigner": "GitHub_M", "epss": 0.26, "enisaIdProduct": [{"id": "d6b8419b-b460-38e3-93ce-c20f17b4a15e", "product": {"name": "gradle"}, "product_version": "< 7.2"}], "enisaIdVendor": [{"id": "62781ceb-7069-3bbe-886e-e1ce23acee42", "vendor": {"name": "gradle"}}], "isExploited": false}