{"id": "EUVD-2021-28267", "enisaUuid": "05e69e16-0ad0-379c-8aad-0ba9f4a08515", "description": "FreeSWITCH is a Software Defined Telecom Stack enabling the digital transformation from proprietary telecom switches to a software implementation that runs on any commodity hardware. By default, SIP requests of the type SUBSCRIBE are not authenticated in the affected versions of FreeSWITCH. Abuse of this security issue allows attackers to subscribe to user agent event notifications without the need to authenticate. This abuse poses privacy concerns and might lead to social engineering or similar attacks. For example, attackers may be able to monitor the status of target SIP extensions. Although this issue was fixed in version v1.10.6, installations upgraded to the fixed version of FreeSWITCH from an older version, may still be vulnerable if the configuration is not updated accordingly. Software upgrades do not update the configuration by default. SIP SUBSCRIBE messages should be authenticated by default so that FreeSWITCH administrators do not need to explicitly set the `auth-subscriptions` parameter. When following such a recommendation, a new parameter can be introduced to explicitly disable authentication.", "datePublished": "2021-10-26T13:35:10", "dateUpdated": "2024-08-04T02:59:31", "baseScore": 5.3, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N", "references": ["https://packetstormsecurity.com/files/cve/CVE-2021-41157", "https://github.com/signalwire/freeswitch/security/advisories/GHSA-g7xg-7c54-rmpj", "https://github.com/signalwire/freeswitch/commit/b21dd4e7f3a6f1d5f7be3ea500a319a5bc11db9e", "https://github.com/signalwire/freeswitch/releases/tag/v1.10.6", "http://seclists.org/fulldisclosure/2021/Oct/41"], "aliases": ["CVE-2021-41157"], "assigner": "GitHub_M", "epss": 0.34, "enisaIdProduct": [{"id": "387cf1b7-ae53-3206-b60b-d3f6c44dc7c2", "product": {"name": "freeswitch"}, "product_version": "< 1.10.6"}], "enisaIdVendor": [{"id": "78bc4e46-b859-3b9e-93e9-1611c2f184c4", "vendor": {"name": "signalwire"}}], "isExploited": false}