{"id": "EUVD-2021-16058", "enisaUuid": "d7f3a6b6-03d3-3c9b-afe3-57b406814a27", "description": "In Gradle from version 5.1 and before version 7.0 there is a vulnerability which can lead to information disclosure and/or dependency poisoning. Repository content filtering is a security control Gradle introduced to help users specify what repositories are used to resolve specific dependencies. This feature was introduced in the wake of the \"A Confusing Dependency\" blog post. In some cases, Gradle may ignore content filters and search all repositories for dependencies. This only occurs when repository content filtering is used from within a `pluginManagement` block in a settings file. This may change how dependencies are resolved for Gradle plugins and build scripts. For builds that are vulnerable, there are two risks: 1) Information disclosure: Gradle could make dependency requests to repositories outside your organization and leak internal package identifiers. 2) Dependency poisoning/Dependency confusion: Gradle could download a malicious binary from a repository outside your organization due to name squatting. For a full example and more details refer to the referenced GitHub Security Advisory. The problem has been patched and released with Gradle 7.0. Users relying on this feature should upgrade their build as soon as possible. As a workaround, users may use a company repository which has the right rules for fetching packages from public repositories, or use project level repository content filtering, inside `buildscript.repositories`. This option is available since Gradle 5.1 when the feature was introduced.", "datePublished": "2021-04-13T17:55:24", "dateUpdated": "2024-08-03T22:02:51", "baseScore": 8.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:H/UI:N/S:C/C:H/I:H/A:H", "references": ["https://www.suse.com/security/cve/CVE-2021-29427.html", "https://security.archlinux.org/CVE-2021-29427", "https://access.redhat.com/errata/RHSA-2022:4623", "https://docs.gradle.org/7.0/release-notes.html#security-advisories", "https://github.com/gradle/gradle/security/advisories/GHSA-jvmj-rh6q-x395"], "aliases": ["CVE-2021-29427"], "assigner": "GitHub_M", "epss": 0.56, "enisaIdProduct": [{"id": "8fa012e2-dea4-32bf-825d-51ff95644f21", "product": {"name": "gradle"}, "product_version": "5.1, ≤ 6.8.3"}], "enisaIdVendor": [{"id": "9d8bcc6e-0d81-32d1-8e76-a56ea1da64e1", "vendor": {"name": "gradle"}}], "isExploited": false}