{"id": "EUVD-2021-16060", "enisaUuid": "0d984efb-0213-3c9e-9bde-f1071f29e17b", "description": "In Gradle before version 7.0, files created with open permissions in the system temporary directory can allow an attacker to access information downloaded by Gradle. Some builds could be vulnerable to a local information disclosure. Remote files accessed through TextResourceFactory are downloaded into the system temporary directory first. Sensitive information contained in these files can be exposed to other local users on the same system. If you do not use the `TextResourceFactory` API, you are not vulnerable. As of Gradle 7.0, uses of the system temporary directory have been moved to the Gradle User Home directory. By default, this directory is restricted to the user running the build. As a workaround, set a more restrictive umask that removes read access to other users. When files are created in the system temporary directory, they will not be accessible to other users. If you are unable to change your system's umask, you can move the Java temporary directory by setting the System Property `java.io.tmpdir`. The new path needs to limit permissions to the build user only.", "datePublished": "2021-04-12T21:30:12", "dateUpdated": "2024-08-03T22:02:51", "baseScore": 4.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N", "references": ["https://www.suse.com/security/cve/CVE-2021-29429.html", "https://access.redhat.com/errata/RHSA-2021:4767", "https://security.archlinux.org/CVE-2021-29429", "https://access.redhat.com/errata/RHSA-2022:4623", "https://github.com/gradle/gradle/security/advisories/GHSA-fp8h-qmr5-j4c8", "https://docs.gradle.org/7.0/release-notes.html#security-advisories"], "aliases": ["CVE-2021-29429"], "assigner": "GitHub_M", "epss": 0.04, "enisaIdProduct": [{"id": "01faa51e-09ce-3dee-8d1a-d6dce457af52", "product": {"name": "gradle"}, "product_version": "< 7.0"}], "enisaIdVendor": [{"id": "87402a12-619d-3588-93cd-d9e6e4a5e031", "vendor": {"name": "gradle"}}], "isExploited": false}