{"id": "EUVD-2025-206259", "enisaUuid": "f600021e-3a58-3680-a454-07ad8f0efa07", "description": "The Report Builder component of the application stores user input directly in a web page and displays it to other users, which raised concerns about a possible Cross-Site Scripting (XSS) attack. Proper management of this functionality helps ensure a secure and seamless user experience.  Although the user input is not validated in the report creation, these scripts are not executed when the report is run by end users. The script is executed when the report is modified through the report builder by a user with edit permissions. \n\n\n\n\nThe Report Builder is part of the WebConsole.  The WebConsole package is currently end of life, and is no longer maintained. We strongly recommend against installing or using it in any production environment. However, if you choose to install it, for example, to access functionality like the Report Builder, it must be deployed within a fully isolated network that has no access to sensitive data or internet connectivity. This is a critical security precaution, as the retired package may contain unpatched vulnerabilities and is no longer supported with updates or fixes.", "datePublished": "2026-01-08T00:31:12", "dateUpdated": "2026-01-08T00:31:12", "baseScore": 1.8, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:P/PR:H/UI:A/VC:L/VI:L/VA:N/SC:N/SI:N/SA:N", "references": ["https://documentation.commvault.com/securityadvisories/CV_2025_06_3.html", "https://nvd.nist.gov/vuln/detail/CVE-2025-12776"], "aliases": ["CVE-2025-12776"], "assigner": "Commvault", "epss": 0.05, "enisaIdProduct": [{"id": "828a5c43-c299-3633-ae84-4bb366a3b162", "product": {"name": "WebConsole"}, "product_version": "11.32.0 ≤11.32.*"}, {"id": "a8bba48d-0e2e-3386-a6ca-b6b8fa4480b2", "product": {"name": "WebConsole"}, "product_version": ""}, {"id": "f9856842-c3de-359b-9a20-9ae3dc5840ac", "product": {"name": "WebConsole"}, "product_version": "11.36.0 ≤11.36.*"}], "enisaIdVendor": [{"id": "657cfe6c-02b8-3d4e-90e5-666df365d9d0", "vendor": {"name": "Commvault"}}], "isExploited": false}