{"id": "EUVD-2025-5088", "enisaUuid": "a69e37b0-cbe5-3aa3-9e0c-28ee6029bcc2", "description": "OpenH264 is a free license codec library which supports H.264 encoding and decoding. A vulnerability in the decoding functions of OpenH264 codec library could allow a remote, unauthenticated attacker to trigger a heap overflow. This vulnerability is due to a race condition between a Sequence Parameter Set (SPS) memory allocation and a subsequent non Instantaneous Decoder Refresh (non-IDR) Network Abstraction Layer (NAL) unit memory usage. An attacker could exploit this vulnerability by crafting a malicious bitstream and tricking a victim user into processing an arbitrary video containing the malicious bistream. An exploit could allow the attacker to cause an unexpected crash in the victim's user decoding client and, possibly, perform arbitrary commands on the victim's host by abusing the heap overflow. This vulnerability affects OpenH264 2.5.0 and earlier releases. Both Scalable Video Coding (SVC) mode and Advanced Video Coding (AVC) mode are affected by this vulnerability. OpenH264 software releases 2.6.0 and later contained the fix for this vulnerability. Users are advised to upgrade. There are no known workarounds for this vulnerability.\n\n### For more information\n\nIf you have any questions or comments about this advisory:\n* [Open an issue in cisco/openh264](https://github.com/cisco/openh264/issues)\n* Email Cisco Open Source Security ([oss-security@cisco.com](mailto:oss-security@cisco.com)) and Cisco PSIRT ([psirt@cisco.com](mailto:psirt@cisco.com))\n\n### Credits:\n\n* **Research:** Octavian Guzu and Andrew Calvano of Meta\n* **Fix ideation:** Philipp Hancke and Shyam Sadhwani of Meta\n* **Fix implementation:** Benzheng Zhang (@BenzhengZhang)\n* **Release engineering:** Benzheng Zhang (@BenzhengZhang)", "datePublished": "2025-02-20T17:50:03", "dateUpdated": "2025-02-20T18:40:39", "baseScore": 8.6, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N", "references": ["https://github.com/cisco/openh264/security/advisories/GHSA-m99q-5j7x-7m9x", "https://github.com/cisco/openh264/releases/tag/v2.6.0"], "aliases": ["CVE-2025-27091"], "assigner": "GitHub_M", "epss": 0.37, "enisaIdProduct": [{"id": "356714b6-b4cf-395e-b2ae-22f99257fa3e", "product": {"name": "openh264"}, "product_version": "< 2.6.0"}], "enisaIdVendor": [{"id": "4642303e-577c-3ea9-a058-c3a39e63f5ed", "vendor": {"name": "Cisco"}}], "isExploited": false}