{"id": "EUVD-2025-205645", "enisaUuid": "3295b27f-e133-3de0-aa54-cd75d99a9bf6", "description": "Axios Cache Interceptor is a cache interceptor for axios. Prior to version 1.11.1, when a server calls an upstream service using different auth tokens, axios-cache-interceptor returns incorrect cached responses, leading to authorization bypass. The cache key is generated only from the URL, ignoring request headers like `Authorization`. When the server responds with `Vary: Authorization` (indicating the response varies by auth token), the library ignores this, causing all requests to share the same cache regardless of authorization. Server-side applications (APIs, proxies, backend services) that use axios-cache-interceptor to cache requests to upstream services, handle requests from multiple users with different auth tokens, and upstream services replies on `Vary` to differentiate caches are affected. Browser/client-side applications (single user per browser session) are not affected. Services using different auth tokens to call upstream services will return incorrect cached data, bypassing authorization checks and leaking user data across different authenticated sessions. After `v1.11.1`, automatic `Vary` header support is now enabled by default. When server responds with `Vary: Authorization`, cache keys now include the authorization header value. Each user gets their own cache.", "datePublished": "2025-12-29T19:13:27", "dateUpdated": "2025-12-30T22:25:39", "baseScore": 6.0, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:H/AT:P/PR:L/UI:N/VC:H/VI:N/VA:N/SC:L/SI:L/SA:N", "references": ["https://github.com/arthurfiorette/axios-cache-interceptor/security/advisories/GHSA-x4m5-4cw8-vc44", "https://github.com/arthurfiorette/axios-cache-interceptor/commit/49a808059dfc081b9cc23d48f243d55dfce15f01", "https://nvd.nist.gov/vuln/detail/CVE-2025-69202"], "aliases": ["CVE-2025-69202"], "assigner": "GitHub_M", "epss": 0.04, "enisaIdProduct": [{"id": "6ca4dd59-0871-3a78-8c57-faa94a529666", "product": {"name": "axios-cache-interceptor"}, "product_version": "< 1.11.1"}], "enisaIdVendor": [{"id": "e0570c76-dab7-3d0c-bee3-9b84c546e367", "vendor": {"name": "arthurfiorette"}}], "isExploited": false}