{"id": "EUVD-2025-21169", "enisaUuid": "45c381de-0c05-343d-8ba0-07c4b659b148", "description": "immich is a high performance self-hosted photo and video management solution. Prior to 1.132.0, immich is vulnerable to account hijacking through oauth2, because the state parameter is not being checked. The oauth2 state parameter is similar to a csrf token, so when the user starts the login flow this unpredictable token is generated and somehow saved in the browser session and passed to the identity provider, which will return the state parameter when redirecting the user back to immich. Before the user is logged in that parameter needs to be verified to make sure the login was actively initiated by the user in this browser session. On it's own, this wouldn't be too bad, but when immich uses the /user-settings page as a redirect_uri, it will automatically link the accounts if the user was already logged in. This means that if someone has an immich instance with a public oauth provider (like google), an attacker can - for example - embed a hidden iframe in a webpage or even just send the victim a forged oauth login url with a code that logs the victim into the attackers oauth account and redirects back to immich and links the accounts. After this, the attacker can log into the victims account using their own oauth credentials. This vulnerability is fixed in 1.132.0.", "datePublished": "2025-07-11T17:10:52", "dateUpdated": "2025-07-11T18:13:00", "baseScore": 7.3, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:P/PR:L/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N", "references": ["https://github.com/immich-app/immich/security/advisories/GHSA-3832-6r8h-9cfm"], "aliases": ["CVE-2025-43856"], "assigner": "GitHub_M", "epss": 0.06, "enisaIdProduct": [{"id": "bef59cda-feb4-3357-b115-f66f31058519", "product": {"name": "immich"}, "product_version": "< 1.132.0"}], "enisaIdVendor": [{"id": "ce92a0da-af54-3e0d-a8ef-175d50d66cf1", "vendor": {"name": "immich-app"}}], "isExploited": false}