{"id": "EUVD-2025-8204", "enisaUuid": "0a1444c8-27a4-394e-8b07-51b928b24098", "description": "Icinga Director is an Icinga config deployment tool. A Security vulnerability has been found starting in version 1.0.0 and prior to 1.10.3 and 1.11.3 on several director endpoints of REST API. To reproduce this vulnerability an authenticated user with permission to access the Director is required (plus api access with regard to the api endpoints). And even though some of these Icinga Director users are restricted from accessing certain objects, are able to retrieve information related to them if their name is known. This makes it possible to change the configuration of these objects by those Icinga Director users restricted from accessing them. This results in further exploitation, data breaches and sensitive information disclosure. Affected endpoints include icingaweb2/director/service, if the host name is left out of the query; icingaweb2/directore/notification; icingaweb2/director/serviceset; and icingaweb2/director/scheduled-downtime. In addition, the endpoint `icingaweb2/director/services?host=filteredHostName` returns a status code 200 even though the services for the host is filtered. This in turn lets the restricted user know that the host `filteredHostName` exists even though the user is restricted from accessing it.  This could again result in further exploitation of this information and data breaches. Icinga Director has patches in versions 1.10.3 and 1.11.1. If upgrading is not feasible, disable the director module for the users other than admin role for the time being.", "datePublished": "2025-03-26T13:44:58", "dateUpdated": "2025-05-02T16:02:38", "baseScore": 5.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:L/A:N", "references": ["https://github.com/Icinga/icingaweb2-module-director/security/advisories/GHSA-3233-ggc5-m3qg", "https://github.com/Icinga/icingaweb2-module-director/releases/tag/v1.10.3", "https://github.com/Icinga/icingaweb2-module-director/releases/tag/v1.11.3"], "aliases": ["CVE-2025-23203"], "assigner": "GitHub_M", "epss": 0.1, "enisaIdProduct": [{"id": "5656934b-8ba0-315a-beb7-888e02c52c5c", "product": {"name": "icingaweb2-module-director"}, "product_version": "1.11.0, < 1.11.3"}, {"id": "6efbbe3e-197f-3c2f-85fe-fe9cb826b97d", "product": {"name": "icingaweb2-module-director"}, "product_version": "1.0.0, < 1.10.3"}], "enisaIdVendor": [{"id": "ff92b634-abd6-3be5-a2a5-ac0205c73488", "vendor": {"name": "Icinga"}}], "isExploited": false}