{"id": "EUVD-2025-205226", "enisaUuid": "e885fe27-8092-3235-9edd-06b969169183", "description": "In the Linux kernel, the following vulnerability has been resolved:\n\nlandlock: Fix handling of disconnected directories\n\nDisconnected files or directories can appear when they are visible and\nopened from a bind mount, but have been renamed or moved from the source\nof the bind mount in a way that makes them inaccessible from the mount\npoint (i.e. out of scope).\n\nPreviously, access rights tied to files or directories opened through a\ndisconnected directory were collected by walking the related hierarchy\ndown to the root of the filesystem, without taking into account the\nmount point because it couldn't be found. This could lead to\ninconsistent access results, potential access right widening, and\nhard-to-debug renames, especially since such paths cannot be printed.\n\nFor a sandboxed task to create a disconnected directory, it needs to\nhave write access (i.e. FS_MAKE_REG, FS_REMOVE_FILE, and FS_REFER) to\nthe underlying source of the bind mount, and read access to the related\nmount point.   Because a sandboxed task cannot acquire more access\nrights than those defined by its Landlock domain, this could lead to\ninconsistent access rights due to missing permissions that should be\ninherited from the mount point hierarchy, while inheriting permissions\nfrom the filesystem hierarchy hidden by this mount point instead.\n\nLandlock now handles files and directories opened from disconnected\ndirectories by taking into account the filesystem hierarchy when the\nmount point is not found in the hierarchy walk, and also always taking\ninto account the mount point from which these disconnected directories\nwere opened.  This ensures that a rename is not allowed if it would\nwiden access rights [1].\n\nThe rationale is that, even if disconnected hierarchies might not be\nvisible or accessible to a sandboxed task, relying on the collected\naccess rights from them improves the guarantee that access rights will\nnot be widened during a rename because of the access right comparison\nbetween the source and the destination (see LANDLOCK_ACCESS_FS_REFER).\nIt may look like this would grant more access on disconnected files and\ndirectories, but the security policies are always enforced for all the\nevaluated hierarchies.  This new behavior should be less surprising to\nusers and safer from an access control perspective.\n\nRemove a wrong WARN_ON_ONCE() canary in collect_domain_accesses() and\nfix the related comment.\n\nBecause opened files have their access rights stored in the related file\nsecurity properties, there is no impact for disconnected or unlinked\nfiles.", "datePublished": "2025-12-24T15:30:43", "dateUpdated": "2025-12-24T15:30:43", "baseScore": 0.0, "references": ["https://git.kernel.org/stable/c/cadb28f8b3fd6908e3051e86158c65c3a8e1c907", "https://git.kernel.org/stable/c/49c9e09d961025b22e61ef9ad56aa1c21b6ce2f1", "https://nvd.nist.gov/vuln/detail/CVE-2025-68736"], "aliases": ["CVE-2025-68736"], "assigner": "Linux", "epss": 0.02, "enisaIdProduct": [{"id": "046f3323-33a3-31ea-b0dc-db4ba8ff9675", "product": {"name": "Linux"}, "product_version": "patch: 6.18.2"}, {"id": "14fa9373-c1e9-3cb3-a25a-8d19944c5d0a", "product": {"name": "Linux"}, "product_version": "patch: 0"}, {"id": "4ef18f65-ef4e-3cf0-a9f0-ce75f6d4236f", "product": {"name": "Linux"}, "product_version": "patch: 6.19-rc1"}, {"id": "75bcca17-0486-30ed-bb0b-ac9bdfa58f1f", "product": {"name": "Linux"}, "product_version": "cb2c7d1a1776057c9a1f48ed1250d85e94d4850d <cadb28f8b3fd6908e3051e86158c65c3a8e1c907"}, {"id": "846d969c-55fb-3f9f-97a1-e3274d038bf3", "product": {"name": "Linux"}, "product_version": "5.13"}, {"id": "fdc8b1d1-1bd3-3450-8c30-a379b4f9adee", "product": {"name": "Linux"}, "product_version": "cb2c7d1a1776057c9a1f48ed1250d85e94d4850d <49c9e09d961025b22e61ef9ad56aa1c21b6ce2f1"}], "enisaIdVendor": [{"id": "227de9b3-2d05-36e7-b931-83ecd7bef8a0", "vendor": {"name": "Linux"}}], "isExploited": false}