{"id": "EUVD-2025-27471", "enisaUuid": "b5ad226e-04b5-35ee-bbc5-7162d6fc0b4d", "description": "Tautulli is a Python based monitoring and tracking tool for Plex Media Server. The `real_pms_image_proxy` endpoint in Tautulli v2.15.3 and prior is vulnerable to path traversal, allowing unauthenticated attackers to read arbitrary files from the application server's filesystem. The `real_pms_image_proxy` is used to fetch an image directly from the backing Plex Media Server. The image to be fetched is specified through an `img` URL parameter, which can either be a URL or a file path. There is some validation ensuring that `img` begins with the prefix `interfaces/default/images` in order to be served from the local filesystem. However this can be bypassed by passing an `img` parameter which begins with a valid prefix, and then adjoining path traversal characters in order to reach files outside of intended directories. An attacker can exfiltrate files on the application file system, including the `tautulli.db` SQLite database containing active JWT tokens, as well as the `config.ini` file which contains the hashed admin password, the JWT token secret, and the Plex Media Server token and connection details. If the password is cracked, or if a valid JWT token is present in the database, an unauthenticated attacker can escalate their privileges to obtain administrative control over the application. Version 2.16.0 contains a fix for the issue.", "datePublished": "2025-09-09T19:59:17", "dateUpdated": "2025-09-10T13:47:59", "baseScore": 8.6, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N", "references": ["https://github.com/Tautulli/Tautulli/security/advisories/GHSA-r732-m675-wj7w", "https://github.com/Tautulli/Tautulli/commit/ec77a70aafc555e1aad0d9981f719d1200c117f1"], "aliases": ["CVE-2025-58761"], "assigner": "GitHub_M", "epss": 0.14, "enisaIdProduct": [{"id": "b74bb7b8-869a-3752-81c6-fada44e95775", "product": {"name": "Tautulli"}, "product_version": "< 2.16.0"}], "enisaIdVendor": [{"id": "2202a122-52d9-38ed-b2d5-25247ecb3b3c", "vendor": {"name": "Tautulli"}}], "isExploited": false}