{"id": "EUVD-2025-150364", "enisaUuid": "fe49607b-6960-3473-a00d-df806e362e52", "description": "sudo-rs is a memory safe implementation of sudo and su written in Rust. With `Defaults targetpw` (or `Defaults rootpw`) enabled,  the password of the target account (or root account) instead of the invoking user is used for authentication. sudo-rs starting in version 0.2.5 and prior to version 0.2.10 incorrectly recorded the invoking user’s UID instead of the authenticated-as user's UID in the authentication timestamp. Any later `sudo` invocation on the same terminal while the timestamp was still valid would use that timestamp, potentially bypassing new authentication even if the policy would have required it. A highly-privileged user (able to run commands as other users, or as root, through sudo) who knows one password of an account they are allowed to run commands as, would be able to run commands as any other account the policy permits them to run commands for, even if they don't know the password for those accounts. A common instance of this would be that a user can still use their own password to run commands as root (the default behaviour of `sudo`), effectively negating the intended behaviour of the `targetpw` or `rootpw` options. Version 0.2.10 contains a patch for the issue. Versions prior to 0.2.5 are not affected, since they do not offer `Defaults targetpw` or `Defaults rootpw`.", "datePublished": "2025-11-12T22:08:29", "dateUpdated": "2025-11-13T15:40:14", "baseScore": 4.4, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:H/UI:N/S:U/C:N/I:H/A:N", "references": ["https://github.com/trifectatechfoundation/sudo-rs/security/advisories/GHSA-q428-6v73-fc4q", "https://github.com/trifectatechfoundation/sudo-rs/releases/tag/v0.2.10", "https://nvd.nist.gov/vuln/detail/CVE-2025-64517", "https://github.com/trifectatechfoundation/sudo-rs/commit/8423fd986c3fa58b357f238c0db5e54baca5255d"], "aliases": ["CVE-2025-64517"], "assigner": "GitHub_M", "epss": 0.02, "enisaIdProduct": [{"id": "feb7a79b-2a64-3590-a8cd-2ea2573be002", "product": {"name": "sudo-rs"}, "product_version": "0.2.5, < 0.2.10"}], "enisaIdVendor": [{"id": "b1a9c986-291f-38fb-ab0b-3943f51419a1", "vendor": {"name": "trifectatechfoundation"}}], "isExploited": false}