{"id": "EUVD-2025-27571", "enisaUuid": "505fbf30-8921-3b07-90f7-2afb5c029ee0", "description": "Stalwart is a mail and collaboration server. Starting in version 0.12.0 and prior to version 0.13.3, a memory exhaustion vulnerability exists in Stalwart's CalDAV implementation that allows authenticated attackers to cause denial-of-service by triggering unbounded memory consumption through recurring event expansion. An authenticated attacker can crash the Stalwart server by creating recurring events with large payloads and triggering their expansion through CalDAV REPORT requests. A single malicious request expanding 300 events with 1000-character descriptions can consume up to 2 GB of memory. The vulnerability exists in the `ArchivedCalendarEventData.expand` function, which processes CalDAV `REPORT` requests with event expansion. When a client requests recurring events in their expanded form using the `<C:expand>` element, the server stores all expanded event instances in memory without enforcing size limits. Users should upgrade to Stalwart version 0.13.3 or later to receive a fix. If immediate upgrading is not possible, implement memory limits at the container/system level; monitor server memory usage for unusual spikes; consider rate limiting CalDAV REPORT requests; and restrict CalDAV access to trusted users only.", "datePublished": "2025-09-10T16:09:49", "dateUpdated": "2025-09-11T13:28:45", "baseScore": 7.1, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:N/VI:N/VA:H/SC:N/SI:N/SA:N", "references": ["https://github.com/stalwartlabs/stalwart/security/advisories/GHSA-xv4r-q6gr-6pfg", "https://github.com/stalwartlabs/stalwart/commit/15762fba2ba335e560b8d25f71af085a8b6b6cf2", "https://github.com/stalwartlabs/stalwart/blob/main/CHANGELOG.md", "https://github.com/stalwartlabs/stalwart/releases/tag/v0.13.3", "https://tools.ietf.org/html/rfc4791"], "aliases": ["CVE-2025-59045"], "assigner": "GitHub_M", "epss": 0.07, "enisaIdProduct": [{"id": "b880c47c-6d09-3ff7-bbfe-93440668c508", "product": {"name": "stalwart"}, "product_version": "0.12.0, < 0.13.3"}], "enisaIdVendor": [{"id": "4b69f7ea-0970-30fb-9051-ddfc73a45359", "vendor": {"name": "stalwartlabs"}}], "isExploited": false}