{"id": "EUVD-2025-4107", "enisaUuid": "c5d03f06-6e35-3bc0-8a37-d7cda47696ff", "description": "Label Studio is an open source data labeling tool. Prior to version 1.16.0, Label Studio's S3 storage integration feature contains a Server-Side Request Forgery (SSRF) vulnerability in its endpoint configuration. When creating an S3 storage connection, the application allows users to specify a custom S3 endpoint URL via the s3_endpoint parameter. This endpoint URL is passed directly to the boto3 AWS SDK without proper validation or restrictions on the protocol or destination. The vulnerability allows an attacker to make the application send HTTP requests to arbitrary internal services by specifying them as the S3 endpoint. When the storage sync operation is triggered, the application attempts to make S3 API calls to the specified endpoint, effectively making HTTP requests to the target service and returning the response in error messages. This SSRF vulnerability enables attackers to bypass network segmentation and access internal services that should not be accessible from the external network. The vulnerability is particularly severe because error messages from failed requests contain the full response body, allowing data exfiltration from internal services. Version 1.16.0 contains a patch for the issue.", "datePublished": "2025-02-14T19:25:50", "dateUpdated": "2025-02-14T19:56:41", "baseScore": 8.6, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:C/C:H/I:N/A:N", "references": ["https://github.com/HumanSignal/label-studio/security/advisories/GHSA-m238-fmcw-wh58", "https://github.com/HumanSignal/label-studio/commit/06a2b29c1208e1878ccae66e6b84c8b24598fa79", "https://nvd.nist.gov/vuln/detail/CVE-2025-25297"], "aliases": ["CVE-2025-25297"], "assigner": "GitHub_M", "epss": 0.16, "enisaIdProduct": [{"id": "81ca21cb-fa92-390a-87cd-e0d5df3fa4ba", "product": {"name": "label-studio"}, "product_version": "< 1.16.0"}], "enisaIdVendor": [{"id": "ef92859b-39e3-3ebb-a37c-46daa6a65b36", "vendor": {"name": "HumanSignal"}}], "isExploited": false}