{"id": "EUVD-2025-13881", "enisaUuid": "1191e5fc-ec1a-3025-8b43-5cec21c676ca", "description": "Besu Native contains scripts and tooling that is used to build and package the native libraries used by the Ethereum client Hyperledger Besu. Besu 24.7.1 through 25.2.2, corresponding to besu-native versions 0.9.0 through 1.2.1, have a potential consensus bug for the precompiles ALTBN128_ADD (0x06), ALTBN128_MUL (0x07), and ALTBN128_PAIRING (0x08). These precompiles were reimplemented in besu-native using gnark-crypto's bn254 implementation, as the former implementation used a library which was no longer maintained and not sufficiently performant. The new gnark implementation was initially added in version 0.9.0 of besu-native but was not utilized by Besu until version 0.9.2 in Besu 24.7.1. The issue is that there are EC points which may be crafted which are in the correct subgroup but are not on the curve and the besu-native gnark implementation was relying on subgroup checks to perform point-on-curve checks as well. The version of gnark-crypto used at the time did not do this check when performing subgroup checks. The result is that it was possible for Besu to give an incorrect result and fall out of consensus when executing one of these precompiles against a specially crafted input point. Additionally, homogenous Besu-only networks can potentially enshrine invalid state which would be incorrect and difficult to process with patched versions of besu which handle these calls correctly. The underlying defect has been patched in besu-native release 1.3.0. The fixed version of Besu is version 25.3.0. As a workaround for versions of Besu with the problem, the native precompile for altbn128 may be disabled in favor of the pure-java implementation. The pure java implementation is significantly slower, but does not have this consensus issue.", "datePublished": "2025-05-07T18:27:41", "dateUpdated": "2025-05-07T20:04:15", "baseScore": 8.7, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:H/VA:N/SC:N/SI:N/SA:N", "references": ["https://github.com/hyperledger/besu-native/security/advisories/GHSA-jcp8-gh74-97hq", "https://github.com/hyperledger/besu/blob/main/besu/src/main/java/org/hyperledger/besu/cli/options/NativeLibraryOptions.java#L31-L38"], "aliases": ["CVE-2025-30147"], "assigner": "GitHub_M", "epss": 0.03, "enisaIdProduct": [{"id": "85c29181-9f57-3113-8300-e49d30ae07ac", "product": {"name": "besu-native"}, "product_version": "0.9.0, < 1.3.0"}], "enisaIdVendor": [{"id": "136ab7d5-f53a-3020-a4aa-44f1a5c441ad", "vendor": {"name": "Hyperledger"}}], "isExploited": false}