{"id": "EUVD-2025-5110", "enisaUuid": "b1c84ea4-e4ad-315b-a028-6f94de6c3d7f", "description": "The ZOO-Project is an open source processing platform, released under MIT/X11 Licence. A vulnerability in ZOO-Project's WPS (Web Processing Service) implementation allows unauthorized access to files outside the intended directory through path traversal. Specifically, the Gdal_Translate service, when processing VRT (Virtual Format) files, does not properly validate file paths referenced in the VRTRasterBand element, allowing attackers to read arbitrary files on the system. The vulnerability exists because the service doesn't properly sanitize the SourceFilename parameter in VRT files, allowing relative path traversal sequences (../). When combined with VRT's raw data handling capabilities, this allows reading arbitrary files as raw binary data and converting them to TIFF format, effectively exposing their contents. This vulnerability is particularly severe because it allows attackers to read sensitive system files, potentially exposing configuration data, credentials, or other confidential information stored on the server. An unauthenticated attacker can read arbitrary files from the system through path traversal, potentially accessing sensitive information such as configuration files, credentials, or other confidential data stored on the server. The vulnerability requires no authentication and can be exploited remotely through the WPS service. This issue has been addressed in commit `5f155a8` and all users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2025-02-18T18:42:55", "dateUpdated": "2025-02-18T19:29:53", "baseScore": 8.7, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N", "references": ["https://github.com/ZOO-Project/ZOO-Project/security/advisories/GHSA-8c27-wmvv-3p38", "https://github.com/ZOO-Project/ZOO-Project/commit/5f155a8"], "aliases": ["CVE-2025-25284"], "assigner": "GitHub_M", "epss": 0.89, "enisaIdProduct": [{"id": "184ce85a-9467-3f24-b9c8-6e614cc7e26a", "product": {"name": "ZOO-Project"}, "product_version": "Commits before 5f155a8"}], "enisaIdVendor": [{"id": "698a7645-a914-365c-8800-7259633da215", "vendor": {"name": "ZOO-Project"}}], "isExploited": false}