{"id": "EUVD-2025-0013", "enisaUuid": "950d64c4-744f-3324-a264-f921ab064334", "description": "Next.js is a React framework for building full-stack web applications. Starting in version 13.0.0 and prior to versions 13.5.8, 14.2.21, and 15.1.2, Next.js is vulnerable to a Denial of Service (DoS) attack that allows attackers to construct requests that leaves requests to Server Actions hanging until the hosting provider cancels the function execution. This vulnerability can also be used as a Denial of Wallet (DoW) attack when deployed in providers billing by response times. (Note: Next.js server is idle during that time and only keeps the connection open. CPU and memory footprint are low during that time.). Deployments without any protection against long running Server Action invocations are especially vulnerable. Hosting providers like Vercel or Netlify set a default maximum duration on function execution to reduce the risk of excessive billing. This is the same issue as if the incoming HTTP request has an invalid `Content-Length` header or never closes. If the host has no other mitigations to those then this vulnerability is novel. This vulnerability affects only Next.js deployments using Server Actions. The issue was resolved in Next.js 13.5.8, 14.2.21, and 15.1.2. We recommend that users upgrade to a safe version. There are no official workarounds.", "datePublished": "2025-01-03T20:19:11", "dateUpdated": "2025-01-03T20:51:02", "baseScore": 5.3, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L", "references": ["https://github.com/vercel/next.js/security/advisories/GHSA-7m27-7ghc-44w9", "https://nvd.nist.gov/vuln/detail/CVE-2024-56332", "https://github.com/vercel/next.js"], "aliases": ["CVE-2024-56332", "GHSA-7m27-7ghc-44w9"], "assigner": "GitHub_M", "epss": 0.73, "enisaIdProduct": [{"id": "3c57f6cc-d71b-34bc-a340-732485db14a3", "product": {"name": "next.js"}, "product_version": "15.0.0, < 15.1.2"}, {"id": "b854598f-9a8f-3881-9bdb-c2cfb7f9d50a", "product": {"name": "next.js"}, "product_version": "14.0.0, < 14.2.21"}, {"id": "d6006a5b-da84-3cde-806d-c195fa30a8be", "product": {"name": "next.js"}, "product_version": "13.0.0, < 13.5.8"}], "enisaIdVendor": [{"id": "b9945d2d-30a9-38ac-9a33-4cbe88d3e843", "vendor": {"name": "vercel"}}], "isExploited": false}