{"id": "EUVD-2025-4105", "enisaUuid": "b81ba0d1-bde8-3fd7-89d8-470cfe0a3454", "description": "Label Studio is an open source data labeling tool. A path traversal vulnerability in Label Studio SDK versions prior to 1.0.10 allows unauthorized file access outside the intended directory structure. The flaw exists in the VOC, COCO and YOLO export functionalities. These functions invoke a `download` function on the `label-studio-sdk` python package, which fails to validate file paths when processing image references during task exports. By creating tasks with path traversal sequences in the image field, an attacker can force the application to read files from arbitrary server filesystem locations when exporting projects in any of the mentioned formats. This is authentication-required vulnerability allowing arbitrary file reads from the server filesystem. It may lead to potential exposure of sensitive information like configuration files, credentials, and confidential data. Label Studio versions before 1.16.0 specified SDK versions prior to 1.0.10 as dependencies, and the issue was confirmed in Label Studio version 1.13.2.dev0; therefore, Label Studio users should upgrade to 1.16.0 or newer to mitigate it.", "datePublished": "2025-02-14T16:50:26", "dateUpdated": "2025-03-03T17:26:13", "baseScore": 8.7, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N", "references": ["https://github.com/HumanSignal/label-studio/security/advisories/GHSA-rgv9-w7jp-m23g", "https://github.com/HumanSignal/label-studio-sdk/commit/4a9715c6b0b619371e89c09ea8d1c86ce5c880df", "https://nvd.nist.gov/vuln/detail/CVE-2025-25295"], "aliases": ["CVE-2025-25295"], "assigner": "GitHub_M", "epss": 0.24, "enisaIdProduct": [{"id": "0277c7a0-9f65-32c4-9068-53a33e7ab52f", "product": {"name": "label-studio"}, "product_version": "< 1.0.10"}], "enisaIdVendor": [{"id": "56b27366-e30b-3749-bdfe-244a9575e8ea", "vendor": {"name": "HumanSignal"}}], "isExploited": false}