{"id": "EUVD-2025-14755", "enisaUuid": "edad6f3f-b94a-3454-876b-f2f55d1d4797", "description": "AutoGPT is a platform that allows users to create, deploy, and manage continuous artificial intelligence agents that automate complex workflows. Prior to 0.6.1, AutoGPT allows SSRF due to DNS Rebinding in requests wrapper. AutoGPT is built with a wrapper around Python's requests library, hardening the application against SSRF. The code for this wrapper can be found in autogpt_platform/backend/backend/util/request.py. The requested hostname of a URL which is being requested is validated, ensuring that it does not resolve to any local ipv4 or ipv6 addresses. However, this check is not sufficient, as a DNS server may initially respond with a non-blocked address, with a TTL of 0. This means that the initial resolution would appear as a non-blocked address. In this case, validate_url() will return the url as successful. After validate_url() has successfully returned the url, the url is then passed to the real request() function. When the real request() function is called with the validated url, request() will once again resolve the address of the hostname, because the record will not have been cached (due to TTL 0). This resolution may be in the \"invalid range\". This type of attack is called a \"DNS Rebinding Attack\". This vulnerability is fixed in 0.6.1.", "datePublished": "2025-04-14T23:07:25", "dateUpdated": "2025-04-15T03:00:21", "baseScore": 7.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N", "references": ["https://github.com/Significant-Gravitas/AutoGPT/security/advisories/GHSA-wvjg-9879-3m7w", "https://github.com/Significant-Gravitas/AutoGPT/commit/66ebe4376eab3434af90808796b54c2139847b37"], "aliases": ["CVE-2025-31490"], "assigner": "GitHub_M", "epss": 0.07, "enisaIdProduct": [{"id": "0d630643-e820-3f69-a9a4-f6433a542bde", "product": {"name": "AutoGPT"}, "product_version": "< 0.6.1"}], "enisaIdVendor": [{"id": "625b4d24-eaaf-3cf1-abb8-125409c47e76", "vendor": {"name": "Significant-Gravitas"}}], "isExploited": false}