{"id": "EUVD-2025-33585", "enisaUuid": "84175423-e0f0-3279-965d-477d9239799e", "description": "New API is a large language mode (LLM) gateway and artificial intelligence (AI) asset management system. An authenticated Server-Side Request Forgery (SSRF) vulnerability exists in versions prior to 0.9.0.5. A feature within the application allows authenticated users to submit a URL for the server to process its content. The application fails to properly validate this user-supplied URL before making a server-side request. This vulnerability is not limited to image URLs and can be triggered with any link provided to the vulnerable endpoint. Since user registration is often enabled by default, any registered user can exploit this. By crafting a malicious URL, an attacker can coerce the server to send requests to arbitrary internal or external services. The vulnerability has been patched in version 0.9.0.5. The patch introduces a comprehensive, user-configurable SSRF protection module, which is enabled by default to protect server security. This new feature provides administrators with granular control over outbound requests made by the server. For users who cannot upgrade immediately, some temporary mitigation options are available. Enable new-api image processing worker (new-api-worker) and/or configure egress firewall rules.", "datePublished": "2025-10-09T18:58:50", "dateUpdated": "2025-10-09T19:07:40", "baseScore": 8.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:L/A:N", "references": ["https://github.com/QuantumNous/new-api/security/advisories/GHSA-xxv6-m6fx-vfhh", "https://github.com/QuantumNous/new-api/commit/ef634160986c6f6b087cbfe131074fda862928af"], "aliases": ["CVE-2025-59146"], "assigner": "GitHub_M", "epss": 0.04, "enisaIdProduct": [{"id": "b613ee17-de29-38f3-b941-35321130f813", "product": {"name": "new-api"}, "product_version": "< 0.9.0.5"}], "enisaIdVendor": [{"id": "e1021dc3-a0be-3a3c-9b94-425b70fbe81d", "vendor": {"name": "QuantumNous"}}], "isExploited": false}