{"id": "EUVD-2025-4088", "enisaUuid": "13559fbf-0f4b-365a-b04e-6b579a0616ba", "description": "Ash Authentication is an authentication framework for Elixir applications. Applications which have been bootstrapped by the igniter installer present since AshAuthentication v4.1.0 and who have used the magic link strategy _or_ are manually revoking tokens are affected by revoked tokens being allowed to verify as valid. Unless one hase implemented any kind of custom token revocation feature in your application, then one will not be affected. The impact here for users using builtin functionality is that magic link tokens are reusable until they expire. With that said, magic link tokens are only valid for 10 minutes, so the surface area for abuse is extremely low here. The flaw is patched in version 4.4.9. Additionally a compile time warning is shown to users with remediation instructions if they upgrade. 4.4.9 ships with an upgrader, so those who use `mix igniter.upgrade ash_authentication` will have the necessary patch applied. Otherwise, one may run the upgrader manually as described in the error message. As a workaround, delete the generated `:revoked?` generic action in the token resource. This will cause it to use the one internal to Ash Authentication which has always been correct. Alternatively, manually make the changes that are included in the patch.", "datePublished": "2025-02-11T18:28:19", "dateUpdated": "2025-02-12T20:12:08", "baseScore": 6.3, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:H/AT:N/PR:N/UI:N/VC:L/VI:L/VA:N/SC:N/SI:N/SA:N", "references": ["https://github.com/team-alembic/ash_authentication/security/advisories/GHSA-qrm9-f75w-hg4c", "https://github.com/team-alembic/ash_authentication/commit/2dee55252df26fe3d990ff1199397cdcf1bfea8a", "https://nvd.nist.gov/vuln/detail/CVE-2025-25202"], "aliases": ["CVE-2025-25202"], "assigner": "GitHub_M", "epss": 0.08, "enisaIdProduct": [{"id": "286a56ad-9e9d-33c3-be10-3d99527a39a9", "product": {"name": "ash_authentication"}, "product_version": "4.1.0, < 4.4.9"}], "enisaIdVendor": [{"id": "43517a8e-b960-3980-bfd8-b407d56c77ea", "vendor": {"name": "team-alembic"}}], "isExploited": false}