{"id": "EUVD-2025-198054", "enisaUuid": "f2579e53-09b4-3b5c-9d02-9b5fea47d335", "description": "Multiple vulnerabilities exist in cbor2 through version 5.7.0 in the decode_definite_long_string() function of the C extension decoder (source/decoder.c): (1) Integer Underflow Leading to Out-of-Bounds Read (CWE-191, CWE-125): An incorrect variable reference and missing state reset in the chunk processing loop causes buffer_length to not be reset to zero after UTF-8 character consumption. This results in subsequent chunk_length calculations producing negative values (e.g., chunk_length = 65536 - buffer_length), which are passed as signed integers to the read() method, potentially triggering unlimited read operations and resource exhaustion. (2) Memory Leak via Missing Reference Count Release (CWE-401): The main processing loop fails to release Python object references (Py_DECREF) for chunk objects allocated in each iteration. For CBOR strings longer than 65536 bytes, this causes cumulative memory leaks proportional to the payload size, enabling memory exhaustion attacks through repeated processing of large CBOR payloads. Both vulnerabilities can be exploited remotely without authentication by sending specially-crafted CBOR data containing definite-length text strings with multi-byte UTF-8 characters positioned at 65536-byte chunk boundaries. Successful exploitation results in denial of service through process crashes (CBORDecodeEOF exceptions) or memory exhaustion. The vulnerabilities affect all applications using cbor2's C extension to process untrusted CBOR data, including web APIs, IoT data collectors, and message queue processors. Fixed in commit 851473490281f82d82560b2368284ef33cf6e8f9 pushed with released version 5.7.1.", "datePublished": "2025-11-18T00:00:00", "dateUpdated": "2025-11-19T13:55:54", "baseScore": 7.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AC:L/AV:N/A:H/C:N/I:N/PR:N/S:U/UI:N", "references": ["https://nvd.nist.gov/vuln/detail/CVE-2025-64076", "https://github.com/agronholm/cbor2/issues/264", "https://github.com/agronholm/cbor2/pull/265", "https://github.com/agronholm/cbor2/commit/851473490281f82d82560b2368284ef33cf6e8f9"], "aliases": ["CVE-2025-64076", "GHSA-9q9c-vjxh-p795"], "assigner": "mitre", "epss": 0.12, "enisaIdProduct": [{"id": "51f5e4cc-9b42-3e95-b237-b15f4f57db24", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "915e95b9-6f5a-3a89-9854-93e845b57376", "vendor": {"name": "n/a"}}], "isExploited": false}