{"id": "EUVD-2025-204618", "enisaUuid": "b0de3042-42a2-33e1-92f6-3abd63598761", "description": "n8n is an open source workflow automation platform. Versions starting with 0.211.0 and prior to 1.120.4, 1.121.1, and 1.122.0 contain a critical Remote Code Execution (RCE) vulnerability in their workflow expression evaluation system. Under certain conditions, expressions supplied by authenticated users during workflow configuration may be evaluated in an execution context that is not sufficiently isolated from the underlying runtime. An authenticated attacker could abuse this behavior to execute arbitrary code with the privileges of the n8n process. Successful exploitation may lead to full compromise of the affected instance, including unauthorized access to sensitive data, modification of workflows, and execution of system-level operations. This issue has been fixed in versions 1.120.4, 1.121.1, and 1.122.0. Users are strongly advised to upgrade to a patched version, which introduces additional safeguards to restrict expression evaluation. If upgrading is not immediately possible, administrators should consider the following temporary mitigations: Limit workflow creation and editing permissions to fully trusted users only; and/or deploy n8n in a hardened environment with restricted operating system privileges and network access to reduce the impact of potential exploitation. These workarounds do not fully eliminate the risk and should only be used as short-term measures.", "datePublished": "2025-12-19T22:23:47", "dateUpdated": "2025-12-22T15:06:07", "baseScore": 10.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H", "references": ["https://github.com/n8n-io/n8n/security/advisories/GHSA-v98v-ff95-f3cp", "https://github.com/n8n-io/n8n/commit/08f332015153decdda3c37ad4fcb9f7ba13a7c79", "https://github.com/n8n-io/n8n/commit/1c933358acef527ff61466e53268b41a04be1000", "https://github.com/n8n-io/n8n/commit/39a2d1d60edde89674ca96dcbb3eb076ffff6316", "https://nvd.nist.gov/vuln/detail/CVE-2025-68613"], "aliases": ["CVE-2025-68613"], "assigner": "GitHub_M", "epss": 8.42, "enisaIdProduct": [{"id": "356581f1-21f2-32a1-951e-62b7bd4a760f", "product": {"name": "n8n"}, "product_version": "0.211.0, < 1.120.4"}, {"id": "3c6254e8-ff4f-330c-ab12-2cbe7b57a442", "product": {"name": "n8n"}, "product_version": "= 1.121.0"}], "enisaIdVendor": [{"id": "196b2b48-cf5d-30ec-a4b3-275a51f1dabb", "vendor": {"name": "n8n-io"}}], "isExploited": false}