{"id": "EUVD-2025-50817", "enisaUuid": "cdfcc6a7-79e9-33d3-9e0b-628803c71451", "description": "Langfuse is an open source large language model engineering platform. Starting in version 2.70.0 and prior to versions 2.95.11 and 3.124.1, in certain project membership APIs, the server trusted a user‑controlled orgId and used it in authorization checks. As a result, any authenticated user on the same Langfuse instance could enumerate names and email addresses of users in another organization if they knew the target organization’s ID. Disclosure is limited to names and email addresses of members/invitees. No customer data such as traces, prompts, or evaluations is exposed or accessible. For Langfuse Cloud, the maintainers ran a thorough investigation of access logs of the last 30 days and could not find any evidence that this vulnerability was exploited. For most self-hosting deployments, the attack surface is significantly reduced given an SSO provider is configured and email/password sign-up is disabled. In these cases, only users who authenticate via the Enterprise SSO IdP (e.g. Okta) would be able to exploit this vulnerability to access the member list, i.e. internal users getting access to a list of other internal users. In order to exploit the vulnerability, the actor must have a valid Langfuse user account within the same instance, know the target orgId, and use the request made to the API that powers the frontend membership tables, including their project/user authentication token, while changing the orgId to the target organization. Langfuse Cloud (EU, US, HIPAA) were affected until fix deployment on November 1, 2025. The maintainers reviewed the Langfuse Cloud access logs from the past 30 days and found no evidence that this vulnerability was exploited. Self-Hosted versions which contain patches include v2.95.11 for major version 2 and v3.124.1 for major version 3. There are no known workarounds. Upgrading is required to fully mitigate this issue.", "datePublished": "2025-11-10T21:51:36", "dateUpdated": "2025-11-12T20:13:56", "baseScore": 5.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:L/I:N/A:N", "references": ["https://github.com/langfuse/langfuse/security/advisories/GHSA-94hf-6gqq-pj69", "https://github.com/langfuse/langfuse/commit/67990ebfdcf0f0c32a6710efa7ddbda073812ab4", "https://github.com/langfuse/langfuse/commit/6c2529049a4c962928c435984c81a547a497e3e5", "https://github.com/langfuse/langfuse/releases/tag/v2.70.0", "https://github.com/langfuse/langfuse/releases/tag/v2.95.11", "https://github.com/langfuse/langfuse/releases/tag/v3.124.1"], "aliases": ["CVE-2025-64504"], "assigner": "GitHub_M", "epss": 0.1, "enisaIdProduct": [{"id": "00a9f452-d741-3512-9627-5a4a88e451ce", "product": {"name": "Langfuse"}, "product_version": "3.0.0, < 3.124.1"}, {"id": "de12b375-0d6b-3fa0-9da5-4ea4059e0bf6", "product": {"name": "Langfuse"}, "product_version": "2.70.0, < 2.95.11"}], "enisaIdVendor": [{"id": "f85e0a93-2e8c-3d1b-bacf-62064276b00c", "vendor": {"name": "langfuse"}}], "isExploited": false}