{"id": "EUVD-2025-31807", "enisaUuid": "82b3d040-2018-372d-9722-f5e3ab0521f9", "description": "Quadient DS-700 iQ devices through 2025-09-30 might have a race condition during the quick clicking of (in order) the Question Mark button, the Help Button, the About button, and the Help Button, leading to a transition out of kiosk mode into local administrative access. NOTE: the reporter indicates that the \"behavior was observed sporadically\" during \"limited time on the client site,\" making it not \"possible to gain more information about the specific kiosk mode crashing issue,\" and the only conclusion was \"there appears to be some form of race condition.\" Accordingly, there can be doubt that a reproducible cybersecurity vulnerability was identified; sporadic software crashes can also be caused by a hardware fault on a single device (for example, transient RAM errors). The reporter also describes a variety of other issues, including initial access via USB because of the absence of a \"lock-pick resistant locking solution for the External Controller PC cabinet,\" which is not a cybersecurity vulnerability (section 4.1.5 of the CNA Operational Rules). Finally, it is unclear whether the device or OS configuration was inappropriate, given that the risks are typically limited to insider threats within the mail operations room of a large company.", "datePublished": "2025-09-30T00:00:00", "dateUpdated": "2025-10-06T18:31:40", "baseScore": 6.4, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:P/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H", "references": ["https://www.trustwave.com/en-us/resources/blogs/spiderlabs-blog/from-folding-to-folded-hacking-high-volume-mailer-machines/", "https://nvd.nist.gov/vuln/detail/CVE-2025-61792"], "aliases": ["CVE-2025-61792"], "assigner": "mitre", "epss": 0.02, "enisaIdProduct": [{"id": "75b71f47-9085-3983-ab3e-47b3a03b403a", "product": {"name": "DS-700 iQ"}, "product_version": "0 ≤2025-09-30"}], "enisaIdVendor": [{"id": "e002a522-b348-33b4-a2ce-ea91fe295b11", "vendor": {"name": "Quadient"}}], "isExploited": false}