{"id": "EUVD-2025-16667", "enisaUuid": "b5903034-a778-3a70-ada8-c83bbfc9a10e", "description": "MyBB is free and open source forum software. Prior to version 1.8.39, the search component does not validate permissions correctly, which allows attackers to determine the existence of hidden (draft, unapproved, or soft-deleted) threads containing specified text in the title. The visibility state (`mybb_threads.visible` integer column) of threads is not validated in internal search queries, whose result is used to output a general success or failure of the search. While MyBB validates permissions when displaying the final search results, a search operation that internally produces at least one result outputs a redirect response (as a HTTP redirect, or a success message page with delayed redirect, depending on configuration). On the other hand, a search operation that internally produces no results outputs a corresponding message in the response without a redirect. This allows a user to determine whether threads matching title search parameters exist, including draft threads (`visible` with a value of `-2`), soft-deleted threads (`visible` with a value of `-1`), and unapproved threads (`visible` with a value of `0`); in addition to displaying generally visible threads (`visible` with a value of `1`). This vulnerability does not affect other layers of permissions. In order to exploit the vulnerability, the user must have access to the search functionality, and general access to forums containing the thread(s). The vulnerability does not expose the message content of posts. MyBB 1.8.39 resolves this issue.", "datePublished": "2025-06-02T15:58:49", "dateUpdated": "2025-06-02T16:07:10", "baseScore": 5.3, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:N/A:N", "references": ["https://github.com/mybb/mybb/security/advisories/GHSA-f847-57xc-ffwr", "https://github.com/mybb/mybb/commit/b8cc332a27e145c33effaccec90e23c103ae5193", "https://mybb.com/versions/1.8.39"], "aliases": ["CVE-2025-48941"], "assigner": "GitHub_M", "epss": 0.05, "enisaIdProduct": [{"id": "e53b91d3-ecb7-3111-a11f-3ea711d27509", "product": {"name": "MyBB"}, "product_version": "< 1.8.39"}], "enisaIdVendor": [{"id": "d63ed2c9-ad80-33fe-86a0-4d5ed765e238", "vendor": {"name": "MyBB"}}], "isExploited": false}