{"id": "EUVD-2025-0008", "enisaUuid": "28055afe-af7e-3d2e-bdfa-0262f92771b9", "description": "notion-go is a collection of libraries for supporting sign and verify OCI artifacts. Based on Notary Project specifications. This issue was identified during Quarkslab's audit of the timestamp feature. During the timestamp signature generation, the revocation status of the certificate(s) used to generate the timestamp signature was not verified. During timestamp signature generation, notation-go did not check the revocation status of the certificate chain used by the TSA. This oversight creates a vulnerability that could be exploited through a Man-in-The-Middle attack. An attacker could potentially use a compromised, intermediate, or revoked leaf certificate to generate a malicious countersignature, which would then be accepted and stored by `notation`. This could lead to denial of service scenarios, particularly in CI/CD environments during signature verification processes because timestamp signature would fail due to the presence of a revoked certificate(s) potentially disrupting operations. This issue has been addressed in release version 1.3.0-rc.2 and all users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2025-01-13T21:37:59", "dateUpdated": "2025-01-14T00:26:00", "baseScore": 4.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L", "references": ["https://github.com/notaryproject/notation-go/security/advisories/GHSA-45v3-38pc-874v", "https://nvd.nist.gov/vuln/detail/CVE-2024-56138", "https://github.com/notaryproject/notation-go/commit/e7005a6d13e5ba472d4e166fbb085152f909e102", "https://github.com/notaryproject/notation-go/commit/e99be1954a15673020150c5f8800b8174cd7428d", "https://github.com/notaryproject/notation-go", "https://pkg.go.dev/vuln/GO-2025-3381"], "aliases": ["CVE-2024-56138", "GHSA-45v3-38pc-874v"], "assigner": "GitHub_M", "epss": 0.01, "enisaIdProduct": [{"id": "dfb51823-24a5-3c15-92b4-4ddbee7af1ea", "product": {"name": "notation-go"}, "product_version": "< 1.3.0-rc.2"}], "enisaIdVendor": [{"id": "4aceea6e-cd7c-3542-aa12-5e9e9f4d4e0b", "vendor": {"name": "notaryproject"}}], "isExploited": false}