{"id": "EUVD-2025-3975", "enisaUuid": "f752a99b-d797-3ec0-ba2f-b2399411be5c", "description": "The SecureDrop Client is a desktop application for journalists to communicate with sources and work with submissions on the SecureDrop Workstation. Prior to versions 0.14.1 and 1.0.1, an attacker who has already gained code execution in a virtual machine on the SecureDrop Workstation could gain code execution in the `sd-log` virtual machine by sending a specially crafted log entry. The vulnerability is not exploitable remotely and requires an attacker to already have code execution on one of the other virtual machines (VMs) of the system. Due to the Workstation's underlying usage of Qubes for strong isolation, the vulnerability would have allowed lateral movement between any log-enabled VM and the `sd-log` VM, but no further. The SecureDrop workstation collects logs centrally in an isolated virtual machine named `sd-log` for easy export for support and debugging purposes. The `sd-log`  VM is completely isolated from the internet and ingests logs via a narrow Qubes RPC policy that allows for specific inter-VM communication via the Xen vchan protocol used by Qubes's qrexec mechanism. A path traversal bug was found in the logic used to choose where to write the log file for a specific VM: the VM name, used unsanitized in the destination path in `sd-log`, is supplied by the logging VM itself instead of being read from a trusted source, such as the Qubes environment variable `QREXEC_REMOTE_DOMAIN` that is used in the fixed implementation. An attacker could provide an arbitrary source VM name, possibly overwriting logs of other VMs, or writing a file named `syslog.log`, with attacker-controlled content, in arbitrary directories as a low-privileged user. A successful attack could potentially overwrite or add configuration to software that loads configuration files from a directory. This is exploitable to achieve code execution by setting the target directory to `/home/user/.config/autostart/` and letting it write `syslog.log`, because XFCE treats any file in that directory as a `.desktop` file regardless of its extension. Versions 0.14.1 and 1.0.1 contain a patch for this issue.", "datePublished": "2025-02-13T17:34:36", "dateUpdated": "2025-02-13T19:08:36", "baseScore": 4.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:H/PR:N/UI:N/S:C/C:L/I:L/A:N", "references": ["https://github.com/freedomofpress/securedrop-client/security/advisories/GHSA-933q-fx9h-5g46", "https://github.com/freedomofpress/securedrop-client/commit/3012bf7289389b5ec0f5f4db0f009a17dee1f586"], "aliases": ["CVE-2025-24889"], "assigner": "GitHub_M", "epss": 0.06, "enisaIdProduct": [{"id": "7c5c273e-e26e-3648-b0a1-4ee02b38d79f", "product": {"name": "securedrop-client"}, "product_version": "= 1.0.0"}, {"id": "9470f71a-1293-3db7-9918-4bf6521319f0", "product": {"name": "securedrop-client"}, "product_version": "< 0.14.1"}], "enisaIdVendor": [{"id": "1cdcecb8-d7de-3d28-a724-b07f063d3495", "vendor": {"name": "freedomofpress"}}], "isExploited": false}