{"id": "EUVD-2025-16906", "enisaUuid": "15bd39c2-f584-3941-a127-f1e51bdcd78e", "description": "FreshRSS is a self-hosted RSS feed aggregator. Prior to version 1.26.2, it's possible to run arbitrary JavaScript on the feeds page.\nThis occurs by combining a cross-site scripting (XSS) issue that occurs in `f.php` when SVG favicons are downloaded from an attacker-controlled feed containing `<script>` tags inside of them that aren't sanitized, with the lack of CSP in `f.php` by embedding the malicious favicon in an iframe (that has `sandbox=\"allow-scripts allow-same-origin\"` set as its attribute). An attacker needs to control one of the feeds that the victim is subscribed to, and also must have an account on the FreshRSS instance. Other than that, the iframe payload can be embedded as one of two options. The first payload requires user interaction (the user clicking on the malicious feed entry) with default user configuration, and the second payload fires instantly right after the user adds the feed or logs into the account while the feed entry is still visible. This is because of lazy image loading functionality, which the second payload bypasses. An attacker can gain access to the victim's account by exploiting this vulnerability. If the victim is an admin it would be possible to delete all users (cause damage) or execute arbitrary code on the server by modifying the update URL using fetch() via the XSS. Version 1.26.2 has a patch for the issue.", "datePublished": "2025-06-04T19:42:15", "dateUpdated": "2025-06-04T20:18:02", "baseScore": 6.7, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:R/S:U/C:H/I:H/A:L", "references": ["https://github.com/FreshRSS/FreshRSS/security/advisories/GHSA-f6r4-jrvc-cfmr", "https://github.com/FreshRSS/FreshRSS/commit/426e3054c237c2b98667ebeacbbdb5caa88e7b1f"], "aliases": ["CVE-2025-31136"], "assigner": "GitHub_M", "epss": 0.04, "enisaIdProduct": [{"id": "99de9243-77b2-3693-9d6f-74b6b8ab70e7", "product": {"name": "FreshRSS"}, "product_version": "< 1.26.2"}], "enisaIdVendor": [{"id": "2e3cddaa-9c88-380b-9167-a8151a9e57ca", "vendor": {"name": "FreshRSS"}}], "isExploited": false}