{"id": "EUVD-2025-204017", "enisaUuid": "d400d169-4766-3028-b147-edbf92c1dffc", "description": "Open Source Point of Sale (opensourcepos) is a web based point of sale application written in PHP using CodeIgniter framework. Starting in version 3.4.0 and prior to version 3.4.2, a Stored Cross-Site Scripting (XSS) vulnerability exists in the \"Return Policy\" configuration field. The application does not properly sanitize user input before saving it to the database or displaying it on receipts. An attacker with access to the \"Store Configuration\" (such as a rogue administrator or an account compromised via the separate CSRF vulnerability) can inject malicious JavaScript payloads into this field. These payloads are executed in the browser of any user (including other administrators and sales staff) whenever they view a receipt or complete a transaction. This can lead to session hijacking, theft of sensitive data, or unauthorized actions performed on behalf of the victim. The vulnerability has been patched in version 3.4.2 by ensuring the output is escaped using the `esc()` function in the receipt template. As a temporary mitigation, administrators should ensure the \"Return Policy\" field contains only plain text and strictly avoid entering any HTML tags. There is no code-based workaround other than applying the patch.", "datePublished": "2025-12-17T22:16:36", "dateUpdated": "2025-12-18T15:06:46", "baseScore": 8.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:R/S:C/C:H/I:H/A:N", "references": ["https://github.com/opensourcepos/opensourcepos/security/advisories/GHSA-xgr7-7pvw-fpmh", "https://github.com/opensourcepos/opensourcepos/commit/22297a", "https://github.com/Nixon-H/CVE-2025-68147-OSPOS-Stored-XSS"], "aliases": ["CVE-2025-68147"], "assigner": "GitHub_M", "epss": 0.03, "enisaIdProduct": [{"id": "6b7e7a22-0082-3784-9372-3eeba5c66868", "product": {"name": "opensourcepos"}, "product_version": "3.4.0, < 3.4.2"}], "enisaIdVendor": [{"id": "a4c303a0-f59e-3e5d-8003-690f7caf4178", "vendor": {"name": "opensourcepos"}}], "isExploited": false}