{"id": "EUVD-2025-0065", "enisaUuid": "caca4210-8682-36f2-bf29-c831d14d664e", "description": "Gradio is an open-source Python package that allows quick building of demos and web application for machine learning models, API, or any arbitrary Python function. Gradio's Access Control List (ACL) for file paths can be bypassed by altering the letter case of a blocked file or directory path. This vulnerability arises due to the lack of case normalization in the file path validation logic. On case-insensitive file systems, such as those used by Windows and macOS, this flaw enables attackers to circumvent security restrictions and access sensitive files that should be protected. This issue can lead to unauthorized data access, exposing sensitive information and undermining the integrity of Gradio's security model. Given Gradio's popularity for building web applications, particularly in machine learning and AI, this vulnerability may pose a substantial threat if exploited in production environments. This issue has been addressed in release version 5.6.0. Users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2025-01-14T18:49:16", "dateUpdated": "2025-02-12T20:31:19", "baseScore": 8.7, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N", "references": ["https://github.com/gradio-app/gradio/security/advisories/GHSA-j2jg-fq62-7c3h", "https://nvd.nist.gov/vuln/detail/CVE-2025-23042", "https://github.com/gradio-app/gradio/commit/6b63fdec441b5c9bf910f910a2505d8defbb6bf8", "https://github.com/gradio-app/gradio", "https://github.com/gradio-app/gradio/releases/tag/gradio%405.11.0"], "aliases": ["CVE-2025-23042", "GHSA-j2jg-fq62-7c3h"], "assigner": "GitHub_M", "epss": 0.24, "enisaIdProduct": [{"id": "0de44cda-bdca-3338-9658-43b31a99cb96", "product": {"name": "gradio"}, "product_version": "< 5.6.0"}], "enisaIdVendor": [{"id": "756e6f98-ddbf-3093-b24f-ca587a3615bf", "vendor": {"name": "gradio-app"}}], "isExploited": false}