{"id": "EUVD-2025-16050", "enisaUuid": "aea16c1f-5a46-38c6-9cfb-d681e2a8ed68", "description": "GitHub Desktop is an open-source, Electron-based GitHub app designed for git development. Prior to version 3.4.20-beta3, an attacker convincing a user to view a file in a commit of their making in the history view can cause information disclosure by means of Git attempting to access a network share. This affects GitHub Desktop users on Windows that view malicious commits in the history view. macOS users are not affected. When viewing a file diff in the history view GitHub Desktop will call `git log` or `git diff` with the object id (SHA) of the commit, the name of the file, and the old name of the file if the file has been renamed. As a security precaution Git will attempt to fully resolve the old and new path via `realpath`, traversing symlinks, to ensure that the resolved paths reside within the repository working directory. This can lead to Git attempting to access a path that resides on a network share (UNC path) and in doing so Windows will attempt to perform NTLM authentication which passes information such as the computer name, the currently signed in (Windows) user name, and an NTLM hash. GitHub Desktop 3.4.20 and later fix this vulnerability. The beta channel includes the fix in 3.4.20-beta3. As a workaround to use until upgrading is possible, only browse commits in the history view that comes from trusted sources.", "datePublished": "2025-05-21T17:40:57", "dateUpdated": "2025-05-21T18:18:16", "baseScore": 3.3, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N", "references": ["https://github.com/desktop/desktop/security/advisories/GHSA-f234-7hj3-vr8j"], "aliases": ["CVE-2025-48064"], "assigner": "GitHub_M", "epss": 0.01, "enisaIdProduct": [{"id": "21d819e0-98ea-367c-9611-80f0b2de8abe", "product": {"name": "Desktop"}, "product_version": "< 3.4.20-beta3"}], "enisaIdVendor": [{"id": "2d1eea50-1ff7-34e6-a68b-109faa876cdd", "vendor": {"name": "desktop"}}], "isExploited": false}