{"id": "EUVD-2025-4792", "enisaUuid": "48b21a29-7660-3240-86b9-830497267213", "description": "SPID.AspNetCore.Authentication is an AspNetCore Remote Authenticator for SPID. Authentication using Spid and CIE is based on the SAML2 standard which provides two entities: Identity Provider (IDP): the system that authenticates users and provides identity information (SAML affirmation) to the Service Provider, in essence, is responsible for the management of the credentials and identity of users; Service Provider (SP): the system that provides a service to the user and relies on the Identity Provider to authenticate the user, receives SAML assertions from the IdP to grant access to resources. The validation logic of the signature is central as it ensures that you cannot create a SAML response with arbitrary assertions and then impersonate other users. There is no guarantee that the first signature refers to the root object, it follows that if an attacker injects an item signed as the first element, all other signatures will not be verified. The only requirement is to have an XML element legitimately signed by the IdP, a condition that is easily met using the IdP's public metadata. An attacker could create an arbitrary SAML response that would be accepted by SPs using vulnerable SDKs, allowing him to impersonate any Spid and/or CIE user. This vulnerability has been addressed in version 3.4.0 and all users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2025-02-18T18:39:37", "dateUpdated": "2025-02-18T19:46:06", "baseScore": 9.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N", "references": ["https://github.com/italia/spid-aspnetcore/security/advisories/GHSA-36h8-r92j-w9vw", "https://github.com/italia/spid-aspnetcore/commit/093efa2273f8a1e0481f678a0bfcd57fbdc7b029", "https://github.com/italia/spid-aspnetcore"], "aliases": ["CVE-2025-24894", "GHSA-36h8-r92j-w9vw"], "assigner": "GitHub_M", "epss": 0.23, "enisaIdProduct": [{"id": "d6990dbb-bcc4-3322-bdf9-c88f037227bb", "product": {"name": "spid-aspnetcore"}, "product_version": "< 3.4.0"}], "enisaIdVendor": [{"id": "571408f8-e303-3906-a9a9-d23065d3e407", "vendor": {"name": "italia"}}], "isExploited": false}