{"id": "EUVD-2025-19217", "enisaUuid": "2b7c79cd-28df-3432-9766-6cbad31aa223", "description": "Himmelblau is an interoperability suite for Microsoft Azure Entra ID and Intune. A vulnerability present in versions 0.9.10 through 0.9.16 allows a user to authenticate to a Linux host via Himmelblau using an *invalid* Linux Hello PIN, provided the host is offline. While the user gains access to the local system, Single Sign-On (SSO) fails due to the network being down and the inability to issue tokens (due to a failure to unlock the Hello key). The core issue lies in an incorrect assumption within the `acquire_token_by_hello_for_business_key` function: it was expected to return a `TPMFail` error for an invalid Hello key when offline, but instead, a preceding nonce request resulted in a `RequestFailed` error, leading the system to erroneously transition to an offline success state without validating the Hello key unlock. This impacts systems using Himmelblau for authentication when operating in an offline state with Hello PIN authentication enabled. Rocky Linux 8 (and variants) are not affected by this vulnerability. The problem is resolved in Himmelblau version 0.9.17. A workaround is available for users who cannot immediately upgrade. Disabling Hello PIN authentication by setting `enable_hello = false` in `/etc/himmelblau/himmelblau.conf` will mitigate the vulnerability.", "datePublished": "2025-06-26T18:02:31", "dateUpdated": "2025-06-26T18:47:31", "baseScore": 5.2, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:P/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:N", "references": ["https://github.com/himmelblau-idm/himmelblau/security/advisories/GHSA-j93j-pwm6-p97j", "https://github.com/himmelblau-idm/himmelblau/commit/64b03739f1d5ee472b1cff3ed20ed9af1c65a6f8", "https://github.com/himmelblau-idm/himmelblau/commit/78477d684df710d57c10091c87b92665cfac98ae"], "aliases": ["CVE-2025-53013"], "assigner": "GitHub_M", "epss": 0.03, "enisaIdProduct": [{"id": "99b645ca-5ad8-39b2-b2c3-70d050809b29", "product": {"name": "himmelblau"}, "product_version": "0.9.10, < 0.9.17"}], "enisaIdVendor": [{"id": "05d78b73-1b14-38a5-82d9-a89ab77b8a62", "vendor": {"name": "himmelblau-idm"}}], "isExploited": false}