{"id": "EUVD-2025-18065", "enisaUuid": "cd13a860-efad-311d-becd-5d95ab3a12c3", "description": "When an Apache CloudStack user-account creates a CKS-based Kubernetes cluster in a project, the API key and the secret key of the 'kubeadmin' user of the caller account are used to create the secret config in the CKS-based Kubernetes cluster. A member of the project who can access the CKS-based Kubernetes cluster, can also access the API key and secret key of the 'kubeadmin' user of the CKS cluster's creator's account. An attacker who's a member of the project can exploit this to impersonate and perform privileged actions that can result in complete compromise of the confidentiality, integrity, and availability of resources owned by the creator's account.\n\nCKS users are recommended to upgrade to version 4.19.3.0 or 4.20.1.0, which fixes this issue.Updating Existing Kubernetes Clusters in ProjectsA service account should be created for each project to provide limited access specifically for Kubernetes cluster providers and autoscaling. Follow the steps below to create a new service account, update the secret inside the cluster, and regenerate existing API and service keys:1. Create a New Service AccountCreate a new account using the role \"Project Kubernetes Service Role\" with the following details:\n\nAccount Name\nkubeadmin-<FIRST_EIGHT_CHARACTERS_OF_PROJECT_ID>\nFirst Name\nKubernetes\nLast Name\nService User\nAccount Type\n0 (Normal User)\nRole ID\n<ID_OF_SERVICE_ROLE>\n\n\n\n2. Add the Service Account to the ProjectAdd this account to the project where the Kubernetes cluster(s) are hosted.\n3. Generate API and Secret KeysGenerate API Key and Secret Key for the default user of this account.\n4. Update the CloudStack Secret in the Kubernetes ClusterCreate a temporary file `/tmp/cloud-config` with the following data:\n   api-url = <API_URL>       # For example: <MS_URL>/client/api\n  api-key = <SERVICE_USER_API_KEY>\n  secret-key = <SERVICE_USER_SECRET_KEY>\n  project-id = <PROJECT_ID>\n\n\n\n\nDelete the existing secret using kubectl and Kubernetes cluster config:\n   ./kubectl --kubeconfig kube.conf -n kube-system delete secret cloudstack-secret\n\n\n\n\nCreate a new secret using kubectl and Kubernetes cluster config:\n    ./kubectl --kubeconfig kube.conf -n kube-system create secret generic cloudstack-secret --from-file=/tmp/cloud-config\n\n\n\n\nRemove the temporary file:\n    rm /tmp/cloud-config5. Regenerate API and Secret KeysRegenerate the API and secret keys for the original user account that was used to create the Kubernetes cluster.", "datePublished": "2025-06-11T00:30:36", "dateUpdated": "2025-06-11T15:30:27", "baseScore": 8.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:N", "references": ["https://cloudstack.apache.org/blog/cve-advisories-4.19.3.0-4.20.1.0/", "https://www.shapeblue.com/shapeblue-security-advisory-apache-cloudstack-security-releases-4-19-3-0-and-4-20-1-0/", "https://lists.apache.org/thread/y3qnwn59t8qggtdohv7k7vw39bgb3d60", "https://nvd.nist.gov/vuln/detail/CVE-2025-26521"], "aliases": ["CVE-2025-26521"], "assigner": "apache", "epss": 0.06, "enisaIdProduct": [{"id": "0f7308b3-0ac8-3b67-ba5d-768fb033a219", "product": {"name": "Apache CloudStack"}, "product_version": "4.17.0.0 <4.19.3.0"}, {"id": "5c3747d3-7fc2-3fee-ba30-67ccca2c72e5", "product": {"name": "Apache CloudStack"}, "product_version": "4.20.0.0 <4.20.1.0"}], "enisaIdVendor": [{"id": "40a5b6c1-8b26-360e-8881-e3601b176a3f", "vendor": {"name": "Apache Software Foundation"}}], "isExploited": false}