{"id": "EUVD-2025-22951", "enisaUuid": "2daf817d-eb57-3502-95c9-85d1ec847969", "description": "Polkadot Frontier is an Ethereum and EVM compatibility layer for Polkadot and Substrate. The extrinsic note_min_gas_price_target is an inherent extrinsic, meaning only the block producer can call it. To ensure correctness, the ProvideInherent trait should be implemented for each inherent, which includes the check_inherent call. This allows other nodes to verify if the input (in this case, the target value) is correct. However, prior to commit a754b3d, the check_inherent function has not been implemented for note_min_gas_price_target. This lets the block producer set the target value without verification. The target is then used to set the MinGasPrice, which has an upper and lower bound defined in the on_initialize hook. The block producer can set the target to the upper bound. Which also increases the upper and lower bounds for the next block. Over time, this could result in continuously raising the gas price, making contract execution too expensive and ineffective for users. An attacker could use this flaw to manipulate the gas price, potentially leading to significantly inflated transaction fees. Such manipulation could render contract execution prohibitively expensive for users, effectively resulting in a denial-of-service condition for the network. This is fixed in version a754b3d.", "datePublished": "2025-07-28T20:20:04", "dateUpdated": "2025-07-28T20:38:02", "baseScore": 6.9, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:L/VA:L/SC:N/SI:N/SA:N", "references": ["https://github.com/polkadot-evm/frontier/security/advisories/GHSA-r6rj-gmqh-cv94", "https://github.com/polkadot-evm/frontier/commit/a754b3dc6e1b6da98f71aea7bb1fa08677b24186", "https://dotpal.io/assets/files/frontier-srlabs-2505-718c3bfa5df9fed1862fed05de506859.pdf"], "aliases": ["CVE-2025-54427"], "assigner": "GitHub_M", "epss": 0.07, "enisaIdProduct": [{"id": "d3c881ba-e224-301e-ab33-e4680e9365e5", "product": {"name": "frontier"}, "product_version": "< a754b3d"}], "enisaIdVendor": [{"id": "0346f46d-f4ec-3a8b-8b72-cec834a5e2c6", "vendor": {"name": "polkadot-evm"}}], "isExploited": false}