{"id": "EUVD-2025-28922", "enisaUuid": "9caac6e7-526c-3b38-b392-9961ba142305", "description": "In the Linux kernel, the following vulnerability has been resolved:\n\ndm: dm-crypt: Do not partially accept write BIOs with zoned targets\n\nRead and write operations issued to a dm-crypt target may be split\naccording to the dm-crypt internal limits defined by the max_read_size\nand max_write_size module parameters (default is 128 KB). The intent is\nto improve processing time of large BIOs by splitting them into smaller\noperations that can be parallelized on different CPUs.\n\nFor zoned dm-crypt targets, this BIO splitting is still done but without\nthe parallel execution to ensure that the issuing order of write\noperations to the underlying devices remains sequential. However, the\nsplitting itself causes other problems:\n\n1) Since dm-crypt relies on the block layer zone write plugging to\n   handle zone append emulation using regular write operations, the\n   reminder of a split write BIO will always be plugged into the target\n   zone write plugged. Once the on-going write BIO finishes, this\n   reminder BIO is unplugged and issued from the zone write plug work.\n   If this reminder BIO itself needs to be split, the reminder will be\n   re-issued and plugged again, but that causes a call to a\n   blk_queue_enter(), which may block if a queue freeze operation was\n   initiated. This results in a deadlock as DM submission still holds\n   BIOs that the queue freeze side is waiting for.\n\n2) dm-crypt relies on the emulation done by the block layer using\n   regular write operations for processing zone append operations. This\n   still requires to properly return the written sector as the BIO\n   sector of the original BIO. However, this can be done correctly only\n   and only if there is a single clone BIO used for processing the\n   original zone append operation issued by the user. If the size of a\n   zone append operation is larger than dm-crypt max_write_size, then\n   the orginal BIO will be split and processed as a chain of regular\n   write operations. Such chaining result in an incorrect written sector\n   being returned to the zone append issuer using the original BIO\n   sector.  This in turn results in file system data corruptions using\n   xfs or btrfs.\n\nFix this by modifying get_max_request_size() to always return the size\nof the BIO to avoid it being split with dm_accpet_partial_bio() in\ncrypt_map(). get_max_request_size() is renamed to\nget_max_request_sectors() to clarify the unit of the value returned\nand its interface is changed to take a struct dm_target pointer and a\npointer to the struct bio being processed. In addition to this change,\nto ensure that crypt_alloc_buffer() works correctly, set the dm-crypt\ndevice max_hw_sectors limit to be at most\nBIO_MAX_VECS << PAGE_SECTORS_SHIFT (1 MB with a 4KB page architecture).\nThis forces DM core to split write BIOs before passing them to\ncrypt_map(), and thus guaranteeing that dm-crypt can always accept an\nentire write BIO without needing to split it.\n\nThis change does not have any effect on the read path of dm-crypt. Read\noperations can still be split and the BIO fragments processed in\nparallel. There is also no impact on the performance of the write path\ngiven that all zone write BIOs were already processed inline instead of\nin parallel.\n\nThis change also does not affect in any way regular dm-crypt block\ndevices.", "datePublished": "2025-09-11T18:35:52", "dateUpdated": "2025-11-25T18:32:20", "baseScore": 0.0, "references": ["https://git.kernel.org/stable/c/8864616719b6bbf92356bc89ff544b0cd484c656", "https://git.kernel.org/stable/c/52a2c4c60470352acf9cde7a2dfa661c1e67e796", "https://git.kernel.org/stable/c/e549663849e5bb3b985dc2d293069f0d9747ae72", "https://nvd.nist.gov/vuln/detail/CVE-2025-39791"], "aliases": ["CVE-2025-39791"], "assigner": "Linux", "epss": 0.01, "enisaIdProduct": [{"id": "08815ace-7f0c-33da-82d6-b6658aad5ac2", "product": {"name": "Linux"}, "product_version": "patch: 6.12.44"}, {"id": "08b7483d-b806-3a89-bb68-62c1ae1d9b9c", "product": {"name": "Linux"}, "product_version": "f211268ed1f9bdf48f06a3ead5f5d88437450579 <e549663849e5bb3b985dc2d293069f0d9747ae72"}, {"id": "37605c9e-75f8-3623-9df1-03732f54d424", "product": {"name": "Linux"}, "product_version": "patch: 6.16.4"}, {"id": "422f2918-adde-3a05-bb6f-c9cfee061d49", "product": {"name": "Linux"}, "product_version": "6.10"}, {"id": "729520fa-4a95-3a7a-a60b-1fa49e3ac433", "product": {"name": "Linux"}, "product_version": "patch: 0"}, {"id": "959c3776-03e5-3abe-b653-c0ed0b71b66a", "product": {"name": "Linux"}, "product_version": "f211268ed1f9bdf48f06a3ead5f5d88437450579 <52a2c4c60470352acf9cde7a2dfa661c1e67e796"}, {"id": "b0bcda80-0673-3720-95e7-140e2b5bc644", "product": {"name": "Linux"}, "product_version": "f211268ed1f9bdf48f06a3ead5f5d88437450579 <8864616719b6bbf92356bc89ff544b0cd484c656"}, {"id": "dad595ef-792d-38dc-a597-e6cf24e9a3f4", "product": {"name": "Linux"}, "product_version": "patch: 6.17"}, {"id": "ff5ecdc0-a206-3e55-9a14-c10e179227e3", "product": {"name": "Linux"}, "product_version": "patch: 6.17-rc1"}], "enisaIdVendor": [{"id": "5a45bf8f-a17d-3f4b-9228-4ecc08e7fb57", "vendor": {"name": "Linux"}}], "isExploited": false}