{"id": "EUVD-2025-19758", "enisaUuid": "a80bf66d-9fd6-3ae2-a76a-09cc23a1141f", "description": "A padding oracle vulnerability exists in Google Chrome’s AppBound cookie encryption mechanism due to observable decryption failure behavior in Windows Event Logs when handling malformed ciphertext in SYSTEM-DPAPI-encrypted blobs. A local attacker can repeatedly send malformed ciphertexts to the Chrome elevation service and distinguish between padding and MAC errors, enabling a padding oracle attack. This allows partial decryption of the SYSTEM-DPAPI layer and eventual recovery of the user-DPAPI encrypted cookie key, which is trivially decrypted by the attacker’s own context. This issue undermines the core purpose of AppBound Encryption by enabling low-privileged cookie theft through cryptographic misuse and verbose error feedback.\n\nConfirmed in Google Chrome with AppBound Encryption enabled. Other Chromium-based browsers may be affected if they implement similar COM-based encryption mechanisms.\n\nThis behavior arises from a combination of Chrome’s AppBound implementation and the way Microsoft Windows DPAPI reports decryption failures via Event Logs. As such, the vulnerability relies on cryptographic behavior and error visibility in all supported versions of Windows.", "datePublished": "2025-07-02T19:25:27", "dateUpdated": "2025-07-03T03:55:40", "baseScore": 8.8, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:L/AC:H/AT:P/PR:L/UI:N/VC:H/VI:H/VA:H/SC:H/SI:H/SA:H", "references": ["https://www.cyberark.com/resources/threat-research-blog/c4-bomb-blowing-up-chromes-appbound-cookie-encryption", "https://vulncheck.com/advisories/google-chrome-appbound-cookie-encryption"], "aliases": ["CVE-2025-34091"], "assigner": "VulnCheck", "epss": 0.0, "enisaIdProduct": [{"id": "3a7157be-7576-373c-a029-10f9558434c3", "product": {"name": "Chrome"}, "product_version": "127 <129"}], "enisaIdVendor": [{"id": "1db654d0-c5e8-3409-bcd1-103de82631ea", "vendor": {"name": "Google"}}], "isExploited": false}