{"id": "EUVD-2025-16870", "enisaUuid": "52bdec0a-a56d-3922-8fa9-e320a69043b5", "description": "CVE-2025-1701 is a high-severity vulnerability in the MIM Admin service. An attacker could exploit this vulnerability by sending a specially crafted request over the RMI interface to execute arbitrary code with the privileges of the MIM Admin service. The RMI interface is only accessible locally (listening on 127.0.0.1), limiting the attack vector to the local machine.  This means that in a properly configured hospital environment, an attacker must have already compromised the network and additionally compromised the system where the MIM Admin service is running.  From there, attackers with sufficient knowledge of MIM's implementation, library usage, and functionality with access to extend the MIM RMI library could force the MIM Admin service to run commands on the local machine with its privileges.\n\nUsers of MIM Software products exposed via RDP or multi-user application virtualization system should take note that the system being exposed is the environment hosting the virtualized MIM client.\n\n\n\nThis issue affects MIM Admin Service: before 7.2.13, 7.3.8, 7.4.3", "datePublished": "2025-06-04T15:30:40", "dateUpdated": "2025-06-04T15:30:40", "baseScore": 8.9, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:A/AC:L/AT:P/PR:L/UI:N/VC:H/VI:H/VA:H/SC:H/SI:H/SA:H", "references": ["https://www.mimsoftware.com/cve-2025-1701", "https://nvd.nist.gov/vuln/detail/CVE-2025-1701"], "aliases": ["CVE-2025-1701"], "assigner": "MIM", "epss": 0.03, "enisaIdProduct": [{"id": "6b2b1300-af86-3176-bb1e-b8a2f91d2332", "product": {"name": "MIM Admin Service"}, "product_version": "0 <7.3.8"}, {"id": "71f3b486-c8d3-3532-803e-424a5e5fd29d", "product": {"name": "MIM Admin Service"}, "product_version": "0 <7.4.3"}, {"id": "7d12353c-5dcd-3d4e-b52e-0de19326a64d", "product": {"name": "MIM Admin Service"}, "product_version": "0 <7.2.13"}], "enisaIdVendor": [{"id": "66092217-83e0-3430-8586-29cd0bacb22b", "vendor": {"name": "MIM Software"}}], "isExploited": false}