{"id": "EUVD-2025-5089", "enisaUuid": "3fc53f43-ce26-32b3-8339-2745f848722b", "description": "GHOSTS is an open source user simulation framework for cyber experimentation, simulation, training, and exercise. A path traversal vulnerability was discovered in GHOSTS version 8.0.0.0 that allows an attacker to access files outside of the intended directory through the photo retrieval endpoint. The vulnerability exists in the /api/npcs/{id}/photo endpoint, which is designed to serve profile photos for NPCs (Non-Player Characters) but fails to properly validate and sanitize file paths. When an NPC is created with a specially crafted photoLink value containing path traversal sequences (../, ..\\, etc.), the application processes these sequences without proper sanitization. This allows an attacker to traverse directory structures and access files outside of the intended photo directory, potentially exposing sensitive system files. The vulnerability is particularly severe because it allows reading arbitrary files from the server's filesystem with the permissions of the web application process, which could include configuration files, credentials, or other sensitive data. This issue has been addressed in version 8.2.7.90 and all users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2025-02-19T22:16:56", "dateUpdated": "2025-02-20T16:52:40", "baseScore": 8.7, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:N/VA:N/SC:N/SI:N/SA:N", "references": ["https://github.com/cmu-sei/GHOSTS/security/advisories/GHSA-qr67-m6w9-wj3j", "https://github.com/cmu-sei/GHOSTS/commit/e69827556a52ff813de00e1017c4b62598d2c887"], "aliases": ["CVE-2025-27092"], "assigner": "GitHub_M", "epss": 0.24, "enisaIdProduct": [{"id": "ab6b491c-942a-3ba8-ac9f-a29f7b504e02", "product": {"name": "GHOSTS"}, "product_version": "8.0.0, < 8.2.7.90"}], "enisaIdVendor": [{"id": "44e48033-7a06-3e77-ba03-a06acc61a4e1", "vendor": {"name": "cmu-sei"}}], "isExploited": false}