{"id": "EUVD-2025-24879", "enisaUuid": "40b4737e-232b-346e-955c-ef5985a08532", "description": "HomeAssistant-Tapo-Control offers Control for Tapo cameras as a Home Assistant component. Prior to commit 2a3b80f, there is a code injection vulnerability in the GitHub Actions workflow .github/workflows/issues.yml. It does not affect users of the Home Assistant integration itself — it only impacts the GitHub Actions environment for this repository. The vulnerable workflow directly inserted user-controlled content from the issue body (github.event.issue.body) into a Bash conditional without proper sanitization. A malicious GitHub user could craft an issue body that executes arbitrary commands on the GitHub Actions runner in a privileged context whenever an issue is opened. The potential impact is limited to the repository’s CI/CD environment, which could allow access to repository contents or GitHub Actions secrets. This issue has been patched via commit 2a3b80f. Workarounds involve disabling the affected workflow (issues.yml), replacing the unsafe Bash comparison with a safe quoted grep (or a pure GitHub Actions expression check), or ensuring minimal permissions in workflows (permissions: block) to reduce possible impact.", "datePublished": "2025-08-14T16:40:33", "dateUpdated": "2025-09-12T19:04:49", "baseScore": 8.6, "baseScoreVersion": "4.0", "baseScoreVector": "CVSS:4.0/AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:N/SC:N/SI:N/SA:N", "references": ["https://github.com/JurajNyiri/HomeAssistant-Tapo-Control/security/advisories/GHSA-xccg-43hx-c846", "https://github.com/JurajNyiri/HomeAssistant-Tapo-Control/commit/2a3b80ff128ddf4f410c97dd47a94343792ce43c", "https://securitylab.github.com/advisories/GHSL-2025-101_homeassistant-tapo-control"], "aliases": ["CVE-2025-55192"], "assigner": "GitHub_M", "epss": 0.07, "enisaIdProduct": [{"id": "c261a037-a2c5-39ee-be15-247030ea88a0", "product": {"name": "HomeAssistant-Tapo-Control"}, "product_version": "< 2a3b80ff128ddf4f410c97dd47a94343792ce43c"}], "enisaIdVendor": [{"id": "0c817c21-16c7-3f93-b42a-64c29c0c60da", "vendor": {"name": "JurajNyiri"}}], "isExploited": false}