{"id": "EUVD-2025-27467", "enisaUuid": "67e3fb91-969c-3a16-90f7-4d346e74a7da", "description": "Tautulli is a Python based monitoring and tracking tool for Plex Media Server. In Tautulli v2.15.3 and earlier, an attacker with administrative access can use the `pms_image_proxy` endpoint to write arbitrary python scripts into the application filesystem. This leads to remote code execution when combined with the `Script` notification agent. If an attacker with administrative access changes the URL of the PMS to a server they control, they can then abuse the `pms_image_proxy` to obtain a file write into the application filesystem. This can be done by making a `pms_image_proxy` request with a URL in the `img` parameter and the desired file name in the `img_format` parameter. Tautulli then uses a hash of the desired metadata together with the `img_format` in order to construct a file path. Since the attacker controls `img_format` which occupies the end of the file path, and `img_format` is not sanitised, the attacker can then use path traversal characters to specify filename of their choosing. If the specified file does not exist, Tautaulli will then attempt to fetch the image from the configured PMS. Since the attacker controls the PMS, they can return arbitrary content in response to this request, which will then be written into the specified file. An attacker can write an arbitrary python script into a location on the application file system. The attacker can then make use of the built-in `Script` notification agent to run the local script, obtaining remote code execution on the application server. Users should upgrade to version 2.16.0 to receive a patch.", "datePublished": "2025-09-09T20:08:27", "dateUpdated": "2025-09-09T20:08:27", "baseScore": 9.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:C/C:H/I:H/A:H", "references": ["https://github.com/Tautulli/Tautulli/security/advisories/GHSA-pxhr-29gv-4j8v", "https://github.com/Tautulli/Tautulli/commit/26e6b328112eb2cf35c164f981e0718f3a3d31a7"], "aliases": ["CVE-2025-58762"], "assigner": "GitHub_M", "epss": 0.52, "enisaIdProduct": [{"id": "f34ec564-bb53-3505-ab9a-f594e2403ce6", "product": {"name": "Tautulli"}, "product_version": "< 2.16.0"}], "enisaIdVendor": [{"id": "b9453d15-2578-33f1-bf0b-d313b36da9a6", "vendor": {"name": "Tautulli"}}], "isExploited": false}