{"id": "EUVD-2014-3586", "enisaUuid": "59465bfe-dfba-312d-94d6-aa3d85037fa3", "description": "The Grails Resource Plugin often has to exchange URIs for resources with other internal components. Those other components will decode any URI passed to them. To protect against directory traversal the Grails Resource Plugin did the following: normalized the URI, checked the normalized URI did not step outside the appropriate root directory (e.g. the web application root), decoded the URI and checked that this did not introduce additional /../ (and similar) sequences. A bug was introduced where the Grails Resource Plugin before 1.2.13 returned the decoded version of the URI rather than the normalized version of the URI after the directory traversal check. This exposed a double decoding vulnerability. To address this issue, the Grails Resource Plugin now repeatedly decodes the URI up to three times or until decoding no longer changes the URI. If the decode limit of 3 is exceeded the URI is rejected. A side-effect of this is that the Grails Resource Plugin is unable to serve a resource that includes a '%' character in the full path to the resource. Not all environments are vulnerable because of the differences in URL resolving in different servlet containers. Applications deployed to Tomcat 8 and Jetty 9 were found not not be vulnerable, however applications deployed to JBoss EAP 6.3 / JBoss AS 7.4 and JBoss AS 7.1 were found to be vulnerable (other JBoss versions weren't tested). In certain cases JBoss returns JBoss specific vfs protocol urls from URL resolution methods (ClassLoader.getResources). The JBoss vfs URL protocol supports resolving any file on the filesystem. This made the directory traversal possible. There may be other containers, in addition to JBoss, on which this vulnerability is exposed.", "datePublished": "2018-03-19T13:00:00", "dateUpdated": "2024-09-17T03:59:34", "baseScore": 7.5, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:N/A:N", "references": ["https://pivotal.io/security/cve-2014-3626"], "aliases": ["CVE-2014-3626"], "assigner": "dell", "epss": 0.98, "enisaIdProduct": [{"id": "1a67c972-847c-325e-a3de-b4670a64690a", "product": {"name": "Grails by Pivotal"}, "product_version": "Resources plugin versions 1.2.0 - 1.2.12. Earlier versions may also be affected but were not assessed"}], "enisaIdVendor": [{"id": "ce7a2dc6-c044-3db1-875d-995d4ff1f255", "vendor": {"name": "Dell EMC"}}], "isExploited": false}