{"id": "EUVD-2022-52751", "enisaUuid": "d7b283c7-b201-3358-b50d-301cedb904a4", "description": "Canarytokens is an open source tool which helps track activity and actions on your network. A Cross-Site Scripting vulnerability was identified in the history page of triggered Canarytokens. This permits an attacker who recognised an HTTP-based Canarytoken (a URL) to execute Javascript in the Canarytoken's history page (domain: canarytokens.org) when the history page is later visited by the Canarytoken's creator. This vulnerability could be used to disable or delete the affected Canarytoken, or view its activation history. It might also be used as a stepping stone towards revealing more information about the Canarytoken's creator to the attacker. For example, an attacker could recover the email address tied to the Canarytoken, or place Javascript on the history page that redirect the creator towards an attacker-controlled Canarytoken to show the creator's network location. An attacker could only act on the discovered Canarytoken. This issue did not expose other Canarytokens or other Canarytoken creators. The issue has been patched on Canarytokens.org and in the latest release. No signs of successful exploitation of this vulnerability have been found. Users are advised to upgrade. There are no known workarounds for this issue.", "datePublished": "2022-07-01T16:30:19", "dateUpdated": "2025-04-23T18:05:11", "baseScore": 6.3, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L", "references": ["https://github.com/thinkst/canarytokens/security/advisories/GHSA-5675-3424-hpqr", "https://github.com/thinkst/canarytokens/commit/dc378957bc28a6f3b5a8d7217b0605d81111f090"], "aliases": ["CVE-2022-31113"], "assigner": "GitHub_M", "epss": 0.1, "enisaIdProduct": [{"id": "6d4eb871-7176-3b92-a767-cf321146a4a8", "product": {"name": "canarytokens"}, "product_version": "Commits prior to dc378957bc28a6f3b5a8d7217b0605d81111f090"}], "enisaIdVendor": [{"id": "d5f58b23-84c0-364f-b108-ec9049766b08", "vendor": {"name": "thinkst"}}], "isExploited": false}