{"id": "EUVD-2022-28570", "enisaUuid": "dc423b5a-c33a-3b91-8e62-5c2607ac8d68", "description": "authentik is an open-source Identity Provider focused on flexibility and versatility. Versions prior to 2022.11.4 and 2022.10.4 are vulnerable to Improper Authentication. Token reuse in invitation URLs leads to access control bypass via the use of a different enrollment flow than in the one provided. The vulnerability allows an attacker that knows different invitation flows names (e.g. `enrollment-invitation-test` and `enrollment-invitation-admin`) via either different invite links or via brute forcing to signup via a single invitation url for any valid invite link received (it can even be a url for a third flow as long as it's a valid invite) as the token used in the `Invitations` section of the Admin interface does NOT change when a different `enrollment flow` is selected via the interface and it is NOT bound to the selected flow, so it will be valid for any flow when used. This issue is patched in authentik 2022.11.4,2022.10.4 and 2022.12.0. Only configurations that use invitations and have multiple enrollment flows with invitation stages that grant different permissions are affected. The default configuration is not vulnerable, and neither are configurations with a single enrollment flow.  As a workaround, fixed data can be added to invitations which can be checked in the flow to deny requests. Alternatively, an identifier with high entropy (like a UUID) can be used as flow slug, mitigating the attack vector by exponentially decreasing the possibility of discovering other flows.", "datePublished": "2022-12-28T00:12:35", "dateUpdated": "2024-08-03T03:43:46", "baseScore": 9.4, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:L", "references": ["https://github.com/goauthentik/authentik/security/advisories/GHSA-9qwp-jf7p-vr7h"], "aliases": ["CVE-2022-23555"], "assigner": "GitHub_M", "epss": 0.04, "enisaIdProduct": [{"id": "360e16f8-37c5-35b0-afd9-d34e1c8dbe4c", "product": {"name": "authentik"}, "product_version": "< 2022.10.4"}, {"id": "74e8774b-188b-3e28-a132-93c63311cb7c", "product": {"name": "authentik"}, "product_version": "2022.11.0, < 2022.11.4"}], "enisaIdVendor": [{"id": "a839b193-713d-3065-ac03-05ef0e85eea5", "vendor": {"name": "goauthentik"}}], "isExploited": false}