{"id": "EUVD-2022-7072", "enisaUuid": "d2b3d0d5-8c8e-38e1-af84-1b3d75b718b1", "description": "@dependencytrack/frontend is a Single Page Application (SPA) used in Dependency-Track, an open source Component Analysis platform that allows organizations to identify and reduce risk in the software supply chain. Due to the common practice of providing vulnerability details in markdown format, the Dependency-Track frontend renders them using the JavaScript library Showdown. Showdown does not have any XSS countermeasures built in, and versions before 4.6.1 of the Dependency-Track frontend did not encode or sanitize Showdown's output. This made it possible for arbitrary JavaScript included in vulnerability details via HTML attributes to be executed in context of the frontend. Actors with the `VULNERABILITY_MANAGEMENT` permission can exploit this weakness by creating or editing a custom vulnerability and providing XSS payloads in any of the following fields: Description, Details, Recommendation, or References. The payload will be executed for users with the `VIEW_PORTFOLIO` permission when browsing to the modified vulnerability's page. Alternatively, malicious JavaScript could be introduced via any of the vulnerability databases mirrored by Dependency-Track. However, this attack vector is highly unlikely, and the maintainers of Dependency-Track are not aware of any occurrence of this happening. Note that the `Vulnerability Details` element of the `Audit Vulnerabilities` tab in the project view is not affected. The issue has been fixed in frontend version 4.6.1.", "datePublished": "2022-10-25T00:00:00", "dateUpdated": "2025-04-23T16:43:52", "baseScore": 5.4, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:L/A:N", "references": ["https://github.com/DependencyTrack/frontend/security/advisories/GHSA-c33w-pm52-mqvf", "https://nvd.nist.gov/vuln/detail/CVE-2022-39350", "https://docs.dependencytrack.org/changelog", "https://github.com/DependencyTrack/frontend", "https://github.com/showdownjs/showdown/wiki/Markdown's-XSS-Vulnerability-(and-how-to-mitigate-it)", "https://docs.dependencytrack.org/changelog/", "https://github.com/showdownjs/showdown/wiki/Markdown%27s-XSS-Vulnerability-%28and-how-to-mitigate-it%29"], "aliases": ["CVE-2022-39350", "GHSA-c33w-pm52-mqvf"], "assigner": "GitHub_M", "epss": 0.27, "enisaIdProduct": [{"id": "7f4ee842-c33c-32ac-80ac-963ceb2866bc", "product": {"name": "Frontend"}, "product_version": "< 4.6.1"}], "enisaIdVendor": [{"id": "242c2093-7e77-3fcd-a491-4765e1932f89", "vendor": {"name": "DependencyTrack"}}], "isExploited": false}