{"id": "EUVD-2022-26079", "enisaUuid": "c395e3a4-eb6f-39b3-bfde-79f4f75ed19f", "description": "A vulnerability in the packaging of Cisco Adaptive Security Device Manager (ASDM) images and the validation of those images by Cisco Adaptive Security Appliance (ASA) Software could allow an authenticated, remote attacker with administrative privileges to upload an ASDM image that contains malicious code to a device that is running Cisco ASA Software. This vulnerability is due to insufficient validation of the authenticity of an ASDM image during its installation on a device that is running Cisco ASA Software. An attacker could exploit this vulnerability by installing a crafted ASDM image on the device that is running Cisco ASA Software and then waiting for a targeted user to access that device using ASDM. A successful exploit could allow the attacker to execute arbitrary code on the machine of the targeted user with the privileges of that user on that machine. Notes: To successfully exploit this vulnerability, the attacker must have administrative privileges on the device that is running Cisco ASA Software. Potential targets are limited to users who manage the same device that is running Cisco ASA Software using ASDM. Cisco has released and will release software updates that address this vulnerability.", "datePublished": "2022-06-24T15:25:10", "dateUpdated": "2024-11-01T19:01:05", "baseScore": 9.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:C/C:H/I:H/A:H", "references": ["https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-asa-asdm-sig-NPKvwDjm", "https://www.rapid7.com/blog/post/2022/08/11/rapid7-discovered-vulnerabilities-in-cisco-asa-asdm-and-firepower-services-software/", "https://github.com/jbaines-r7/theway"], "aliases": ["CVE-2022-20829"], "assigner": "cisco", "epss": 3.44, "enisaIdProduct": [{"id": "b3533257-29d8-3a6a-b460-9a0d5b8c7afd", "product": {"name": "Cisco Adaptive Security Appliance (ASA) Software"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "124069f2-051c-346c-886a-0a2071a76b86", "vendor": {"name": "Cisco"}}], "isExploited": false}