{"id": "EUVD-2022-6662", "enisaUuid": "3bae7500-bb03-3ff3-af8b-791df930810e", "description": "Cargo is a package manager for the rust programming language. It was discovered that Cargo did not limit the amount of data extracted from compressed archives. An attacker could upload to an alternate registry a specially crafted package that extracts way more data than its size (also known as a \"zip bomb\"), exhausting the disk space on the machine using Cargo to download the package. Note that by design Cargo allows code execution at build time, due to build scripts and procedural macros. The vulnerabilities in this advisory allow performing a subset of the possible damage in a harder to track down way. Your dependencies must still be trusted if you want to be protected from attacks, as it's possible to perform the same attacks with build scripts and procedural macros. The vulnerability is present in all versions of Cargo. Rust 1.64, to be released on September 22nd, will include a fix for it. Since the vulnerability is just a more limited way to accomplish what a malicious build scripts or procedural macros can do, we decided not to publish Rust point releases backporting the security fix. Patch files are available for Rust 1.63.0 are available in the wg-security-response repository for people building their own toolchain. We recommend users of alternate registries to excercise care in which package they download, by only including trusted dependencies in their projects. Please note that even with these vulnerabilities fixed, by design Cargo allows arbitrary code execution at build time thanks to build scripts and procedural macros: a malicious dependency will be able to cause damage regardless of these vulnerabilities. crates.io implemented server-side checks to reject these kinds of packages years ago, and there are no packages on crates.io exploiting these vulnerabilities. crates.io users still need to excercise care in choosing their dependencies though, as the same concerns about build scripts and procedural macros apply here.", "datePublished": "2022-09-14T00:00:00", "dateUpdated": "2025-04-23T17:10:50", "baseScore": 4.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:R/S:U/C:N/I:N/A:H", "references": ["https://github.com/rust-lang/cargo/security/advisories/GHSA-2hvr-h6gw-qrxp", "https://nvd.nist.gov/vuln/detail/CVE-2022-36114", "https://github.com/rust-lang/cargo/commit/2b68d3c07a4a056264dc006ecb9f1354a0679cd3", "https://github.com/rust-lang/cargo/commit/d1f9553c825f6d7481453be8d58d0e7f117988a7", "https://github.com/rust-lang/cargo/commit/d87d57dbbda61754f4fab0f329a7ac520e062c46", "https://github.com/rust-lang/cargo", "https://security.gentoo.org/glsa/202210-09", "https://www.suse.com/security/cve/CVE-2022-36114.html"], "aliases": ["CVE-2022-36114", "GHSA-2hvr-h6gw-qrxp"], "assigner": "GitHub_M", "epss": 0.34, "enisaIdProduct": [{"id": "32d53e0e-1f2b-3733-aea2-7e1c24721bbd", "product": {"name": "cargo"}, "product_version": "< 0.65.0"}, {"id": "678bc972-2182-3a13-8b6e-c2a09ef292e5", "product": {"name": "cargo"}, "product_version": "= 0.66.0"}], "enisaIdVendor": [{"id": "bbfa68a8-4a10-330d-866f-4acec94ba794", "vendor": {"name": "rust-lang"}}], "isExploited": false}