{"id": "EUVD-2022-7035", "enisaUuid": "9083ced4-39d1-3432-9151-4fe947b4bedd", "description": "FlyteAdmin is the control plane for the data processing platform Flyte. Users who enable the default Flyte’s authorization server without changing the default clientid hashes will be exposed to the public internet. In an effort to make enabling authentication easier for Flyte administrators, the default configuration for Flyte Admin allows access for Flyte Propeller even after turning on authentication via a hardcoded hashed password. This password is also set on the default Flyte Propeller configmap in the various Flyte Helm charts. Users who enable auth but do not override this setting in Flyte Admin’s configuration may unbeknownst to them be allowing public traffic in by way of this default password with attackers effectively impersonating propeller. This only applies to users who have not specified the ExternalAuthorizationServer setting. Usage of an external auth server automatically turns off this default configuration and are not susceptible to this vulnerability. This issue has been addressed in version 1.1.44. Users should manually set the staticClients in the selfAuthServer section of their configuration if they intend to rely on Admin’s internal auth server. Again, users who use an external auth server are automatically protected from this vulnerability.", "datePublished": "2022-10-06T00:00:00", "dateUpdated": "2025-04-23T16:52:33", "baseScore": 4.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:N", "references": ["https://github.com/flyteorg/flyteadmin/security/advisories/GHSA-67x4-qr35-qvrm", "https://nvd.nist.gov/vuln/detail/CVE-2022-39273", "https://github.com/flyteorg/flyteadmin/pull/478", "https://github.com/flyteorg/flyteadmin/commit/281172edf55fe6800959238fc128964ead6d9101", "https://docs.flyte.org/en/latest/deployment/cluster_config/auth_setup.html#oauth2-authorization-server", "https://github.com/flyteorg/flyteadmin", "https://pkg.go.dev/vuln/GO-2022-1043"], "aliases": ["CVE-2022-39273", "GHSA-67x4-qr35-qvrm"], "assigner": "GitHub_M", "epss": 0.27, "enisaIdProduct": [{"id": "2a27c3b0-aa8f-346d-a8fb-f7034f357f4e", "product": {"name": "flyteadmin"}, "product_version": "< 1.1.44"}], "enisaIdVendor": [{"id": "ddebc679-83db-3132-9e38-e9b682a9b7c9", "vendor": {"name": "flyteorg"}}], "isExploited": false}