{"id": "EUVD-2022-2733", "enisaUuid": "31afec98-312e-3f70-a040-1a6ef5fcab7b", "description": "go-tuf is a Go implementation of The Update Framework (TUF). go-tuf does not correctly implement the client workflow for updating the metadata files for roles other than the root role. Specifically, checks for rollback attacks are not implemented correctly meaning an attacker can cause clients to install software that is older than the software which the client previously knew to be available, and may include software with known vulnerabilities. In more detail, the client code of go-tuf has several issues in regards to preventing rollback attacks: 1. It does not take into account the content of any previously trusted metadata, if available, before proceeding with updating roles other than the root role (i.e., steps 5.4.3.1 and 5.5.5 of the detailed client workflow). This means that any form of version verification done on the newly-downloaded metadata is made using the default value of zero, which always passes. 2. For both timestamp and snapshot roles, go-tuf saves these metadata files as trusted before verifying if the version of the metafiles they refer to is correct (i.e., steps 5.5.4 and 5.6.4 of the detailed client workflow). A fix is available in version 0.3.0 or newer. No workarounds are known for this issue apart from upgrading.", "datePublished": "2022-05-05T22:30:12", "dateUpdated": "2025-04-23T18:31:00", "baseScore": 8.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:U/C:H/I:H/A:H", "references": ["https://github.com/theupdateframework/go-tuf/security/advisories/GHSA-66x3-6cw3-v5gj", "https://nvd.nist.gov/vuln/detail/CVE-2022-29173", "https://github.com/theupdateframework/go-tuf/commit/ed6788e710fc3093a7ecc2d078bf734c0f200d8d", "https://github.com/theupdateframework/go-tuf", "https://pkg.go.dev/vuln/GO-2022-0444", "https://access.redhat.com/errata/RHSA-2022:5704"], "aliases": ["CVE-2022-29173", "GHSA-66x3-6cw3-v5gj"], "assigner": "GitHub_M", "epss": 0.13, "enisaIdProduct": [{"id": "97e28efd-9eb5-3d78-9a5c-962d2f780bbf", "product": {"name": "go-tuf"}, "product_version": "< 0.3.0"}], "enisaIdVendor": [{"id": "af2bd964-fd55-3132-b86e-b6f52a4291a5", "vendor": {"name": "theupdateframework"}}], "isExploited": false}