{"id": "EUVD-2022-33598", "enisaUuid": "6b7d096f-96d9-3077-9ac2-124e6067e9b4", "description": "Scylla is a real-time big data database that is API-compatible with Apache Cassandra and Amazon DynamoDB. When decompressing CQL frame received from user, Scylla assumes that user-provided uncompressed length is correct. If user provides fake length, that is greater than the real one, part of decompression buffer won't be overwritten, and will be left uninitialized. This can be exploited in several ways, depending on the privileges of the user. 1. The main exploit is that an attacker with access to CQL port, but no user account, can bypass authentication, but only if there are other legitimate clients making connections to the cluster, and they use LZ4. 2. Attacker that already has a user account on the cluster can read parts of uninitialized memory, which can contain things like passwords of other users or fragments of other queries / results, which leads to authorization bypass and sensitive information disclosure. The bug has been patched in the following versions: Scylla Enterprise: 2020.1.14, 2021.1.12, 2022.1.0. Scylla Open Source: 4.6.7, 5.0.3. Users unable to upgrade should make sure none of their drivers connect to cluster using LZ4 compression, and that Scylla CQL port is behind firewall. Additionally make sure no untrusted client can connect to Scylla, by setting up authentication and applying workarounds from previous point (firewall, no lz4 compression).", "datePublished": "2022-09-15T21:20:11", "dateUpdated": "2025-04-23T17:10:05", "baseScore": 8.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H", "references": ["https://github.com/scylladb/scylla/security/advisories/GHSA-25pq-rrqm-6fmr", "https://github.com/scylladb/scylladb/issues/11476", "https://github.com/scylladb/scylladb/commit/1c2eef384da439b0457b6d71c7e37d7268e471cb"], "aliases": ["CVE-2022-29240"], "assigner": "GitHub_M", "epss": 0.45, "enisaIdProduct": [{"id": "04dbf56b-3149-32fe-9919-173ee802503f", "product": {"name": "scylla"}, "product_version": "< 4.6.7"}, {"id": "67c1d271-e6be-3a0f-8eb4-2a5ce226356a", "product": {"name": "scylla"}, "product_version": "5.0.0, < 5.0.3"}], "enisaIdVendor": [{"id": "2e044782-94ec-3972-8ca3-7f74c1cb36b8", "vendor": {"name": "scylladb"}}], "isExploited": false}