{"id": "EUVD-2022-33576", "enisaUuid": "736adbff-65cb-3f5c-aba6-d2bafbb38132", "description": "Rubygems is a package registry used to supply software for the Ruby language ecosystem. Due to a bug in the yank action, it was possible for any RubyGems.org user to remove and replace certain gems even if that user was not authorized to do so. To be vulnerable, a gem needed: one or more dashes in its name creation within 30 days OR no updates for over 100 days At present, we believe this vulnerability has not been exploited. RubyGems.org sends an email to all gem owners when a gem version is published or yanked. We have not received any support emails from gem owners indicating that their gem has been yanked without authorization. An audit of gem changes for the last 18 months did not find any examples of this vulnerability being used in a malicious way. A deeper audit for any possible use of this exploit is ongoing, and we will update this advisory once it is complete. Using Bundler in --frozen or --deployment mode in CI and during deploys, as the Bundler team has always recommended, will guarantee that your application does not silently switch to versions created using this exploit. To audit your application history for possible past exploits, review your Gemfile.lock and look for gems whose platform changed when the version number did not change. For example, gemname-3.1.2 updating to gemname-3.1.2-java could indicate a possible abuse of this vulnerability. RubyGems.org has been patched and is no longer vulnerable to this issue as of the 5th of May 2022.", "datePublished": "2022-05-05T22:05:10", "dateUpdated": "2025-04-23T18:31:05", "baseScore": 9.9, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H", "references": ["https://github.com/rubygems/rubygems.org/security/advisories/GHSA-hccv-rwq6-vh79", "https://hackerone.com/bugs?subject=rubygems&report_id=1559856", "https://security.netapp.com/advisory/ntap-20220616-0002/"], "aliases": ["CVE-2022-29176"], "assigner": "GitHub_M", "epss": 0.7, "enisaIdProduct": [{"id": "afb66922-99cc-3e29-833b-8de75fe760dd", "product": {"name": "rubygems.org"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "775cd911-2fed-350a-a53d-46466fb0c525", "vendor": {"name": "rubygems"}}], "isExploited": false}