{"id": "EUVD-2022-41746", "enisaUuid": "041e8c56-c048-31bd-9930-28ed54bc28d3", "description": "Onedev is an open source, self-hosted Git Server with CI/CD and Kanban. During CI/CD builds, it is possible to save build artifacts for later retrieval. They can be accessed through OneDev's web UI after the successful run of a build. These artifact files are served by the webserver in the same context as the UI without any further restrictions. This leads to Cross-Site Scripting (XSS) when a user creates a build artifact that contains HTML. When accessing the artifact, the content is rendered by the browser, including any JavaScript that it contains. Since all cookies (except for the rememberMe one) do not set the HttpOnly flag, an attacker could steal the session of a victim and use it to impersonate them. To exploit this issue, attackers need to be able to modify the content of artifacts, which usually means they need to be able to modify a project's build spec. The exploitation requires the victim to click on an attacker's link. It can be used to elevate privileges by targeting admins of a OneDev instance. In the worst case, this can lead to arbitrary code execution on the server, because admins can create Server Shell Executors and use them to run any command on the server. This issue has been patched in version 7.3.0. Users are advised to upgrade. There are no known workarounds for this issue.", "datePublished": "2022-09-13T18:50:09", "dateUpdated": "2025-04-22T17:21:56", "baseScore": 5.4, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:L/I:L/A:N", "references": ["https://github.com/theonedev/onedev/security/advisories/GHSA-27fw-gv88-qrpg", "https://github.com/theonedev/onedev/commit/adb6e31476621f824fc3227a695232df830d83ab", "https://blog.sonarsource.com/onedev-remote-code-execution/"], "aliases": ["CVE-2022-39207"], "assigner": "GitHub_M", "epss": 0.47, "enisaIdProduct": [{"id": "dffd49f2-4fff-3212-bc89-945dc37df6b3", "product": {"name": "onedev"}, "product_version": "< 7.3.0"}], "enisaIdVendor": [{"id": "797c0d24-d8ea-37e0-8251-eb5db9dfd630", "vendor": {"name": "theonedev"}}], "isExploited": false}