{"id": "EUVD-2022-43253", "enisaUuid": "61711214-1fac-3da3-8e71-bd104ac57997", "description": "A program using FoundationNetworking in swift-corelibs-foundation is potentially vulnerable to CRLF ( ) injection in URLRequest headers. In this vulnerability, a client can insert one or several CRLF sequences into a URLRequest header value. When that request is sent via URLSession to an HTTP server, the server may interpret the content after the CRLF as extra headers, or even a second request. For example, consider a URLRequest to http://example.com/ with the GET method. Suppose we set the URLRequest header \"Foo\" to the value \"Bar Extra-Header: Added GET /other HTTP/1.1\". When this request is sent, it will appear to the server as two requests: GET / HTTP/1.1 Foo: Bar Extra-Header: Added GET /other HTTP/1.1 In this manner, the client is able to inject extra headers and craft an entirely new request to a separate path, despite only making one API call in URLSession. If a developer has total control over the request and its headers, this vulnerability may not pose a threat. However, this vulnerability escalates if un-sanitized user input is placed in header values. If so, a malicious user could inject new headers or requests to an intermediary or backend server. Developers should be especially careful to sanitize user input in this case, or upgrade their version of swift-corelibs-foundation to include the patch below.", "datePublished": "2023-01-20T00:00:00", "dateUpdated": "2025-04-02T16:07:17", "baseScore": 8.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H", "references": ["https://github.com/apple/swift-corelibs-foundation/security/advisories/GHSA-4pp3-mpf2-rj63"], "aliases": ["CVE-2022-3918"], "assigner": "Swift", "epss": 0.12, "enisaIdProduct": [{"id": "ca10ef32-b2b5-330b-a84e-48ecb1b4dad9", "product": {"name": "Swift Foundation"}, "product_version": "unspecified ≤5.7.2"}], "enisaIdVendor": [{"id": "8170c495-2a04-31c6-9bee-0f46e6d86fb6", "vendor": {"name": "Swift Project"}}], "isExploited": false}