{"id": "EUVD-2022-0125", "enisaUuid": "f4e445ac-e9a0-3284-b6fd-1f355bdac6e9", "description": "indy-node is the server portion of Hyperledger Indy, a distributed ledger purpose-built for decentralized identity. In vulnerable versions of indy-node, an attacker can max out the number of client connections allowed by the ledger, leaving the ledger unable to be used for its intended purpose. However, the ledger content will not be impacted and the ledger will resume functioning after the attack. This attack exploits the trade-off between resilience and availability. Any protection against abusive client connections will also prevent the network being accessed by certain legitimate users. As a result, validator nodes must tune their firewall rules to ensure the right trade-off for their network's expected users. The guidance to network operators for the use of firewall rules in the deployment of Indy networks has been modified to better protect against denial of service attacks by increasing the cost and complexity in mounting such attacks. The mitigation for this vulnerability is not in the Hyperledger Indy code per se, but rather in the individual deployments of Indy. The mitigations should be applied to all deployments of Indy, and are not related to a particular release.", "datePublished": "2022-09-09T19:10:10", "dateUpdated": "2025-04-23T17:12:25", "baseScore": 7.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H", "references": ["https://github.com/hyperledger/indy-node/security/advisories/GHSA-x996-7qh9-7ff7", "https://github.com/hyperledger/indy-node/commit/53a2a1bf1a26cb8ba710fd6adc8bcf275186a4b3", "https://nvd.nist.gov/vuln/detail/CVE-2022-31006", "https://github.com/hyperledger/indy-node/commits/v1.13.2-rc2", "https://github.com/pypa/advisory-database/tree/main/vulns/indy-node/PYSEC-2022-270.yaml"], "aliases": ["CVE-2022-31006", "GHSA-x996-7qh9-7ff7", "PYSEC-2022-270"], "assigner": "GitHub_M", "epss": 0.72, "enisaIdProduct": [{"id": "d6ca561a-4b3b-32b5-b01a-70a0c96ab569", "product": {"name": "indy-node"}, "product_version": "≤ 1.12.6"}], "enisaIdVendor": [{"id": "79d8308d-e118-33cc-9297-1966adc189de", "vendor": {"name": "Hyperledger"}}], "isExploited": false}