{"id": "EUVD-2022-28116", "enisaUuid": "7d8eac8e-8629-3938-bf3b-c2b4912b70b0", "description": "Western Digital has identified a weakness in the UFS standard that could result in a security vulnerability. This vulnerability may exist in some systems where the Host boot ROM code implements the UFS Boot feature to boot from UFS compliant storage devices. The UFS Boot feature, as specified in the UFS standard, is provided by UFS devices to support platforms that need to download the system boot loader from external non-volatile storage locations. Several scenarios have been identified in which adversaries may disable the boot capability, or revert to an old boot loader code, if the host boot ROM code is improperly implemented. UFS Host Boot ROM implementers may be impacted by this vulnerability. UFS devices are only impacted when connected to a vulnerable UFS Host and are not independently impacted by this vulnerability. When present, the vulnerability is in the UFS Host implementation and is not a vulnerability in Western Digital UFS Devices. Western Digital has provided details of the vulnerability to the JEDEC standards body, multiple vendors of host processors, and software solutions providers.", "datePublished": "2023-01-23T00:00:00", "dateUpdated": "2025-04-01T19:56:07", "baseScore": 8.7, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:C/C:N/I:H/A:H", "references": ["https://www.westerndigital.com/support/product-security/wdc-23001-host-boot-rom-code-vulnerability-in-systems-implementing-ufs-boot-feature", "https://documents.westerndigital.com/content/dam/doc-library/en_us/assets/public/western-digital/collateral/white-paper/white-paper-host-boot-rom-code-vulnerability-and-mitigation.pdf"], "aliases": ["CVE-2022-23005"], "assigner": "WDC PSIRT", "epss": 0.16, "enisaIdProduct": [{"id": "965b8fba-6c85-3696-b4e0-94d7602e9898", "product": {"name": "NA"}, "product_version": "NA"}], "enisaIdVendor": [{"id": "4cc5af5a-32f0-31e6-92e6-a67166d7f758", "vendor": {"name": "NA"}}], "isExploited": false}