{"id": "EUVD-2022-6468", "enisaUuid": "e783e8fd-d1fd-3a67-b91a-95badbe62fb3", "description": "kirby is a content management system (CMS) that adapts to many different projects and helps you build your own ideal interface. Cross-site scripting (XSS) is a type of vulnerability that allows execution of any kind of JavaScript code inside the Panel session of the same or other users. In the Panel, a harmful script can for example trigger requests to Kirby's API with the permissions of the victim. If bad actors gain access to your group of authenticated Panel users they can escalate their privileges via the Panel session of an admin user. Depending on your site, other JavaScript-powered attacks are possible. The multiselect field allows selection of tags from an autocompleted list. Unfortunately, the Panel in Kirby 3.5 used HTML rendering for the raw option value. This allowed **attackers with influence on the options source** to store HTML code. The browser of the victim who visited a page with manipulated multiselect options in the Panel will then have rendered this malicious HTML code when the victim opened the autocomplete dropdown. Users are *not* affected by this vulnerability if you don't use the multiselect field or don't use it with options that can be manipulated by attackers. The problem has been patched in Kirby 3.5.8.1.", "datePublished": "2022-08-29T17:35:09", "dateUpdated": "2025-04-23T17:47:26", "baseScore": 5.9, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:N/S:U/C:H/I:L/A:N", "references": ["https://github.com/getkirby/kirby/security/advisories/GHSA-3f89-869f-5w76", "https://nvd.nist.gov/vuln/detail/CVE-2022-36037", "https://github.com/getkirby/kirby/commit/b5b8863885e17556abc070dde1e20aec15fbfdf5", "https://github.com/getkirby/kirby", "https://github.com/getkirby/kirby/releases/tag/3.5.8.1"], "aliases": ["CVE-2022-36037", "GHSA-3f89-869f-5w76"], "assigner": "GitHub_M", "epss": 0.63, "enisaIdProduct": [{"id": "48521efd-436d-3493-b76d-c191b77d575e", "product": {"name": "kirby"}, "product_version": "< 3.5.8.1"}], "enisaIdVendor": [{"id": "7baf85c5-075d-3c68-b747-87af051608d4", "vendor": {"name": "getkirby"}}], "isExploited": false}