{"id": "EUVD-2022-33584", "enisaUuid": "8af22916-981e-345c-83e0-e1e0072af392", "description": "github-action-merge-dependabot is an action that automatically approves and merges dependabot pull requests (PRs). Prior to version 3.2.0, github-action-merge-dependabot does not check if a commit created by dependabot is verified with the proper GPG key. There is just a check if the actor is set to `dependabot[bot]` to determine if the PR is a legit PR. Theoretically, an owner of a seemingly valid and legit action in the pipeline can check if the PR is created by dependabot and if their own action has enough permissions to modify the PR in the pipeline. If so, they can modify the PR by adding a second seemingly valid and legit commit to the PR, as they can set arbitrarily the username and email in for commits in git. Because the bot only checks if the actor is valid, it would pass the malicious changes through and merge the PR automatically, without getting noticed by project maintainers. It would probably not be possible to determine where the malicious commit came from, as it would only say `dependabot[bot]` and the corresponding email-address. Version 3.2.0 contains a patch for this issue.", "datePublished": "2022-05-31T16:10:10", "dateUpdated": "2025-04-23T18:21:19", "baseScore": 6.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:N", "references": ["https://github.com/fastify/github-action-merge-dependabot/security/advisories/GHSA-v5vr-h3xq-8v6w", "https://github.com/fastify/github-action-merge-dependabot/commit/309f39539c5d918d8a47075587aa8720a9c127f7", "https://hackerone.com/bugs?report_id=1564530"], "aliases": ["CVE-2022-29220"], "assigner": "GitHub_M", "epss": 0.08, "enisaIdProduct": [{"id": "5308fcd4-96bf-3e21-9db9-25823eb84697", "product": {"name": "github-action-merge-dependabot"}, "product_version": "< 3.2.0"}], "enisaIdVendor": [{"id": "605b926f-c9b6-3deb-a2d7-0227c097d57f", "vendor": {"name": "fastify"}}], "isExploited": false}