{"id": "EUVD-2022-41769", "enisaUuid": "1e744fc7-6c34-3da9-a7d9-17657363533f", "description": "Matrix iOS SDK allows developers to build iOS apps compatible with Matrix. Prior to version 0.23.19, an attacker cooperating with a malicious homeserver can construct messages appearing to have come from another person. Such messages will be marked with a grey shield on some platforms, but this may be missing in others. This attack is possible due to the matrix-ios-sdk implementing a too permissive key forwarding strategy. The default policy for accepting key forwards has been made more strict in the matrix-ios-sdk version 0.23.19. matrix-ios-sdk will now only accept forwarded keys in response to previously issued requests and only from own, verified devices. The SDK now sets a `trusted` flag on the decrypted message upon decryption, based on whether the key used to decrypt the message was received from a trusted source. Clients need to ensure that messages decrypted with a key with `trusted = false` are decorated appropriately (for example, by showing a warning for such messages). This attack requires coordination between a malicious home server and an attacker, so those who trust their home servers do not need a workaround.", "datePublished": "2022-09-28T20:55:10", "dateUpdated": "2025-04-23T16:54:28", "baseScore": 7.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N", "references": ["https://matrix.org/blog/2022/09/28/upgrade-now-to-address-encryption-vulns-in-matrix-sdks-and-clients", "https://github.com/matrix-org/matrix-ios-sdk/commit/5ca86c328a5faaab429c240551cb9ca8f0f6262c", "https://github.com/matrix-org/matrix-ios-sdk/releases/tag/v0.23.19", "https://github.com/matrix-org/matrix-ios-sdk/security/advisories/GHSA-qxr3-5jmq-xcf4"], "aliases": ["CVE-2022-39257"], "assigner": "GitHub_M", "epss": 0.25, "enisaIdProduct": [{"id": "ef9d1828-5904-386e-a6aa-bf4af8a82efa", "product": {"name": "matrix-ios-sdk"}, "product_version": "< 0.23.19"}], "enisaIdVendor": [{"id": "3291c1ab-7374-3dfe-9c7b-ae35d79c9c86", "vendor": {"name": "matrix-org"}}], "isExploited": false}