{"id": "EUVD-2022-52791", "enisaUuid": "31e2a0da-3887-3263-82e3-5a7ae31583c6", "description": "The Omron SYSMAC Cx product family PLCs (CS series, CJ series, and CP series) through 2022-05-18 lack cryptographic authentication. They utilize the Omron FINS (9600/TCP) protocol for engineering purposes, including downloading projects and control logic to the PLC. This protocol has authentication flaws as reported in FSCT-2022-0057. Control logic is downloaded to PLC volatile memory using the FINS Program Area Read and Program Area Write commands or to non-volatile memory using other commands from where it can be loaded into volatile memory for execution. The logic that is loaded into and executed from the user program area exists in compiled object code form. Upon execution, these object codes are first passed to a dedicated ASIC that determines whether the object code is to be executed by the ASIC or the microprocessor. In the former case, the object code is interpreted by the ASIC whereas in the latter case the object code is passed to the microprocessor for object code interpretation by a ROM interpreter. In the abnormal case where the object code cannot be handled by either, an abnormal condition is triggered and the PLC is halted. The logic that is downloaded to the PLC does not seem to be cryptographically authenticated, thus allowing an attacker to manipulate transmitted object code to the PLC and either execute arbitrary object code commands on the ASIC or on the microprocessor interpreter.", "datePublished": "2022-07-26T21:28:46", "dateUpdated": "2024-08-03T07:11:39", "baseScore": 9.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H", "references": ["https://www.forescout.com/blog/", "https://www.cisa.gov/uscert/ics/advisories/icsa-22-179-02"], "aliases": ["CVE-2022-31207"], "assigner": "mitre", "epss": 0.08, "enisaIdProduct": [{"id": "99ee2301-b69a-37c0-8e0c-800dee124905", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "0e49a8e5-f2fd-34d7-950b-fe1a518e0a6f", "vendor": {"name": "n/a"}}], "isExploited": false}