{"id": "EUVD-2022-6732", "enisaUuid": "e87d2872-b418-3730-8290-a11891f40408", "description": "Talos Linux is a Linux distribution built for Kubernetes deployments. Talos worker nodes use a join token to get accepted into the Talos cluster. Due to improper validation of the request while signing a worker node CSR (certificate signing request) Talos control plane node might issue Talos API certificate which allows full access to Talos API on a control plane node. Accessing Talos API with full level access on a control plane node might reveal sensitive information which allows full level access to the cluster (Kubernetes and Talos PKI, etc.). Talos API join token is stored in the machine configuration on the worker node. When configured correctly, Kubernetes workloads don't have access to the machine configuration, but due to a misconfiguration workload might access the machine configuration and reveal the join token. This problem has been fixed in Talos 1.2.2. Enabling the Pod Security Standards mitigates the vulnerability by denying hostPath mounts and host networking by default in the baseline policy. Clusters that don't run untrusted workloads are not affected. Clusters with correct Pod Security configurations which don't allow hostPath mounts, and secure access to cloud metadata server (or machine configuration is not supplied via cloud metadata server) are not affected.", "datePublished": "2022-09-13T17:05:10", "dateUpdated": "2025-04-23T17:11:50", "baseScore": 7.2, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:H/A:H", "references": ["https://github.com/siderolabs/talos/security/advisories/GHSA-7hgc-php5-77qq", "https://nvd.nist.gov/vuln/detail/CVE-2022-36103", "https://github.com/siderolabs/talos/commit/9eaf33f3f274e746ca1b442c0a1a0dae0cec088f", "https://github.com/siderolabs/talos", "https://github.com/siderolabs/talos/releases/tag/v1.2.2"], "aliases": ["CVE-2022-36103", "GHSA-7hgc-php5-77qq"], "assigner": "GitHub_M", "epss": 0.26, "enisaIdProduct": [{"id": "0645aad0-fe8d-3e09-9e20-850595bd8d2c", "product": {"name": "talos"}, "product_version": "< 1.2.2"}], "enisaIdVendor": [{"id": "2b8978c6-a5d3-3ed8-ac9b-431c303ec3a2", "vendor": {"name": "siderolabs"}}], "isExploited": false}