{"id": "EUVD-2022-6862", "enisaUuid": "6b122219-a44f-3236-adcd-0d30d89f680d", "description": "JOSE is \"JSON Web Almost Everything\" - JWA, JWS, JWE, JWT, JWK, JWKS with no dependencies using runtime's native crypto in Node.js, Browser, Cloudflare Workers, Electron, and Deno. The PBKDF2-based JWE key management algorithms expect a JOSE Header Parameter named `p2c` PBES2 Count, which determines how many PBKDF2 iterations must be executed in order to derive a CEK wrapping key. The purpose of this parameter is to intentionally slow down the key derivation function in order to make password brute-force and dictionary attacks more expensive. This makes the PBES2 algorithms unsuitable for situations where the JWE is coming from an untrusted source: an adversary can intentionally pick an extremely high PBES2 Count value, that will initiate a CPU-bound computation that may take an unreasonable amount of time to finish. Under certain conditions, it is possible to have the user's environment consume unreasonable amount of CPU time. The impact is limited only to users utilizing the JWE decryption APIs with symmetric secrets to decrypt JWEs from untrusted parties who do not limit the accepted JWE Key Management Algorithms (`alg` Header Parameter) using the `keyManagementAlgorithms` (or `algorithms` in v1.x) decryption option or through other means. The `v1.28.2`, `v2.0.6`, `v3.20.4`, and `v4.9.2` releases limit the maximum PBKDF2 iteration count to `10000` by default. It is possible to adjust this limit with a newly introduced `maxPBES2Count` decryption option. If users are unable to upgrade their required library version, they have two options depending on whether they expect to receive JWEs using any of the three PBKDF2-based JWE key management algorithms. They can use the `keyManagementAlgorithms` decryption option to disable accepting PBKDF2 altogether, or they can inspect the JOSE Header prior to using the decryption API and limit the PBKDF2 iteration count (`p2c` Header Parameter).", "datePublished": "2022-09-07T21:55:09", "dateUpdated": "2025-04-22T17:23:31", "baseScore": 5.3, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:L", "references": ["https://github.com/panva/jose/security/advisories/GHSA-jv3g-j58f-9mq9", "https://nvd.nist.gov/vuln/detail/CVE-2022-36083", "https://github.com/panva/jose/commit/03d6d013bf6e070e85adfe5731f526978e3e8e4d", "https://github.com/panva/jose", "https://github.com/panva/jose/releases/tag/v4.9.2"], "aliases": ["CVE-2022-36083", "GHSA-jv3g-j58f-9mq9"], "assigner": "GitHub_M", "epss": 0.39, "enisaIdProduct": [{"id": "429dc40a-2f3d-377a-b7ba-d26103f21e66", "product": {"name": "jose"}, "product_version": "4.0, < 4.9.2"}, {"id": "5eb5f08c-baee-3268-8008-143ddb40da6f", "product": {"name": "jose"}, "product_version": "2.0, < 2.0.6"}, {"id": "9cf219a6-5cac-352f-afab-c88dde7ab113", "product": {"name": "jose"}, "product_version": "3.0, < 3.20.4"}, {"id": "ae9361da-cc1e-3c34-b7d2-fec0a5255286", "product": {"name": "jose"}, "product_version": "1.0, < 1.28.2"}], "enisaIdVendor": [{"id": "201b3596-5ace-399e-ba09-c4e79292c883", "vendor": {"name": "panva"}}], "isExploited": false}