{"id": "EUVD-2022-6017", "enisaUuid": "7edeb053-b152-3f34-a10a-a728a6df6b98", "description": "Bleve is a text indexing library for go. Bleve includes HTTP utilities under bleve/http package, that are used by its sample application. These HTTP methods pave way for exploitation of a node’s filesystem where the bleve index resides, if the user has used bleve’s own HTTP (bleve/http) handlers for exposing the access to the indexes. For instance, the CreateIndexHandler (`http/index_create.go`) and DeleteIndexHandler (`http/index_delete.go`) enable an attacker to create a bleve index (directory structure) anywhere where the user running the server has the write permissions and to delete recursively any directory owned by the same user account. Users who have used the bleve/http package for exposing access to bleve index without the explicit \nhandling for the Role Based Access Controls(RBAC) of the index assets would be impacted by this issue. Version 2.5.0 relocated the `http/` dir used _only_ by bleve-explorer to `blevesearch/bleve-explorer`, thereby addressing the issue. However, the http package is purely intended to be used for demonstration purposes. Bleve was never designed handle the RBACs, nor it was ever advertised to be used in that way. The collaborators of this project have decided to stay away from adding any authentication or authorization to bleve project at the moment. The bleve/http package is mainly for demonstration purposes and it lacks exhaustive validation of the user inputs as well as any authentication and authorization measures. It is recommended to not use bleve/http in production use cases.", "datePublished": "2022-06-01T19:45:12", "dateUpdated": "2025-05-08T13:44:47", "baseScore": 6.2, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N", "references": ["https://github.com/blevesearch/bleve/security/advisories/GHSA-9w9f-6mg8-jp7w", "https://nvd.nist.gov/vuln/detail/CVE-2022-31022", "https://github.com/blevesearch/bleve/commit/1c7509d6a17d36f265c90b4e8f4e3a3182fe79ff", "https://pkg.go.dev/vuln/GO-2022-0470", "github.com/blevesearch/bleve", "https://github.com/blevesearch/bleve/commit/af9e3111dadfedf9d30f0448506b4a57fecc8550"], "aliases": ["CVE-2022-31022", "GHSA-9w9f-6mg8-jp7w"], "assigner": "GitHub_M", "epss": 0.14, "enisaIdProduct": [{"id": "2d174a42-1df3-3ddc-826a-b04ca889f13d", "product": {"name": "bleve"}, "product_version": "0.1.0, < 2.5.0"}, {"id": "6dd3322d-18dd-3b21-acc6-14360c40afe1", "product": {"name": "bleve"}, "product_version": "0.1.0"}], "enisaIdVendor": [{"id": "83d03ee6-68b0-3c10-a68c-a02a7016cb10", "vendor": {"name": "blevesearch"}}], "isExploited": false}