{"id": "EUVD-2022-6774", "enisaUuid": "1598ecfd-1bd4-3598-a265-eeb270db62d6", "description": "Delayed TLS hostname verification in the Pulsar Java Client and the Pulsar Proxy make each client vulnerable to a man in the middle attack. Connections from the Pulsar Java Client to the Pulsar Broker/Proxy and connections from the Pulsar Proxy to the Pulsar Broker are vulnerable. Authentication data is sent before verifying the server’s TLS certificate matches the hostname, which means authentication data could be exposed to an attacker. An attacker can only take advantage of this vulnerability by taking control of a machine 'between' the client and the server. The attacker must then actively manipulate traffic to perform the attack by providing the client with a cryptographically valid certificate for an unrelated host. Because the client sends authentication data before performing hostname verification, an attacker could gain access to the client’s authentication data. The client eventually closes the connection when it verifies the hostname and identifies the targeted hostname does not match a hostname on the certificate. Because the client eventually closes the connection, the value of the intercepted authentication data depends on the authentication method used by the client. Token based authentication and username/password authentication methods are vulnerable because the authentication data can be used to impersonate the client in a separate session. This issue affects Apache Pulsar Java Client versions 2.7.0 to 2.7.4; 2.8.0 to 2.8.3; 2.9.0 to 2.9.2; 2.10.0; 2.6.4 and earlier.", "datePublished": "2022-09-23T09:25:13", "dateUpdated": "2024-08-03T08:09:22", "baseScore": 5.9, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:N/A:N", "references": ["https://nvd.nist.gov/vuln/detail/CVE-2022-33681", "https://github.com/apache/pulsar/tree/db26073728bf86fc80deecaece2dc02b50bbb9b5/pulsar-client", "https://lists.apache.org/thread/fpo6x10trvn20hlk0dmnr5vlz5v4kl3d"], "aliases": ["CVE-2022-33681", "GHSA-c5fp-x2h5-vjv7"], "assigner": "apache", "epss": 0.08, "enisaIdProduct": [{"id": "20d73c86-ae18-3998-aea8-b816a7265572", "product": {"name": "Apache Pulsar"}, "product_version": "2.7 ≤2.7.4"}, {"id": "4c13487d-0174-342c-b577-6d9c9bf5cc9e", "product": {"name": "Apache Pulsar"}, "product_version": "2.10.0"}, {"id": "d4c6c1ac-8d52-323c-9234-a9b3ccb69cb8", "product": {"name": "Apache Pulsar"}, "product_version": "2.9 ≤2.9.2"}, {"id": "f6b512fb-685b-368c-8339-982e1b5238c2", "product": {"name": "Apache Pulsar"}, "product_version": "2.8 ≤2.8.3"}, {"id": "f826cb2f-06e2-3354-b788-2f2568c42cab", "product": {"name": "Apache Pulsar"}, "product_version": "2.6 and earlier ≤2.6.4"}], "enisaIdVendor": [{"id": "3a208f24-9317-3a65-8c22-028d50f5320e", "vendor": {"name": "Apache Software Foundation"}}], "isExploited": false}