{"id": "EUVD-2022-15239", "enisaUuid": "5ab0962e-458c-32d6-a204-7d8cb34017cb", "description": "An information exposure vulnerability exists in the Palo Alto Networks GlobalProtect app on Windows and MacOS where the credentials of the local user account are sent to the GlobalProtect portal when the Single Sign-On feature is enabled in the GlobalProtect portal configuration. This product behavior is intentional and poses no security risk when connecting to trusted GlobalProtect portals configured to use the same Single Sign-On credentials both for the local user account as well as the GlobalProtect login. However when the credentials are different, the local account credentials are inadvertently sent to the GlobalProtect portal for authentication. A third party MITM type of attacker cannot see these credentials in transit. This vulnerability is a concern where the GlobalProtect app is deployed on Bring-your-Own-Device (BYOD) type of clients with private local user accounts or GlobalProtect app is used to connect to different organizations. Fixed versions of GlobalProtect app have an app setting to prevent the transmission of the user's local user credentials to the target GlobalProtect portal regardless of the portal configuration. This issue impacts: GlobalProtect app 5.1 versions earlier than GlobalProtect app 5.1.10 on Windows and MacOS; GlobalProtect app 5.2 versions earlier than GlobalProtect app 5.2.9 on Windows and MacOS This issue does not affect GlobalProtect app on other platforms.", "datePublished": "2022-02-10T18:10:20", "dateUpdated": "2024-09-16T23:36:47", "baseScore": 6.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:R/S:C/C:H/I:N/A:N", "references": ["https://security.paloaltonetworks.com/CVE-2022-0018"], "aliases": ["CVE-2022-0018"], "assigner": "palo_alto", "epss": 0.25, "enisaIdProduct": [{"id": "218da3bc-0c70-3a3d-b4c0-ca357d24d35f", "product": {"name": "GlobalProtect App"}, "product_version": "5.1 <5.1.10"}, {"id": "c579360b-58d7-3eaf-bb55-cdb65bef2b59", "product": {"name": "GlobalProtect App"}, "product_version": "5.2 <5.2.9"}], "enisaIdVendor": [{"id": "458cc38f-b222-3123-9776-9431f96d6346", "vendor": {"name": "Palo Alto Networks"}}], "isExploited": false}