{"id": "EUVD-2022-47680", "enisaUuid": "5baac5c3-26e7-3158-8f9c-4bcadb628c58", "description": "A directory traversal vulnerability in the ZIP archive extraction routines of KNIME Server since 4.3.0 can result in arbitrary files being overwritten on the server's file system. This vulnerability is also known as 'Zip-Slip'.\n\n\n\n\n\nAn attacker can create a KNIME workflow that, when being uploaded, can overwrite arbitrary files that the operating system user running the KNIME Server process has write access to. The user must be authenticated and have permissions to upload files to KNIME Server.\n\n\nThis can impact data integrity (file contents are changed) or cause errors in other software (vital files being corrupted). It can even lead to remote code execution if executable files are being replaced and subsequently executed by the KNIME Server process user. In all cases the attacker has to know the location of files on the server's file system, though.\n\nNote that users that have permissions to upload workflows usually also have permissions to run them on the KNIME Server and can therefore already execute arbitrary code in the context of the KNIME Executor's operating system user.\n\nThere is no workaround to prevent this vulnerability from being exploited. Updates to fixed versions 4.13.6, 4.14.3, or 4.15.3 are advised.\n\n\n", "datePublished": "2022-11-24T06:36:23", "dateUpdated": "2025-04-25T18:00:24", "baseScore": 7.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:L", "references": ["https://www.knime.com/security/advisories"], "aliases": ["CVE-2022-44748"], "assigner": "KNIME", "epss": 4.78, "enisaIdProduct": [{"id": "0d761295-5169-3fa8-b56d-131b3dd8d8ef", "product": {"name": "KNIME Server"}, "product_version": "4.15.0 <4.15.3"}, {"id": "29763c89-bec5-3d95-9466-9073de669eeb", "product": {"name": "KNIME Server"}, "product_version": "4.3.0 <4.13.6"}, {"id": "fc153da0-4084-300a-8507-4ea527849ba1", "product": {"name": "KNIME Server"}, "product_version": "4.14.0 <4.14.3"}], "enisaIdVendor": [{"id": "6402d6b5-ad5f-34fe-ad34-20ed882a36b7", "vendor": {"name": "KNIME"}}], "isExploited": false}