{"id": "EUVD-2022-6189", "enisaUuid": "8b494e9d-3433-36af-9590-f00c3f308b71", "description": "Weave GitOps is a simple open source developer platform for people who want cloud native applications, without needing Kubernetes expertise. A vulnerability in the logging of Weave GitOps could allow an authenticated remote attacker to view sensitive cluster configurations, aka KubeConfg, of registered Kubernetes clusters, including the service account tokens in plain text from Weave GitOps's pod logs on the management cluster. An unauthorized remote attacker can also view these sensitive configurations from external log storage if enabled by the management cluster. This vulnerability is due to the client factory dumping cluster configurations and their service account tokens when the cluster manager tries to connect to an API server of a registered cluster, and a connection error occurs. An attacker could exploit this vulnerability by either accessing logs of a pod of Weave GitOps, or from external log storage and obtaining all cluster configurations of registered clusters. A successful exploit could allow the attacker to use those cluster configurations to manage the registered Kubernetes clusters. This vulnerability has been fixed by commit 567356f471353fb5c676c77f5abc2a04631d50ca. Users should upgrade to Weave GitOps core version v0.8.1-rc.6 or newer. There is no known workaround for this vulnerability.", "datePublished": "2022-06-27T22:05:11", "dateUpdated": "2025-04-23T18:06:33", "baseScore": 9.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:H/I:H/A:H", "references": ["https://github.com/weaveworks/weave-gitops/security/advisories/GHSA-xggc-qprg-x6mw", "https://nvd.nist.gov/vuln/detail/CVE-2022-31098", "https://github.com/weaveworks/weave-gitops/commit/567356f471353fb5c676c77f5abc2a04631d50ca", "https://github.com/weaveworks/weave-gitops"], "aliases": ["CVE-2022-31098", "GHSA-xggc-qprg-x6mw"], "assigner": "GitHub_M", "epss": 0.4, "enisaIdProduct": [{"id": "716aa50c-42fa-3df3-a1ed-2d2da2da0893", "product": {"name": "weave-gitops"}, "product_version": "< 0.8.1-rc.6"}], "enisaIdVendor": [{"id": "f5b2582a-5e0e-3ce9-bca4-563f24c4e330", "vendor": {"name": "weaveworks"}}], "isExploited": false}