{"id": "EUVD-2022-46521", "enisaUuid": "c9121756-3250-3a04-b05e-a2a6017c7314", "description": "Multiple vulnerabilities in the web-based management interface of Aruba EdgeConnect Enterprise Orchestrator could allow an authenticated remote attacker to conduct SQL injection attacks against the Aruba EdgeConnect Enterprise Orchestrator instance. An attacker could exploit these vulnerabilities to obtain and modify sensitive information in the underlying database potentially leading to complete compromise of the Aruba EdgeConnect Enterprise Orchestrator host in Aruba EdgeConnect Enterprise Orchestration Software version(s): Aruba EdgeConnect Enterprise Orchestrator (on-premises), Aruba EdgeConnect Enterprise Orchestrator-as-a-Service, Aruba EdgeConnect Enterprise Orchestrator-SP and Aruba EdgeConnect Enterprise Orchestrator Global Enterprise Tenant Orchestrators - Orchestrator 9.2.1.40179 and below, - Orchestrator 9.1.4.40436 and below, - Orchestrator 9.0.7.40110 and below, - Orchestrator 8.10.23.40015 and below, - Any older branches of Orchestrator not specifically mentioned.\n\n", "datePublished": "2023-01-03T19:15:26", "dateUpdated": "2024-08-03T13:32:59", "baseScore": 8.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H", "references": ["https://www.arubanetworks.com/assets/alert/ARUBA-PSA-2022-021.txt"], "aliases": ["CVE-2022-43523"], "assigner": "hpe", "epss": 0.51, "enisaIdProduct": [{"id": "1a6a5f96-2564-3e9c-961c-1d4589d60918", "product": {"name": "Aruba EdgeConnect Enterprise Orchestration Software"}, "product_version": "Aruba EdgeConnect Enterprise Orchestrator (on-premises), Aruba EdgeConnect Enterprise Orchestrator-as-a-Service, Aruba EdgeConnect Enterprise Orchestrator-SP and Aruba EdgeConnect Enterprise Orchestrator Global Enterprise Tenant Orchestrators - Orchestrator 9.2.1.40179 and below, - Orchestrator 9.1.4.40436 and below, - Orchestrator 9.0.7.40110 and below, - Orchestrator 8.10.23.40015 and below, - Any older branches of Orchestrator not specifically mentioned."}], "enisaIdVendor": [{"id": "b7f5d43c-9403-3a3b-a5d6-4f8edf5abe4d", "vendor": {"name": "Hewlett Packard Enterprise (HPE)"}}], "isExploited": false}