{"id": "EUVD-2023-41368", "enisaUuid": "d7751f50-e7f3-3558-8a3d-01724bbf9ebe", "description": "Open Enclave is a hardware-agnostic open source library for developing applications that utilize Hardware-based Trusted Execution Environments, also known as Enclaves. There are two issues that are mitigated in version 0.19.3. First, Open Enclave SDK does not properly sanitize the `MXCSR` register on enclave entry. This makes applications vulnerable to MXCSR Configuration Dependent Timing (MCDT) attacks, where incorrect `MXCSR` values can impact instruction retirement by at most one cycle, depending on the (secret) data operand value. Please find more details in the guidance from Intel in the references. Second, Open Enclave SDK does not sanitize x86's alignment check flag `RFLAGS.AC` on enclave entry. This opens up the possibility for a side-channel attacker to be notified for every unaligned memory access performed by the enclave. The issue has been addressed in version 0.19.3 and the current master branch. Users will need to recompile their applications against the patched libraries to be protected from this vulnerability. There are no known workarounds for this vulnerability.", "datePublished": "2023-07-17T22:13:39", "dateUpdated": "2024-10-10T18:58:56", "baseScore": 5.3, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:R/S:U/C:N/I:H/A:N", "references": ["https://github.com/openenclave/openenclave/security/advisories/GHSA-5gfr-m6mx-p5w4", "https://github.com/openenclave/openenclave/commit/ca54623333875b9beaad92c999a92b015c44b079", "https://www.intel.com/content/www/us/en/developer/articles/technical/software-security-guidance/best-practices/mxcsr-configuration-dependent-timing.html"], "aliases": ["CVE-2023-37479"], "assigner": "GitHub_M", "epss": 0.25, "enisaIdProduct": [{"id": "51e687ca-9550-3eff-884a-256e576e455d", "product": {"name": "openenclave"}, "product_version": "< 0.19.3"}], "enisaIdVendor": [{"id": "50342128-f76d-32f0-8b00-36900b4225d9", "vendor": {"name": "openenclave"}}], "isExploited": false}