{"id": "EUVD-2023-48036", "enisaUuid": "c4c002e3-687d-3fd6-8b35-8a913670f535", "description": "\n\n\nIn EVE OS, the “measured boot” mechanism prevents a compromised device from accessing\nthe encrypted data located in the vault.\n\nAs per the “measured boot” design, the PCR values calculated at different stages of the boot\nprocess will change if any of their respective parts are changed.\n\nThis includes, among other things, the configuration of the bios, grub, the kernel cmdline,\ninitrd, and more.\n\nHowever, this mechanism does not validate the entire rootfs, so an attacker can edit the\nfilesystem and gain control over the system.\n\nAs the default filesystem used by EVE OS is squashfs, this is somewhat harder than an ext4,\nwhich is easily changeable.\n\nThis will not stop an attacker, as an attacker can repackage the squashfs with their changes\nin it and replace the partition altogether.\n\nThis can also be done directly on the device, as the “003-storage-init” container contains the\n“mksquashfs” and “unsquashfs” binaries (with the corresponding libs).\n\n\n\n\n\n\n\nAn attacker can gain full control over the device without changing the PCR values, thus not\ntriggering the “measured boot” mechanism, and having full access to the vault.\n\n\n\nNote:\n\nThis issue was partially fixed in these commits (after disclosure to Zededa), where the config\npartition measurement was added to PCR13:\n\n• aa3501d6c57206ced222c33aea15a9169d629141\n\n• 5fef4d92e75838cc78010edaed5247dfbdae1889.\n\nThis issue was made viable in version 9.0.0 when the calculation was moved to PCR14 but it was not included in the measured boot.", "datePublished": "2023-09-20T14:50:17", "dateUpdated": "2024-09-24T18:32:54", "baseScore": 8.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H", "references": ["https://asrg.io/security-advisories/cve-2023-43636/"], "aliases": ["CVE-2023-43636"], "assigner": "ASRG", "epss": 0.02, "enisaIdProduct": [{"id": "2e037caa-fe3f-37eb-9bf1-b5caa0bd2e4e", "product": {"name": "EVE OS"}, "product_version": "0 <8.6.0"}, {"id": "a7e84b86-a880-342c-b261-86d9e20357a6", "product": {"name": "EVE OS"}, "product_version": "9.0.0 <9.5.0"}], "enisaIdVendor": [{"id": "91d17920-46aa-30bb-b664-13fc6a11e0b5", "vendor": {"name": " LF-Edge, Zededa"}}], "isExploited": false}