{"id": "EUVD-2023-0093", "enisaUuid": "83d71707-a6ac-34d5-abc9-419b575b00eb", "description": "Home assistant is an open source home automation. The audit team’s analyses confirmed that the `redirect_uri` and `client_id` are alterable when logging in. Consequently, the code parameter utilized to fetch the `access_token` post-authentication will be sent to the URL specified in the aforementioned parameters. Since an arbitrary URL is permitted and `homeassistant.local` represents the preferred, default domain likely used and trusted by many users, an attacker could leverage this weakness to manipulate a user and retrieve account access. Notably, this attack strategy is plausible if the victim has exposed their Home Assistant to the Internet, since after acquiring the victim’s `access_token` the adversary would need to utilize it directly towards the instance to achieve any pertinent malicious actions. To achieve this compromise attempt, the attacker must send a link with a `redirect_uri` that they control to the victim’s own Home Assistant instance. In the eventuality the victim authenticates via said link, the attacker would obtain code sent to the specified URL in `redirect_uri`, which can then be leveraged to fetch an `access_token`. Pertinently, an attacker could increase the efficacy of this strategy by registering a near identical domain to `homeassistant.local`, which at first glance may appear legitimate and thereby obfuscate any malicious intentions. This issue has been addressed in version 2023.9.0 and all users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2023-10-20T03:15:00", "dateUpdated": "2023-10-26T11:24:24", "baseScore": 4.3, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:N/A:N", "references": ["https://www.home-assistant.io/blog/2023/10/19/security-audits-of-home-assistant/", "https://github.com/home-assistant/core/security/advisories/GHSA-qhhj-7hrc-gqj5", "https://nvd.nist.gov/vuln/detail/CVE-2023-41893", "https://github.com/pypa/advisory-database/tree/main/vulns/homeassistant/PYSEC-2023-214.yaml"], "aliases": ["CVE-2023-41893", "GHSA-qhhj-7hrc-gqj5", "PYSEC-2023-214"], "assigner": "GitHub_M", "epss": 0.19, "enisaIdProduct": [{"id": "699f5d5a-2766-3edb-ac26-9ada3237894c", "product": {"name": "core"}, "product_version": "< 2023.9.0"}], "enisaIdVendor": [{"id": "9c0aedb9-0a05-35d7-b7ed-729880a339b3", "vendor": {"name": "home-assistant"}}], "isExploited": false}