{"id": "EUVD-2023-2255", "enisaUuid": "0b4e4d32-b339-30a0-9c81-e3099ed2c701", "description": "SES is a JavaScript environment that allows safe execution of arbitrary programs in Compartments. In version 0.18.0 prior to 0.18.7, 0.17.0 prior to 0.17.1, 0.16.0 prior to 0.16.1, 0.15.0 prior to 0.15.24, 0.14.0 prior to 0.14.5, an 0.13.0 prior to 0.13.5, there is a hole in the confinement of guest applications under SES that may manifest as either the ability to exfiltrate information or execute arbitrary code depending on the configuration and implementation of the surrounding host.\n\nGuest program running inside a Compartment with as few as no endowments can gain access to the surrounding host’s dynamic import by using dynamic import after the spread operator, like `{...import(arbitraryModuleSpecifier)}`.\n\nOn the web or in web extensions, a Content-Security-Policy following ordinary best practices likely mitigates both the risk of exfiltration and execution of arbitrary code, at least limiting the modules that the attacker can import to those that are already part of the application. However, without a Content-Security-Policy, dynamic import can be used to issue HTTP requests for either communication through the URL or for the execution of code reachable from that origin.\n\nWithin an XS worker, an attacker can use the host’s module system to the extent that the host has been configured. This typically only allows access to module code on the host’s file system and is of limited use to an attacker.\n\nWithin Node.js, the attacker gains access to Node.js’s module system. Importing the powerful builtins is not useful except insofar as there are side-effects and tempered because dynamic import returns a promise. Spreading a promise into an object renders the promises useless. However, Node.js allows importing data URLs, so this is a clear path to arbitrary execution.\n\nVersions 0.18.7, 0.17.1, 0.16.1, 0.15.24, 0.14.5, and 0.13.5 contain a patch for this issue. Some workarounds are available. On the web, providing a suitably constrained Content-Security-Policy mitigates most of the threat. With XS, building a binary that lacks the ability to load modules at runtime mitigates the entirety of the threat. That will look like an implementation of `fxFindModule` in a file like `xsPlatform.c` that calls `fxRejectModuleFile`.", "datePublished": "2023-08-08T16:51:26", "dateUpdated": "2024-10-10T18:39:02", "baseScore": 9.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H", "references": ["https://github.com/endojs/endo/security/advisories/GHSA-9c4h-3f7h-322r", "https://nvd.nist.gov/vuln/detail/CVE-2023-39532", "https://github.com/endojs/endo/commit/fc90c6429604dc79ce8e3355e236ccce2bada041", "https://github.com/endojs/endo"], "aliases": ["CVE-2023-39532", "GHSA-9c4h-3f7h-322r"], "assigner": "GitHub_M", "epss": 1.36, "enisaIdProduct": [{"id": "0a2898e7-66ee-396a-8ca1-3a883d9fc745", "product": {"name": "endo"}, "product_version": "0.14.0, < 0.14.5"}, {"id": "36e13e5a-81c1-3da0-a1e5-df65ad78d741", "product": {"name": "endo"}, "product_version": "= 0.16.0"}, {"id": "630278fc-b699-3dd8-8009-de47d2475059", "product": {"name": "endo"}, "product_version": "0.15.0, < 0.15.24"}, {"id": "750798a2-1a13-3668-89f8-5dbe08ae3009", "product": {"name": "endo"}, "product_version": "0.18.0, < 0.18.7"}, {"id": "9f8ac0d5-f028-3898-9d1d-89eb75b1ed84", "product": {"name": "endo"}, "product_version": "0.13.0, < 0.13.5"}, {"id": "a71065e9-6584-32fd-810c-5e4841f062c3", "product": {"name": "endo"}, "product_version": "= 0.17.0"}], "enisaIdVendor": [{"id": "c6c8520b-b912-3f37-ab5b-d3ec0b58bb49", "vendor": {"name": "endojs"}}], "isExploited": false}