{"id": "EUVD-2023-2155", "enisaUuid": "bfc05c49-2021-3e46-a466-eacbff414973", "description": "CometBFT is a Byzantine Fault Tolerant (BFT) middleware that takes a state transition machine and replicates it on many machines. The mempool maintains two data structures to keep track of outstanding transactions: a list and a map.\nThese two data structures are supposed to be in sync all the time in the sense that the map tracks the index (if any) of the transaction in the list. In `v0.37.0`, and `v0.37.1`, as well as in `v0.34.28`, and all previous releases of the CometBFT repo2, it is possible to have them out of sync. When this happens, the list may contain several copies of the same transaction. Because the map tracks a single index, it is then no longer possible to remove all the copies of the transaction from the list. This happens even if the duplicated transaction is later committed in a block. The only way to remove the transaction is by restarting the node.\n\nThe above problem can be repeated on and on until a sizable number of transactions are stuck in the mempool, in order to try to bring down the target node. The problem is fixed in releases `v0.34.29` and `v0.37.2`. Some workarounds are available. Increasing the value of `cache_size` in `config.toml` makes it very difficult to effectively attack a full node. Not exposing the transaction submission RPC's would mitigate the probability of a successful attack, as the attacker would then have to create a modified (byzantine) full node to be able to perform the attack via p2p.", "datePublished": "2023-07-03T16:35:37", "dateUpdated": "2024-11-22T16:43:45", "baseScore": 8.2, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:L/A:H", "references": ["https://github.com/cometbft/cometbft/security/advisories/GHSA-w24w-wp77-qffm", "https://nvd.nist.gov/vuln/detail/CVE-2023-34451", "https://github.com/cometbft/cometbft/pull/890", "https://github.com/tendermint/tendermint/pull/2778", "https://github.com/cometbft/cometbft"], "aliases": ["CVE-2023-34451", "GHSA-w24w-wp77-qffm"], "assigner": "GitHub_M", "epss": 0.24, "enisaIdProduct": [{"id": "62b2977b-a6ed-3f43-a69d-f992930e462a", "product": {"name": "cometbft"}, "product_version": "0.37.0, < 0.37.2"}, {"id": "b82fe921-abe5-3770-89e7-9b8d95493b9a", "product": {"name": "cometbft"}, "product_version": "< 0.34.29"}], "enisaIdVendor": [{"id": "d91bc670-86e5-3311-a3d6-a9746d686978", "vendor": {"name": "cometbft"}}], "isExploited": false}