{"id": "EUVD-2023-0935", "enisaUuid": "7710d2db-8bb0-37d1-be30-ce07dbb08700", "description": "Snappier is a high performance C# implementation of the Snappy compression algorithm. This is a buffer overrun vulnerability that can affect any user of Snappier 1.1.0. In this release, much of the code was rewritten to use byte references rather than pointers to pinned buffers. This change generally improves performance and reduces workload on the garbage collector. However, when the garbage collector performs compaction and rearranges memory, it must update any byte references on the stack to refer to the updated location. The .NET garbage collector can only update these byte references if they still point within the buffer or to a point one byte past the end of the buffer. If they point outside this area, the buffer itself may be moved while the byte reference stays the same. There are several places in 1.1.0 where byte references very briefly point outside the valid areas of buffers. These are at locations in the code being used for buffer range checks. While the invalid references are never dereferenced directly, if a GC compaction were to occur during the brief window when they are on the stack then it could invalidate the buffer range check and allow other operations to overrun the buffer.  This should be very difficult for an attacker to trigger intentionally. It would require a repetitive bulk attack with the hope that a GC compaction would occur at precisely the right moment during one of the requests. However, one of the range checks with this problem is a check based on input data in the decompression buffer, meaning malformed input data could be used to increase the chance of success. Note that any resulting buffer overrun is likely to cause access to protected memory, which will then cause an exception and the process to be terminated. Therefore, the most likely result of an attack is a denial of service. This issue has been patched in release 1.1.1. Users are advised to upgrade. Users unable to upgrade may pin buffers to a fixed location before using them for compression or decompression to mitigate some, but not all, of these cases. At least one temporary decompression buffer is internal to the library and never pinned.\n", "datePublished": "2023-03-27T20:43:20", "dateUpdated": "2025-02-18T21:11:44", "baseScore": 7.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:L/I:L/A:H", "references": ["https://github.com/brantburnett/Snappier/security/advisories/GHSA-838x-pcvx-6p5w", "https://nvd.nist.gov/vuln/detail/CVE-2023-28638", "https://github.com/brantburnett/Snappier/pull/73", "https://github.com/brantburnett/Snappier/commit/d7ac5267b5b18439e6d108f8138edf48c436b32f", "https://github.com/brantburnett/Snappier", "https://github.com/brantburnett/Snappier/releases/tag/release%2F1.1.1"], "aliases": ["CVE-2023-28638", "GHSA-838x-pcvx-6p5w"], "assigner": "GitHub_M", "epss": 0.56, "enisaIdProduct": [{"id": "ba16c968-72a6-30fe-9385-aa6927689674", "product": {"name": "Snappier"}, "product_version": "= 1.1.0"}], "enisaIdVendor": [{"id": "624c439d-ce92-3082-b0e5-652219ab6719", "vendor": {"name": "brantburnett"}}], "isExploited": false}