{"id": "EUVD-2023-3206", "enisaUuid": "f74a83d2-bb22-37b4-a2e0-f5e039a8c1e6", "description": "Grackle is a GraphQL server written in functional Scala, built on the Typelevel stack. The GraphQL specification requires that GraphQL fragments must not form cycles, either directly or indirectly. Prior to Grackle version 0.18.0, that requirement wasn't checked, and queries with cyclic fragments would have been accepted for type checking and compilation. The attempted compilation of such fragments would result in a JVM `StackOverflowError` being thrown. Some knowledge of an applications GraphQL schema would be required to construct such a query, however no knowledge of any application-specific performance or other behavioural characteristics would be needed.\n\nGrackle uses the cats-parse library for parsing GraphQL queries. Prior to version 0.18.0, Grackle made use of the cats-parse `recursive` operator. However, `recursive` is not currently stack safe. `recursive` was used in three places in the parser: nested selection sets, nested input values (lists and objects), and nested list type declarations. Consequently, queries with deeply nested selection sets, input values or list types could be constructed which exploited this, causing a JVM `StackOverflowException` to be thrown during parsing. Because this happens very early in query processing, no specific knowledge of an applications GraphQL schema would be required to construct such a query.\n\nThe possibility of small queries resulting in stack overflow is a potential denial of service vulnerability. This potentially affects all applications using Grackle which have untrusted users. Both stack overflow issues have been resolved in the v0.18.0 release of Grackle. As a workaround, users could interpose a sanitizing layer in between untrusted input and Grackle query processing.", "datePublished": "2023-12-22T20:36:11", "dateUpdated": "2024-08-02T22:16:47", "baseScore": 7.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H", "references": ["https://github.com/typelevel/grackle/security/advisories/GHSA-g56x-7j6w-g8r8", "https://nvd.nist.gov/vuln/detail/CVE-2023-50730", "https://github.com/typelevel/grackle/commit/56e244b91659cf385df590fc6c46695b6f36cbfd", "https://github.com/typelevel/grackle", "https://github.com/typelevel/grackle/releases/tag/v0.18.0"], "aliases": ["CVE-2023-50730", "GHSA-g56x-7j6w-g8r8"], "assigner": "GitHub_M", "epss": 0.52, "enisaIdProduct": [{"id": "7f231ff3-5502-3945-9f7d-4d3970ff6b48", "product": {"name": "grackle"}, "product_version": "< 0.18.0"}], "enisaIdVendor": [{"id": "5565e8cb-7d7a-3b76-a10f-49213290d7b5", "vendor": {"name": "typelevel"}}], "isExploited": false}