{"id": "EUVD-2023-2447", "enisaUuid": "14160533-7b89-3dca-9171-f7fa6357f27f", "description": "Argo CD is a declarative continuous deployment framework for Kubernetes. In Argo CD versions prior to 2.3 (starting at least in v0.1.0, but likely in any version using Helm before 2.3), using a specifically-crafted Helm file could reference external Helm charts handled by the same repo-server to leak values, or files from the referenced Helm Chart. This was possible because Helm paths were predictable. The vulnerability worked by adding a Helm chart that referenced Helm resources from predictable paths. Because the paths of Helm charts were predictable and available on an instance of repo-server, it was possible to reference and then render the values and resources from other existing Helm charts regardless of permissions. While generally, secrets are not stored in these files, it was nevertheless possible to reference any values from these charts. This issue was fixed in Argo CD 2.3 and subsequent versions by randomizing Helm paths. User's still using Argo CD 2.3 or below are advised to update to a supported version. If this is not possible, disabling Helm chart rendering, or using an additional repo-server for each Helm chart would prevent possible exploitation.", "datePublished": "2023-09-27T20:43:01", "dateUpdated": "2024-09-20T19:34:30", "baseScore": 5.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:L/I:N/A:N", "references": ["https://github.com/argoproj/argo-cd/security/advisories/GHSA-63qx-x74g-jcr7", "https://github.com/argoproj/argo-cd/security/advisories/GHSA-6jqw-jwf5-rp8h", "https://nvd.nist.gov/vuln/detail/CVE-2023-40026", "https://argo-cd.readthedocs.io/en/stable/operator-manual/installation/#supported-versions", "https://github.com/argoproj/argo-cd"], "aliases": ["CVE-2023-40026", "GHSA-6jqw-jwf5-rp8h"], "assigner": "GitHub_M", "epss": 0.21, "enisaIdProduct": [{"id": "bea0e5b0-0d1b-361b-bf2f-eb1085d126a0", "product": {"name": "argo-cd"}, "product_version": "< 2.3"}], "enisaIdVendor": [{"id": "a0df16a2-0c7e-3367-a28e-606531fd3495", "vendor": {"name": "argoproj"}}], "isExploited": false}