{"id": "EUVD-2023-0242", "enisaUuid": "2aca200f-1afc-3419-8186-da0ff3fd2a6f", "description": "SQLFluff is a SQL linter. Prior to version 2.1.2, in environments where untrusted users have access to the config files, there is a potential security vulnerability where those users could use the `library_path` config value to allow arbitrary python code to be executed via macros. For many users who use SQLFluff in the context of an environment where all users already have fairly escalated privileges, this may not be an issue - however in larger user bases, or where SQLFluff is bundled into another tool where developers still wish to give users access to supply their on rule configuration, this may be an issue.\\n\\nThe 2.1.2 release offers the ability for the `library_path` argument to be overwritten on the command line by using the `--library-path` option. This overrides any values provided in the config files and effectively prevents this route of attack for users which have access to the config file, but not to the scripts which call the SQLFluff CLI directly. A similar option is provided for the Python API, where users also have a greater ability to further customise or override configuration as necessary. Unless `library_path` is explicitly required, SQLFluff maintainers recommend using the option `--library-path none` when invoking SQLFluff which will disable the `library-path` option entirely regardless of the options set in the configuration file or via inline config directives. As a workaround, limiting access to - or otherwise validating configuration files before they are ingested by SQLFluff will provides a similar effect and does not require upgrade.", "datePublished": "2023-07-06T07:15:00", "dateUpdated": "2023-07-14T12:23:24", "baseScore": 6.3, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:L/I:L/A:L", "references": ["https://github.com/sqlfluff/sqlfluff/security/advisories/GHSA-jqhc-m2j3-fjrx", "https://github.com/sqlfluff/sqlfluff/security/advisories/GHSA-jqhc-m2j3-fjrx", "https://github.com/sqlfluff/sqlfluff/releases/tag/2.1.2", "https://nvd.nist.gov/vuln/detail/CVE-2023-36830", "https://github.com/sqlfluff/sqlfluff/commit/6cdc38d76bedab4801b035c04d3c2b3aea17de86", "https://github.com/pypa/advisory-database/tree/main/vulns/sqlfluff/PYSEC-2023-111.yaml"], "aliases": ["CVE-2023-36830", "GHSA-jqhc-m2j3-fjrx", "PYSEC-2023-111"], "assigner": "GitHub_M", "epss": 0.14, "enisaIdProduct": [{"id": "87b488e5-8e2d-3ccc-b51b-a29ccad0a58d", "product": {"name": "sqlfluff"}, "product_version": "< 2.1.2"}], "enisaIdVendor": [{"id": "e51dcb2c-90f2-3125-ac8d-2b2f073f544a", "vendor": {"name": "sqlfluff"}}], "isExploited": false}