{"id": "EUVD-2023-48035", "enisaUuid": "e3d21443-013a-30c3-84d7-4834504c4894", "description": "\nVault Key Sealed With SHA1 PCRs\n\n\n\n\n\n\nThe measured boot solution implemented in EVE OS leans on a PCR locking mechanism.\n\nDifferent parts of the system update different PCR values in the TPM, resulting in a unique\nvalue for each PCR entry.\n\nThese PCRs are then used in order to seal/unseal a key from the TPM which is used to\nencrypt/decrypt the “vault” directory.\n\nThis “vault” directory is the most sensitive point in the system and as such, its content should\nbe protected.\n\nThis mechanism is noted in Zededa’s documentation as the “measured boot” mechanism,\ndesigned to protect said “vault”.\n\nThe code that’s responsible for generating and fetching the key from the TPM assumes that\nSHA256 PCRs are used in order to seal/unseal the key, and as such their presence is being\nchecked.\n\nThe issue here is that the key is not sealed using SHA256 PCRs, but using SHA1 PCRs.\nThis leads to several issues:\n\n• Machines that have their SHA256 PCRs enabled but SHA1 PCRs disabled, as well\nas not sealing their keys at all, meaning the “vault” is not protected from an attacker.\n\n• SHA1 is considered insecure and reduces the complexity level required to unseal the\nkey in machines which have their SHA1 PCRs enabled.\n\n\n\nAn attacker can very easily retrieve the contents of the “vault”, which will effectively render\nthe “measured boot” mechanism meaningless.\n\n\n\n\n\n", "datePublished": "2023-09-20T14:58:07", "dateUpdated": "2024-09-25T14:37:39", "baseScore": 8.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H", "references": ["https://asrg.io/security-advisories/cve-2023-43635/"], "aliases": ["CVE-2023-43635"], "assigner": "ASRG", "epss": 0.01, "enisaIdProduct": [{"id": "b73d5dde-6509-3c20-8292-840aeb7502fa", "product": {"name": "EVE OS"}, "product_version": "0 <9.5.0"}], "enisaIdVendor": [{"id": "b7adde79-a230-38d3-a215-dcdfafe2d113", "vendor": {"name": " LF-Edge, Zededa"}}], "isExploited": false}