{"id": "EUVD-2023-43720", "enisaUuid": "751e657e-67a6-3cbf-aac5-90031f1d0e76", "description": "Insufficient authentication in the MQTT backend (broker) allows an attacker to access and even manipulate the telemetry data of the entire fleet of vehicles using the HopeChart HQT-401 telematics unit. Other models are possibly affected too.\n\n\n\n\n\n\n\n\nMultiple vulnerabilities were identified:\n\n\n\n- The MQTT backend does not require authentication, allowing unauthorized connections from an attacker.\n\n\n\n- The vehicles publish their telemetry data (e.g. GPS Location, speed, odometer, fuel, etc) as messages in public topics. The backend also sends commands to the vehicles as MQTT posts in public topics. As a result, an attacker can access the confidential data of the entire fleet that is managed by the backend.\n\n\n\n- The MQTT messages sent by the vehicles or the backend are not encrypted or authenticated. An attacker can create and post messages to impersonate a vehicle or the backend. The attacker could then, for example, send incorrect information to the backend about the vehicle's location.\n\n\n\n- The backend can inject data into a vehicle´s CAN bus by sending a specific MQTT message on a public topic. Because these messages are not authenticated or encrypted, an attacker could impersonate the backend, create a fake message and inject CAN data in any vehicle managed by the backend.\n\n\nThe confirmed version is 201808021036, however further versions have been also identified as potentially impacted.\n\n\n\n", "datePublished": "2023-06-01T05:34:48", "dateUpdated": "2025-01-10T18:45:46", "baseScore": 8.6, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:L/I:L/A:H", "references": ["https://asrg.io/security-advisories/cve-2023-3028/"], "aliases": ["CVE-2023-3028"], "assigner": "ASRG", "epss": 0.04, "enisaIdProduct": [{"id": "463e7db2-bf69-37a1-bd94-62f84ae80e3c", "product": {"name": "HQT401"}, "product_version": "201808021036"}], "enisaIdVendor": [{"id": "939154b5-cab9-3b68-9477-16a5837706ee", "vendor": {"name": "Hangzhou Hopechart IoT Technology Co., Ltd."}}], "isExploited": false}