{"id": "EUVD-2023-29919", "enisaUuid": "429cef27-49a5-3b65-97b3-43b0854f224d", "description": "Gentoo soko is the code that powers packages.gentoo.org. Versions prior to 1.0.1 are vulnerable to SQL Injection, leading to a Denial of Service. If the user selects (in user preferences) the \"Recently Visited Packages\" view for the index page, the value of the `search_history` cookie is used as a base64 encoded comma separated list of atoms. These are string loaded directly into the SQL query with `atom = '%s'` format string. As a result, any user can modify the browser's cookie value and inject most SQL queries. A proof of concept malformed cookie was generated that wiped the database or changed it's content. On the database, only public data is stored, so there is no confidentiality issues to site users. If it is known that the database was modified, a full restoration of data is possible by performing a full database wipe and performing full update of all components. This issue is patched with commit id 5ae9ca83b73. Version 1.0.1 contains the patch. If users are unable to upgrade immediately, the following workarounds may be applied: (1.) Use a proxy to always drop the `search_history` cookie until upgraded. The impact on user experience is low. (2.) Sanitize to the value of `search_history` cookie after base64 decoding it.", "datePublished": "2023-02-24T23:29:36", "dateUpdated": "2024-08-02T11:39:06", "baseScore": 7.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:N", "references": ["https://github.com/gentoo/soko/security/advisories/GHSA-gp8g-jfq9-5q2g", "https://gitweb.gentoo.org/sites/soko.git/commit/?id=5ae9ca83b735804f2bd405592983a73d7fcc42f4"], "aliases": ["CVE-2023-26033"], "assigner": "GitHub_M", "epss": 0.25, "enisaIdProduct": [{"id": "b5fd0e4c-5627-31be-aa96-22d686d9b80e", "product": {"name": "soko"}, "product_version": "< 1.0.1"}], "enisaIdVendor": [{"id": "4a156c30-4521-3624-97d8-a1ce15a73336", "vendor": {"name": "gentoo"}}], "isExploited": false}