{"id": "EUVD-2023-42474", "enisaUuid": "43a0a4e3-f069-30d7-a905-571ab6b58bf5", "description": "Logistics Pipes is a modification (a.k.a. mod) for the computer game Minecraft Java Edition. The mod used Java's `ObjectInputStream#readObject` on untrusted data coming from clients or servers over the network resulting in possible remote code execution when sending specifically crafted network packets after connecting. The affected versions were released between 2013 and 2016 and the issue (back then unknown) was fixed in 2016 by a refactoring of the network IO code.  \nThe issue is present in all Logistics Pipes versions ranged from 0.7.0.91 prior to 0.10.0.71, which were downloaded from different platforms summing up to multi-million downloads. For Minecraft version 1.7.10 the issue was fixed in build 0.10.0.71. Everybody on Minecraft 1.7.10 should check their version number of Logistics Pipes in their modlist and update, if the version number is smaller than 0.10.0.71. Any newer supported Minecraft version (like 1.12.2) never had a Logistics Pipes version with vulnerable code. The best available workaround for vulnerable versions is to play in singleplayer only or update to newer Minecraft versions and modpacks.", "datePublished": "2023-08-04T16:21:24", "dateUpdated": "2024-10-10T15:59:28", "baseScore": 8.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:N/S:U/C:H/I:H/A:H", "references": ["https://github.com/RS485/LogisticsPipes/security/advisories/GHSA-mcp7-xf3v-25x3", "https://github.com/RS485/LogisticsPipes/commit/39a90b8f2d1a2bcc512ec68c3e139f1dac07aa56", "https://github.com/RS485/LogisticsPipes/commit/527c4f4fb028e9afab29d4e639935010ad7be9e7"], "aliases": ["CVE-2023-38689"], "assigner": "GitHub_M", "epss": 3.32, "enisaIdProduct": [{"id": "333c5f24-acd2-3df2-b55f-14d953b33f35", "product": {"name": "LogisticsPipes"}, "product_version": "0.7.0.91, < 0.10.0.71"}], "enisaIdVendor": [{"id": "3b1efec7-39ed-3492-8d9a-69fb4f56be00", "vendor": {"name": "RS485"}}], "isExploited": false}