{"id": "EUVD-2023-1000", "enisaUuid": "042235f9-557d-3b50-9a5d-4389d7604fe3", "description": "A credential-leak issue was discovered in related Veracode products before 2023-03-27. Veracode Scan Jenkins Plugin before 23.3.19.0, when configured for remote agent jobs, invokes the Veracode Java API Wrapper in a manner that allows local users (with OS-level access of the Jenkins remote) to discover Veracode API credentials by listing the process and its arguments. Veracode Scan Jenkins Plugin before 23.3.19.0, when configured for remote agent jobs and when the \"Connect using proxy\" option is enabled and configured with proxy credentials, allows local users of the Jenkins remote to discover proxy credentials by listing the process and its arguments. Veracode Azure DevOps Extension before 3.20.0 invokes the Veracode Java API Wrapper in a manner that allows local users (with OS-level access to the Azure DevOps Services cloud infrastructure or Azure DevOps Server) to discover Veracode API credentials by listing the process and its arguments. Veracode Azure DevOps Extension before 3.20.0, when configured with proxy credentials, allows users (with shell access to the Azure DevOps Services cloud infrastructure or Azure DevOps Server) to discover proxy credentials by listing the process and its arguments.", "datePublished": "2023-03-28T00:00:00", "dateUpdated": "2025-02-19T18:30:26", "baseScore": 5.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:N/A:N", "references": ["https://nvd.nist.gov/vuln/detail/CVE-2023-25722", "https://community.veracode.com/s/global-search/CVE-2023-25722", "https://docs.veracode.com/updates/r/c_all_int#veracode-jenkins-plugin-233190", "https://github.com/jenkinsci/veracode-scan-plugin", "https://veracode.com"], "aliases": ["CVE-2023-25722", "GHSA-fjrv-vx9m-4jpj"], "assigner": "mitre", "epss": 0.05, "enisaIdProduct": [{"id": "12cade63-4dab-3019-9027-81777ac115fd", "product": {"name": "n/a"}, "product_version": "n/a"}], "enisaIdVendor": [{"id": "60674971-4975-39d7-ad9d-7f87f135fe81", "vendor": {"name": "n/a"}}], "isExploited": false}