{"id": "EUVD-2023-31172", "enisaUuid": "aedd53d4-4ab7-38d8-b7fe-19f30c5dfb03", "description": "FINS (Factory Interface Network Service) is a message communication protocol, which is designed to be used in closed FA (Factory Automation) networks, and is used in FA networks composed of OMRON products. Multiple OMRON products that implement FINS protocol contain following security issues -- (1)Plaintext communication, and (2)No authentication required. When FINS messages are intercepted, the contents may be retrieved. When arbitrary FINS messages are injected, any commands may be executed on, or the system information may be retrieved from, the affected device. Affected products and versions are as follows: SYSMAC CS-series CPU Units, all versions, SYSMAC CJ-series CPU Units, all versions, SYSMAC CP-series CPU Units, all versions, SYSMAC NJ-series CPU Units, all versions, SYSMAC NX1P-series CPU Units, all versions, SYSMAC NX102-series CPU Units, all versions, and SYSMAC NX7 Database Connection CPU Units (Ver.1.16 or later)", "datePublished": "2023-06-19T00:00:00", "dateUpdated": "2024-12-24T16:45:20", "baseScore": 9.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H", "references": ["https://www.us-cert.gov/ics/advisories/icsa-19-346-02", "https://www.ia.omron.com/product/vulnerability/OMSR-2023-003_en.pdf", "https://www.fa.omron.co.jp/product/vulnerability/OMSR-2023-003_ja.pdf", "https://jvn.jp/en/ta/JVNTA91513661/", "https://jvn.jp/ta/JVNTA91513661/", "https://www.us-cert.gov/ics/advisories/icsa-20-063-03", "https://www.cisa.gov/uscert/ics/advisories/icsa-22-179-02"], "aliases": ["CVE-2023-27396"], "assigner": "jpcert", "epss": 1.54, "enisaIdProduct": [{"id": "031936a7-8d61-3072-b82b-e94f44343acf", "product": {"name": "Multiple OMRON products which implement FINS protocol"}, "product_version": "SYSMAC CS-series CPU Units all versions, SYSMAC CJ-series CPU Units all versions, SYSMAC CP-series CPU Units all versions, SYSMAC NJ-series CPU Units all versions, SYSMAC NX1P-series CPU Units all versions, SYSMAC NX102-series CPU Units all versions, and SYSMAC NX7 Database Connection CPU Units Ver.1.16 or later"}], "enisaIdVendor": [{"id": "37e492c4-35e0-3ec8-90b1-b96e39ec71f8", "vendor": {"name": "OMRON Corporation"}}], "isExploited": false}