{"id": "EUVD-2023-53715", "enisaUuid": "5c7cf248-7bd8-3fe2-a04a-6c9f7aff9515", "description": "Uptime Kuma is an easy-to-use self-hosted monitoring tool. Prior to version 1.23.9, the application uses WebSocket (with Socket.io), but it does not verify that the source of communication is valid. This allows third-party website to access the application on behalf of their client. When connecting to the server using Socket.IO, the server does not validate the `Origin` header leading to other site being able to open connections to the server and communicate with it. Other websites still need to authenticate to access most features, however this can be used to circumvent firewall protections made in place by people deploying the application.\n\nWithout origin validation, Javascript executed from another origin would be allowed to connect to the application without any user interaction. Without login credentials, such a connection is unable to access protected endpoints containing sensitive data of the application. However, such a connection may allow attacker to further exploit unseen vulnerabilities of the application. Users with \"No-auth\" mode configured who are relying on a reverse proxy or firewall to provide protection to the application would be especially vulnerable as it would grant the attacker full access to the application.\n\nIn version 1.23.9, additional verification of the HTTP Origin header has been added to the socket.io connection handler. By default, if the `Origin` header is present, it would be checked against the Host header. Connection would be denied if the hostnames do not match, which would indicate that the request is cross-origin. Connection would be allowed if the `Origin` header is not present. Users can override this behavior by setting environment variable `UPTIME_KUMA_WS_ORIGIN_CHECK=bypass`.", "datePublished": "2023-12-11T22:37:04", "dateUpdated": "2024-08-02T22:01:26", "baseScore": 6.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:H/I:L/A:L", "references": ["https://github.com/louislam/uptime-kuma/security/advisories/GHSA-mj22-23ff-2hrr", "https://github.com/louislam/uptime-kuma/commit/2815cc73cfd9d8ced889e00e72899708220d184f"], "aliases": ["CVE-2023-49805"], "assigner": "GitHub_M", "epss": 0.01, "enisaIdProduct": [{"id": "49bf565c-30a5-3fbc-900b-6099c2a47196", "product": {"name": "uptime-kuma"}, "product_version": "<  1.23.9"}], "enisaIdVendor": [{"id": "8c9b188f-52b9-3fbb-9140-6ec6f436825f", "vendor": {"name": "louislam"}}], "isExploited": false}