{"id": "EUVD-2023-53277", "enisaUuid": "c4688aaf-18ad-3f86-bd92-d1547569401f", "description": "fish is a smart and user-friendly command line shell for macOS, Linux, and the rest of the family. fish shell uses certain Unicode non-characters internally for marking wildcards and expansions. It will incorrectly allow these markers to be read on command substitution output, rather than transforming them into a safe internal representation. While this may cause unexpected behavior with direct input (for example, echo \\UFDD2HOME has the same output as echo $HOME), this may become a minor security problem if the output is being fed from an external program into a command substitution where this output may not be expected. This design flaw was introduced in very early versions of fish, predating the version control system, and is thought to be present in every version of fish released in the last 15 years or more, although with different characters. Code execution does not appear to be possible, but denial of service (through large brace expansion) or information disclosure (such as variable expansion) is potentially possible under certain circumstances. fish shell 3.6.2 has been released to correct this issue. Users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2023-12-04T23:46:35", "dateUpdated": "2025-02-13T17:18:37", "baseScore": 3.9, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:L/UI:R/S:U/C:L/I:N/A:L", "references": ["https://github.com/fish-shell/fish-shell/security/advisories/GHSA-2j9r-pm96-wp4f", "https://github.com/fish-shell/fish-shell/commit/09986f5563e31e2c900a606438f1d60d008f3a14", "http://www.openwall.com/lists/oss-security/2023/12/08/1"], "aliases": ["CVE-2023-49284"], "assigner": "GitHub_M", "epss": 0.12, "enisaIdProduct": [{"id": "e8de928a-f2ea-3c26-b1de-d3815ff2cf3d", "product": {"name": "fish-shell"}, "product_version": "< 3.6.2"}], "enisaIdVendor": [{"id": "1a79e634-6b57-3c37-be3b-962d6c4a66db", "vendor": {"name": "fish-shell"}}], "isExploited": false}