{"id": "EUVD-2023-3044", "enisaUuid": "533d0e74-fb85-36c7-abfc-a7f4d5840847", "description": "Cosign is a sigstore signing tool for OCI containers. Cosign is susceptible to a denial of service by an attacker controlled registry. An attacker who controls a remote registry can return a high number of attestations and/or signatures to Cosign and cause Cosign to enter a long loop resulting in an endless data attack. The root cause is that Cosign loops through all attestations fetched from the remote registry in pkg/cosign.FetchAttestations. The attacker needs to compromise the registry or make a request to a registry they control. When doing so, the attacker must return a high number of attestations in the response to Cosign. The result will be that the attacker can cause Cosign to go into a long or infinite loop that will prevent other users from verifying their data. In Kyvernos case, an attacker whose privileges are limited to making requests to the cluster can make a request with an image reference to their own registry, trigger the infinite loop and deny other users from completing their admission requests. Alternatively, the attacker can obtain control of the registry used by an organization and return a high number of attestations instead the expected number of attestations. The issue can be mitigated rather simply by setting a limit to the limit of attestations that Cosign will loop through. The limit does not need to be high to be within the vast majority of use cases and still prevent the endless data attack. This issue has been patched in version 2.2.1 and users are advised to upgrade.", "datePublished": "2023-11-07T17:30:25", "dateUpdated": "2024-09-04T15:23:23", "baseScore": 3.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:N/UI:R/S:U/C:N/I:N/A:L", "references": ["https://github.com/sigstore/cosign/security/advisories/GHSA-vfp6-jrw2-99g9", "https://nvd.nist.gov/vuln/detail/CVE-2023-46737", "https://github.com/sigstore/cosign/pull/3364", "https://github.com/sigstore/cosign/commit/8ac891ff0e29ddc67965423bee8f826219c6eb0f", "https://github.com/sigstore/cosign", "https://github.com/sigstore/cosign/releases/tag/v1.13.2", "https://github.com/sigstore/cosign/releases/tag/v2.2.1"], "aliases": ["CVE-2023-46737", "GHSA-vfp6-jrw2-99g9"], "assigner": "GitHub_M", "epss": 0.31, "enisaIdProduct": [{"id": "89d7b0ed-321b-3720-9bf2-0860f9346d4e", "product": {"name": "cosign"}, "product_version": "< 2.2.1"}], "enisaIdVendor": [{"id": "c664a3e2-9604-3410-aa3f-df27c1916de1", "vendor": {"name": "sigstore"}}], "isExploited": false}