{"id": "EUVD-2023-1785", "enisaUuid": "37c654f3-10c4-3fbb-bce9-ba4c9dead4b0", "description": "XWiki Platform is a generic wiki platform offering runtime services for applications built on top of it. By either creating a new or editing an existing document with an icon set, an attacker can inject XWiki syntax and Velocity code that is executed with programming rights and thus allows remote code execution. There are different attack vectors, the simplest is the Velocity code in the icon set's HTML or XWiki syntax definition. The [icon picker](https://extensions.xwiki.org/xwiki/bin/view/Extension/Icon%20Theme%20Application#HIconPicker) can be used to trigger the rendering of any icon set. The XWiki syntax variant of the icon set is also used without any escaping in some documents, allowing to inject XWiki syntax including script macros into a document that might have programming right, for this the currently used icon theme needs to be edited. Further, the HTML output of the icon set is output as JSON in the icon picker and this JSON is interpreted as XWiki syntax, allowing again the injection of script macros into a document with programming right and thus allowing remote code execution. This impacts the confidentiality, integrity and availability of the whole XWiki instance. This issue has been patched in XWiki 14.10.6 and 15.1. Icon themes now require script right and the code in the icon theme is executed within the context of the icon theme, preventing any rights escalation. A macro for displaying icons has been introduced to avoid injecting the raw wiki syntax of an icon set into another document. Users are advised to upgrade. There are no known workarounds for this vulnerability.\n", "datePublished": "2023-06-29T20:31:54", "dateUpdated": "2024-11-26T19:17:50", "baseScore": 10.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H", "references": ["https://github.com/xwiki/xwiki-platform/security/advisories/GHSA-fm68-j7ww-h9xf", "https://nvd.nist.gov/vuln/detail/CVE-2023-36470", "https://github.com/xwiki/xwiki-platform/commit/46b542854978e9caa687a5c2b8817b8b17877d94", "https://github.com/xwiki/xwiki-platform/commit/79418dd92ca11941b46987ef881bf50424898ff4", "https://github.com/xwiki/xwiki-platform/commit/b0cdfd893912baaa053d106a92e39fa1858843c7", "https://github.com/xwiki/xwiki-platform", "https://jira.xwiki.org/browse/XWIKI-20524"], "aliases": ["CVE-2023-36470", "GHSA-fm68-j7ww-h9xf"], "assigner": "GitHub_M", "epss": 14.17, "enisaIdProduct": [{"id": "2cee5c93-52ef-37e3-9e1c-9484905702d9", "product": {"name": "xwiki-platform"}, "product_version": "6.2-milestone-1, < 14.10.6"}], "enisaIdVendor": [{"id": "d173ecb8-0981-3030-9cf3-c483a81e26cb", "vendor": {"name": "xwiki"}}], "isExploited": false}