{"id": "EUVD-2023-2167", "enisaUuid": "0fc91276-6e3e-323e-b120-e44d8243a2aa", "description": "Winter is a free, open-source content management system (CMS) based on the Laravel PHP framework. Users with the `backend.manage_branding` permission can upload SVGs as the application logo. Prior to version 1.2.3, SVG uploads were not sanitized, which could have allowed a stored cross-site scripting (XSS) attack. To exploit the vulnerability, an attacker would already need to have developer or super user level permissions in Winter CMS. This means they would already have extensive access and control within the system. Additionally, to execute the XSS, the attacker would need to convince the victim to directly visit the URL of the maliciously uploaded SVG, and the application would have to be using local storage where uploaded files are served under the same domain as the application itself instead of a CDN. This is because all SVGs in Winter CMS are rendered through an `img` tag, which prevents any payloads from being executed directly. These two factors significantly limit the potential harm of this vulnerability. This issue has been patched in v1.2.3 through the inclusion of full support for SVG uploads and automatic sanitization of uploaded SVG files. As a workaround, one may apply the patches manually.", "datePublished": "2023-07-07T21:19:38", "dateUpdated": "2025-02-13T16:56:39", "baseScore": 2.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:H/UI:R/S:U/C:N/I:L/A:N", "references": ["https://github.com/wintercms/winter/security/advisories/GHSA-wjw2-4j7j-6gc3", "https://nvd.nist.gov/vuln/detail/CVE-2023-37269", "https://github.com/wintercms/storm/commit/186d85d8fea2cae43afc807d39f68553c24e56be", "https://github.com/wintercms/winter/commit/fa50b4c7489b67ea80072f8ac9fe5294fce1df1c", "https://github.com/wintercms/winter", "https://github.com/wintercms/winter/releases/tag/v1.2.3", "http://packetstormsecurity.com/files/173520/WinterCMS-1.2.2-Cross-Site-Scripting.html"], "aliases": ["CVE-2023-37269", "GHSA-wjw2-4j7j-6gc3"], "assigner": "GitHub_M", "epss": 1.09, "enisaIdProduct": [{"id": "c5ccfaf8-e6bb-3347-98b3-ea9d6ec1e084", "product": {"name": "winter"}, "product_version": "< 1.2.3"}], "enisaIdVendor": [{"id": "d0148c6e-1a99-3970-9d14-fcc6b8d4469e", "vendor": {"name": "wintercms"}}], "isExploited": false}