{"id": "EUVD-2023-35451", "enisaUuid": "782c8983-14e8-310e-b538-7193ad2845b0", "description": "libspdm is a sample implementation that follows the DMTF SPDM specifications. A vulnerability has been identified in SPDM session establishment in libspdm prior to version 2.3.1. If a device supports both DHE session and PSK session with mutual\nauthentication, the attacker may be able to establish the session with `KEY_EXCHANGE` and `PSK_FINISH` to bypass the mutual authentication. This is most likely to happen when the Requester begins a session using one method (DHE, for example) and then uses the other method's finish (PSK_FINISH in this example) to establish the session. The session hashes would be expected to fail in this case, but the condition was not detected.\n\nThis issue only impacts the SPDM responder, which supports `KEY_EX_CAP=1 and `PSK_CAP=10b` at same time with mutual authentication requirement. The SPDM requester is not impacted. The SPDM responder is not impacted if `KEY_EX_CAP=0` or `PSK_CAP=0` or `PSK_CAP=01b`. The SPDM responder is not impacted if mutual authentication is not required.\n\nlibspdm 1.0, 2.0, 2.1, 2.2, 2.3 are all impacted. Older branches are not maintained, but users of the 2.3 branch may receive a patch in version 2.3.2. The SPDM specification (DSP0274) does not contain this vulnerability.", "datePublished": "2023-05-08T20:05:29", "dateUpdated": "2025-01-28T20:53:07", "baseScore": 9.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:A/AC:L/PR:L/UI:N/S:C/C:H/I:H/A:H", "references": ["https://github.com/DMTF/libspdm/security/advisories/GHSA-qw76-4v8p-xq9f", "https://github.com/DMTF/libspdm/pull/2006", "https://github.com/DMTF/libspdm/pull/2007"], "aliases": ["CVE-2023-31127"], "assigner": "GitHub_M", "epss": 1.13, "enisaIdProduct": [{"id": "fe8a7658-8afb-38e8-b56d-423454d7acfa", "product": {"name": "libspdm"}, "product_version": "< 2.3.2"}], "enisaIdVendor": [{"id": "9a8cd9d2-9d76-3917-8acf-184dccb1cae5", "vendor": {"name": "DMTF"}}], "isExploited": false}