{"id": "EUVD-2023-29127", "enisaUuid": "98aa5bd1-7e09-3e82-8e0c-c647c00df354", "description": "TimescaleDB, an open-source time-series SQL database, has a privilege escalation vulnerability in versions 2.8.0 through 2.9.2. During installation, TimescaleDB creates a telemetry job that is runs as the installation user. The queries run as part of the telemetry data collection were not run with a locked down `search_path`, allowing malicious users to create functions that would be executed by the telemetry job, leading to privilege escalation. In order to be able to take advantage of this vulnerability, a user would need to be able to create objects in a database and then get a superuser to install TimescaleDB into their database. When TimescaleDB is installed as trusted extension, non-superusers can install the extension without help from a superuser.\n\nVersion 2.9.3 fixes this issue. As a mitigation, the `search_path` of the user running the telemetry job can be locked down to not include schemas writable by other users. The vulnerability is not exploitable on instances in Timescale Cloud and Managed Service for TimescaleDB due to additional security provisions in place on those platforms.", "datePublished": "2023-02-14T13:44:37", "dateUpdated": "2024-08-02T11:18:35", "baseScore": 8.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H", "references": ["https://www.suse.com/security/cve/CVE-2023-25149.html", "https://github.com/timescale/timescaledb/security/advisories/GHSA-44jh-j22r-33wq", "https://github.com/timescale/timescaledb/pull/5259", "https://github.com/timescale/timescaledb/releases/tag/2.9.3"], "aliases": ["CVE-2023-25149"], "assigner": "GitHub_M", "epss": 0.12, "enisaIdProduct": [{"id": "bd809ccc-ae89-3855-a64c-7b3e77eb139b", "product": {"name": "timescaledb"}, "product_version": "2.8.0, < 2.9.3"}], "enisaIdVendor": [{"id": "5aed2f05-1d1b-3cee-aadd-efb0c29b1019", "vendor": {"name": "timescale"}}], "isExploited": false}