{"id": "EUVD-2023-3072", "enisaUuid": "10a55009-4e0b-3601-8bdc-5d0733386a22", "description": "XWiki Change Request is an XWiki application allowing to request changes on a wiki without publishing directly the changes. Change request allows to edit any page by default, and the changes are then exported in an XML file that anyone can download. So it's possible for an attacker to obtain password hash of users by performing an edit on the user profiles and then downloading the XML file that has been created. This is also true for any document that might contain password field and that a user can view.\nThis vulnerability impacts all version of Change Request, but the impact depends on the rights that has been set on the wiki since it requires for the user to have the Change request right (allowed by default) and view rights on the page to target. This issue cannot be easily exploited in an automated way. The patch consists in denying to users the right of editing pages that contains a password field with change request. It means that already existing change request for those pages won't be removed by the patch, administrators needs to take care of it. The patch is provided in Change Request 1.10, administrators should upgrade immediately. It's possible to workaround the vulnerability by denying manually the Change request right on some spaces, such as XWiki space which will include any user profile by default.", "datePublished": "2023-12-04T22:33:59", "dateUpdated": "2024-11-27T16:01:05", "baseScore": 7.7, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:C/C:H/I:N/A:N", "references": ["https://github.com/xwiki-contrib/application-changerequest/security/advisories/GHSA-2fr7-cc7p-p45q", "https://nvd.nist.gov/vuln/detail/CVE-2023-49280", "https://github.com/xwiki-contrib/application-changerequest/commit/ff0f5368ea04f0e4aa7b33821c707dc68a8c5ca8", "https://github.com/xwiki-contrib/application-changerequest", "https://jira.xwiki.org/browse/CRAPP-302"], "aliases": ["CVE-2023-49280", "GHSA-2fr7-cc7p-p45q"], "assigner": "GitHub_M", "epss": 0.92, "enisaIdProduct": [{"id": "1a1025bc-3158-3fb7-a4f7-44cf20f1977d", "product": {"name": "application-changerequest"}, "product_version": "0.1, < 1.10"}], "enisaIdVendor": [{"id": "25b3eec7-4a8f-398b-80e8-c46536677791", "vendor": {"name": "xwiki-contrib"}}], "isExploited": false}