{"id": "EUVD-2023-41185", "enisaUuid": "4bb363a7-e1a8-31e9-a34c-e7ac6baaaa83", "description": "Auto-GPT is an experimental open-source application showcasing the capabilities of the GPT-4 language model. When Auto-GPT is executed directly on the host system via the provided run.sh or run.bat files, custom Python code execution is sandboxed using a temporary dedicated docker container which should not have access to any files outside of the Auto-GPT workspace directory.\nBefore v0.4.3, the `execute_python_code` command (introduced in v0.4.1) does not sanitize the `basename` arg before writing LLM-supplied code to a file with an LLM-supplied name. This allows for a path traversal attack that can overwrite any .py file outside the workspace directory by specifying a `basename` such as `../../../main.py`. This can further be abused to achieve arbitrary code execution on the host running Auto-GPT by e.g. overwriting autogpt/main.py which will be executed outside of the docker environment meant to sandbox custom python code execution the next time Auto-GPT is started. The issue has been patched in version 0.4.3. As a workaround, the risk introduced by this vulnerability can be remediated by running Auto-GPT in a virtual machine, or another environment in which damage to files or corruption of the program is not a critical problem.", "datePublished": "2023-07-13T22:33:41", "dateUpdated": "2024-10-30T15:53:58", "baseScore": 7.6, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:H/PR:L/UI:R/S:C/C:H/I:H/A:H", "references": ["https://github.com/Significant-Gravitas/Auto-GPT/security/advisories/GHSA-5h38-mgp9-rj5f", "https://github.com/Significant-Gravitas/Auto-GPT/pull/4756"], "aliases": ["CVE-2023-37274"], "assigner": "GitHub_M", "epss": 0.06, "enisaIdProduct": [{"id": "621e8289-8dc1-32ae-9628-5fbc3863dd62", "product": {"name": "Auto-GPT"}, "product_version": "< 0.4.3"}], "enisaIdVendor": [{"id": "15395453-0e11-31dd-9473-e44c5f4c4280", "vendor": {"name": "Significant-Gravitas"}}], "isExploited": false}