{"id": "EUVD-2023-2866", "enisaUuid": "efe60dfd-8db8-3654-9453-b01885bfbe28", "description": "Fides is an open-source privacy engineering platform for managing the fulfillment of data privacy requests in your runtime environment, and the enforcement of privacy regulations in your code. The Fides web application allows data subject users to request access to their personal data. If the request is approved by the data controller user operating the Fides web application, the data subject's personal data can then retrieved from connected systems and data stores before being bundled together as a data subject access request package for the data subject to download. Supported data formats for the package include json and csv, but the most commonly used format is a series of HTML files compressed in a ZIP file. Once downloaded and unzipped, the data subject user can browse the HTML files on their local machine. It was identified that there was no validation of input coming from e.g. the connected systems and data stores which is later reflected in the downloaded data. This can result in an HTML injection that can be abused e.g. for phishing attacks or malicious JavaScript code execution, but only in the context of the data subject's browser accessing a HTML page using the `file://` protocol. Exploitation is limited to rogue Admin UI users, malicious connected system / data store users, and the data subject user if tricked via social engineering into submitting malicious data themselves. This vulnerability has been patched in version 2.23.3.", "datePublished": "2023-11-08T21:50:45", "dateUpdated": "2024-09-04T14:04:23", "baseScore": 4.3, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:H/UI:R/S:U/C:L/I:L/A:L", "references": ["https://github.com/ethyca/fides/security/advisories/GHSA-3vpf-mcj7-5h38", "https://nvd.nist.gov/vuln/detail/CVE-2023-47114", "https://github.com/ethyca/fides/commit/50360a0e24aac858459806bb140bb1c4b71e67a1", "https://github.com/ethyca/fides", "https://github.com/ethyca/fides/releases/tag/2.23.3"], "aliases": ["CVE-2023-47114", "GHSA-3vpf-mcj7-5h38"], "assigner": "GitHub_M", "epss": 0.19, "enisaIdProduct": [{"id": "4f375f32-34ff-343b-8d64-fbdbe524ab26", "product": {"name": "fides"}, "product_version": "2.15.1, < 2.23.3"}], "enisaIdVendor": [{"id": "b4fe2a6f-9f91-3aa8-b62f-b8ed82be9bc6", "vendor": {"name": "ethyca"}}], "isExploited": false}