{"id": "EUVD-2023-46375", "enisaUuid": "47be7286-5fe4-36da-8ec3-00cf3a82ef9d", "description": "Home assistant is an open source home automation. Whilst auditing the frontend code to identify hidden parameters, Cure53 detected `auth_callback=1`, which is leveraged by the WebSocket authentication logic in tandem with the `state` parameter. The state parameter contains the `hassUrl`, which is subsequently utilized to establish a WebSocket connection. This behavior permits an attacker to create a malicious Home Assistant link with a modified state parameter that forces the frontend to connect to an alternative WebSocket backend. Henceforth, the attacker can spoof any WebSocket responses and trigger cross site scripting (XSS). Since the XSS is executed on the actual Home Assistant frontend domain, it can connect to the real Home Assistant backend, which essentially represents a comprehensive takeover scenario. Permitting the site to be iframed by other origins, as discussed in GHSA-935v-rmg9-44mw, renders this exploit substantially covert since a malicious website can obfuscate the compromise strategy in the background. However, even without this, the attacker can still send the `auth_callback` link directly to the victim user. To mitigate this issue, Cure53 advises modifying the WebSocket code’s authentication flow. An optimal implementation in this regard would not trust the `hassUrl` passed in by a GET parameter. Cure53 must stipulate the significant time required of the Cure53 consultants to identify an XSS vector, despite holding full control over the WebSocket responses. In many areas, data from the WebSocket was properly sanitized, which hinders post-exploitation. The audit team eventually detected the `js_url` for custom panels, though generally, the frontend exhibited reasonable security hardening. This issue has been addressed in Home Assistant Core version 2023.8.0 and in the npm package home-assistant-js-websocket in version 8.2.0. Users are advised to upgrade. There are no known workarounds for this vulnerability.", "datePublished": "2023-10-19T22:30:49", "dateUpdated": "2024-09-12T15:06:52", "baseScore": 7.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:R/S:U/C:H/I:H/A:H", "references": ["https://github.com/home-assistant/core/security/advisories/GHSA-cr83-q7r2-7f5q", "https://github.com/home-assistant/core/security/advisories/GHSA-935v-rmg9-44mw"], "aliases": ["CVE-2023-41896"], "assigner": "GitHub_M", "epss": 0.15, "enisaIdProduct": [{"id": "888850a0-09df-3e4b-871a-b9e0e9fbdd88", "product": {"name": "core"}, "product_version": "home-assistant-js-websocket: < 8.2.0"}, {"id": "ccf05760-807a-3d03-942d-ce88edba9118", "product": {"name": "core"}, "product_version": "Home Assistant Core : < 2023.8.0"}], "enisaIdVendor": [{"id": "d3a274a8-6974-385a-a1de-c4247634fc92", "vendor": {"name": "home-assistant"}}], "isExploited": false}