{"id": "EUVD-2023-26652", "enisaUuid": "1acee22b-32bf-33da-a296-544f0aa91364", "description": "This High severity DoS (Denial of Service) vulnerability was introduced in version 5.6.0 of Confluence Data Center and Server. With a CVSS Score of 7.5, this vulnerability allows an unauthenticated attacker to cause a resource to be unavailable for its intended users by temporarily or indefinitely disrupting services of a vulnerable host (Confluence instance) connected to a network, which has no impact to confidentiality, no impact to integrity, high impact to availability, and requires no user interaction. Atlassian recommends that Confluence Data Center and Server customers upgrade to latest version, if you are unable to do so, upgrade your instance to one of the specified supported fixed versions: Confluence Data Center and Server 7.19: Upgrade to a release greater than or equal to 7.19.14 Confluence Data Center and Server 8.5: Upgrade to a release greater than or equal to 8.5.1 Confluence Data Center and Server 8.6 or above: No need to upgrade, you're already on a patched version See the release notes (https://confluence.atlassian.com/doc/confluence-release-notes-327.html ). You can download the latest version of Confluence Data Center and Server from the download center (https://www.atlassian.com/software/confluence/download-archives ]). This vulnerability was reported via our Bug Bounty program.", "datePublished": "2025-03-17T22:34:42", "dateUpdated": "2025-05-12T15:39:27", "baseScore": 7.5, "baseScoreVersion": "3.0", "baseScoreVector": "CVSS:3.0/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H", "references": ["https://nvd.nist.gov/vuln/detail/CVE-2023-22512", "https://confluence.atlassian.com/pages/viewpage.action?pageId=1283691616", "https://jira.atlassian.com/browse/CONFSERVER-91258"], "aliases": ["CVE-2023-22512"], "assigner": "atlassian", "epss": 6.99, "enisaIdProduct": [{"id": "5bdfa5e6-f297-3764-93e3-ebe10ee0d15e", "product": {"name": "Confluence Data Center"}, "product_version": "5.6.0"}, {"id": "6f896fdb-9f8c-3625-89e7-5a02bef5a7ef", "product": {"name": "Confluence Server"}, "product_version": "5.6.0"}], "enisaIdVendor": [{"id": "a6b8db3b-90b4-3ce4-b2be-bc00c6aeef32", "vendor": {"name": "Atlassian"}}], "isExploited": false}