{"id": "EUVD-2023-2666", "enisaUuid": "e23b5bf0-e656-3b9d-a84a-a6432b58fe4f", "description": "XWiki Rendering is a generic Rendering system that converts textual input in a given syntax into another syntax. The cleaning of attributes during XHTML rendering, introduced in version 14.6-rc-1, allowed the injection of arbitrary HTML code and thus cross-site scripting via invalid attribute names. This can be exploited, e.g., via the link syntax in any content that supports XWiki syntax like comments in XWiki. When a user moves the mouse over a malicious link, the malicious JavaScript code is executed in the context of the user session. When this user is a privileged user who has programming rights, this allows server-side code execution with programming rights, impacting the confidentiality, integrity and availability of the XWiki instance. While this attribute was correctly recognized as not allowed, the attribute was still printed with a prefix `data-xwiki-translated-attribute-` without further cleaning or validation. This problem has been patched in XWiki 14.10.4 and 15.0 RC1 by removing characters not allowed in data attributes and then validating the cleaned attribute again. There are no known workarounds apart from upgrading to a version including the fix.", "datePublished": "2023-10-25T16:53:25", "dateUpdated": "2024-09-17T13:38:24", "baseScore": 9.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:R/S:C/C:H/I:H/A:H", "references": ["https://github.com/xwiki/xwiki-rendering/security/advisories/GHSA-663w-2xp3-5739", "https://github.com/xwiki/xwiki-rendering/security/advisories/GHSA-6gf5-c898-7rxp", "https://nvd.nist.gov/vuln/detail/CVE-2023-37908", "https://github.com/xwiki/xwiki-rendering/commit/f4d5acac451dccaf276e69f0b49b72221eef5d2f", "https://github.com/xwiki/xwiki-rendering", "https://jira.xwiki.org/browse/XRENDERING-697"], "aliases": ["CVE-2023-37908", "GHSA-663w-2xp3-5739"], "assigner": "GitHub_M", "epss": 0.93, "enisaIdProduct": [{"id": "e7eca9f2-53ec-37b9-a1a2-5c7f01fec302", "product": {"name": "xwiki-rendering"}, "product_version": "14.6-rc-1, < 14.10.4"}], "enisaIdVendor": [{"id": "b950238d-52b4-3245-9f03-e1914781ccae", "vendor": {"name": "xwiki"}}], "isExploited": false}