{"id": "EUVD-2023-2176", "enisaUuid": "bf1856d5-c2be-3cd7-a7cc-2ee4142ca2e8", "description": "Kirby is a content management system. A vulnerability in versions prior to 3.5.8.3, 3.6.6.3, 3.7.5.2, 3.8.4.1, and 3.9.6 affects all Kirby sites that might have potential attackers in the group of authenticated Panel users or that allow external visitors to update a Kirby content file (e.g. via a contact or comment form). Kirby sites are *not* affected if they don't allow write access for untrusted users or visitors.\n\nA field injection in a content storage implementation is a type of vulnerability that allows attackers with content write access to overwrite content fields that the site developer didn't intend to be modified. In a Kirby site this can be used to alter site content, break site behavior or inject malicious data or code. The exact security risk depends on the field type and usage.\n\nKirby stores content of the site, of pages, files and users in text files by default. The text files use Kirby's KirbyData format where each field is separated by newlines and a line with four dashes (`----`). When reading a KirbyData file, the affected code first removed the Unicode BOM sequence from the file contents and afterwards split the content into fields by the field separator.\n\nWhen writing to a KirbyData file, field separators in field data are escaped to prevent user input from interfering with the field structure. However this escaping could be tricked by including a Unicode BOM sequence in a field separator (e.g. `--\\xEF\\xBB\\xBF--`). When writing, this was not detected as a separator, but because the BOM was removed during reading, it could be abused by attackers to inject other field data into content files.\n\nBecause each field can only be defined once per content file, this vulnerability only affects fields in the content file that were defined above the vulnerable user-writable field or not at all. Fields that are defined below the vulnerable field override the injected field content and were therefore already protected.\n\nThe problem has been patched in Kirby 3.5.8.3, 3.6.6.3, 3.7.5.2, 3.8.4.1, and 3.9.6. In all of the mentioned releases, the maintainers have fixed the affected code to only remove the Unicode BOM sequence at the beginning of the file. This fixes this vulnerability both for newly written as well as for existing content files.", "datePublished": "2023-07-27T14:31:00", "dateUpdated": "2024-10-17T13:05:58", "baseScore": 7.1, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:H/A:L", "references": ["https://github.com/getkirby/kirby/security/advisories/GHSA-x5mr-p6v4-wp93", "https://nvd.nist.gov/vuln/detail/CVE-2023-38488", "https://github.com/getkirby/kirby/commit/a1e0f81c799ddae1af91cf37216f8ded9cb93540", "https://github.com/getkirby/kirby", "https://github.com/getkirby/kirby/releases/tag/3.5.8.3", "https://github.com/getkirby/kirby/releases/tag/3.6.6.3", "https://github.com/getkirby/kirby/releases/tag/3.7.5.2", "https://github.com/getkirby/kirby/releases/tag/3.8.4.1", "https://github.com/getkirby/kirby/releases/tag/3.9.6"], "aliases": ["CVE-2023-38488", "GHSA-x5mr-p6v4-wp93"], "assigner": "GitHub_M", "epss": 0.07, "enisaIdProduct": [{"id": "252b8ffd-9411-32c5-ae96-675788d9954f", "product": {"name": "kirby"}, "product_version": "3.6.0, < 3.6.6.3"}, {"id": "850213a4-cd63-30c9-ab9f-a775e8e5ca2a", "product": {"name": "kirby"}, "product_version": "< 3.5.8.3"}, {"id": "8caf8b1e-e90f-3bb8-b622-d16babbd6692", "product": {"name": "kirby"}, "product_version": "3.8.0, < 3.8.41"}, {"id": "de3d0864-32ef-3261-ad95-4a3ee9303746", "product": {"name": "kirby"}, "product_version": "3.7.0, < 3.7.5.2"}, {"id": "f81e86e9-f89a-327a-ae94-d0a3041b6e80", "product": {"name": "kirby"}, "product_version": "3.9.0, < 3.9.6"}], "enisaIdVendor": [{"id": "544a4f59-fd9d-3f91-b693-7707995aa78c", "vendor": {"name": "getkirby"}}], "isExploited": false}