{"id": "EUVD-2023-2612", "enisaUuid": "7490786f-60ae-367a-9fbe-8a8bd6a7f06b", "description": "hyper-bump-it is a command line tool for updating the version in project files.`hyper-bump-it` reads a file glob pattern from the configuration file. That is combined with the project root directory to construct a full glob pattern that is used to find files that should be edited. These matched files should be contained within the project root directory, but that is not checked. This could result in changes being written to files outside of the project. The default behaviour of `hyper-bump-it` is to display the planned changes and prompt the user for confirmation before editing any files. However, the configuration file provides a field that can be used cause files to be edited without displaying the prompt. This issue has been fixed in release version 0.5.1. Users are advised to upgrade. Users that are unable to update from vulnerable versions, executing `hyper-bump-it` with the `--interactive` command line argument will ensure that all planned changes are displayed and prompt the user for confirmation before editing any files, even if the configuration file contains `show_confirm_prompt=true`.\n", "datePublished": "2023-09-04T17:19:28", "dateUpdated": "2024-09-27T15:22:50", "baseScore": 5.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:N/I:H/A:N", "references": ["https://github.com/plannigan/hyper-bump-it/security/advisories/GHSA-xc27-f9q3-4448", "https://nvd.nist.gov/vuln/detail/CVE-2023-41057", "https://github.com/plannigan/hyper-bump-it/pull/307", "https://github.com/plannigan/hyper-bump-it"], "aliases": ["CVE-2023-41057", "GHSA-xc27-f9q3-4448"], "assigner": "GitHub_M", "epss": 0.08, "enisaIdProduct": [{"id": "efb708ed-5c0e-3b8d-873c-f35575a67db7", "product": {"name": "hyper-bump-it"}, "product_version": "< 0.5.1"}], "enisaIdVendor": [{"id": "0da84f46-4541-3157-bc1f-e632ce1899d1", "vendor": {"name": "plannigan"}}], "isExploited": false}