{"id": "EUVD-2023-1938", "enisaUuid": "46bc7fce-b0a8-3738-ba08-a88e6d8fe671", "description": "Graylog is a free and open log management platform. In a multi-node Graylog cluster, after a user has explicitly logged out, a user session may still be used for API requests until it has reached its original expiry time. Each node maintains an in-memory cache of user sessions. Upon a cache-miss, the session is loaded from the database. After that, the node operates solely on the cached session. Modifications to sessions will update the cached version as well as the session persisted in the database. However, each node maintains their isolated version of the session. When the user logs out, the session is removed from the node-local cache and deleted from the database. The other nodes will however still use the cached session. These nodes will only fail to accept the session id if they intent to update the session in the database. They will then notice that the session is gone. This is true for most API requests originating from user interaction with the Graylog UI because these will lead to an update of the session's \"last access\" timestamp. If the session update is however prevented by setting the `X-Graylog-No-Session-Extension:true` header in the request, the node will consider the (cached) session valid until the session is expired according to its timeout setting. No session identifiers are leaked. After a user has logged out, the UI shows the login screen again, which gives the user the impression that their session is not valid anymore. However, if the session becomes compromised later, it can still be used to perform API requests against the Graylog cluster. The time frame for this is limited to the configured session lifetime, starting from the time when the user logged out. This issue has been addressed in versions 5.0.9 and 5.1.3. Users are advised to upgrade.\n\n\n", "datePublished": "2023-08-30T21:03:40", "dateUpdated": "2024-10-01T18:12:07", "baseScore": 2.6, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:H/PR:L/UI:R/S:U/C:L/I:N/A:N", "references": ["https://github.com/Graylog2/graylog2-server/security/advisories/GHSA-3fqm-frhg-7c85", "https://nvd.nist.gov/vuln/detail/CVE-2023-41041", "https://github.com/Graylog2/graylog2-server/commit/bb88f3d0b2b0351669ab32c60b595ab7242a3fe3", "https://github.com/Graylog2/graylog2-server/commit/ff90f3e2aa4ae2e0bb613d3236e52c40aa154b20", "https://github.com/Graylog2/graylog2-server"], "aliases": ["CVE-2023-41041", "GHSA-3fqm-frhg-7c85"], "assigner": "GitHub_M", "epss": 0.22, "enisaIdProduct": [{"id": "87d2e1bd-f187-368c-85ec-d6355e5dd3b0", "product": {"name": "graylog2-server"}, "product_version": "5.1.0, < 5.1.3"}, {"id": "cabec2ef-6cc6-3685-8688-3a0df7793841", "product": {"name": "graylog2-server"}, "product_version": "1.0.0, < 5.0.9"}], "enisaIdVendor": [{"id": "8827bb0c-fc7e-3b6a-ae74-2f8813158420", "vendor": {"name": "Graylog2"}}], "isExploited": false}