{"id": "EUVD-2023-23666", "enisaUuid": "f8caa3b8-6c5e-3cea-abb9-84ea5141a79c", "description": "An unprivileged (non-admin) user can exploit an Improper Access Control vulnerability in the Cloudflare WARP Client for Windows (<= 2022.12.582.0) to perform privileged operations with SYSTEM context by working with a combination of opportunistic locks (oplock) and symbolic links (which can both be created by an unprivileged user).\n\nAfter installing the Cloudflare WARP Client (admin privileges required), an MSI-Installer is placed under C:\\Windows\\Installer. The vulnerability lies in the repair function of this MSI.\n\nImpactAn unprivileged (non-admin) user can exploit this vulnerability to perform privileged operations with SYSTEM context, including deleting arbitrary files and reading arbitrary file content. This can lead to a variety of attacks, including the manipulation of system files and privilege escalation.\n\nPatchesA new installer with a fix that addresses this vulnerability was released in version 2023.3.381.0. While the WARP Client itself is not vulnerable (only the installer), users are encouraged to upgrade to the latest version and delete any older installers present in their systems.\n\n\n\n\n", "datePublished": "2023-04-05T15:22:56", "dateUpdated": "2025-02-10T18:02:41", "baseScore": 7.0, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:L/AC:H/PR:L/UI:N/S:U/C:H/I:H/A:H", "references": ["https://github.com/cloudflare/advisories/security/advisories/GHSA-hgxh-48m3-3gq7", "https://install.appcenter.ms/orgs/cloudflare/apps/1.1.1.1-windows-1/distribution_groups/release", "https://developers.cloudflare.com/warp-client/get-started/windows/"], "aliases": ["CVE-2023-1412"], "assigner": "cloudflare", "epss": 0.11, "enisaIdProduct": [{"id": "efd623f2-fcdc-3b40-b858-4ffe7cf803cf", "product": {"name": "WARP"}, "product_version": "A/0 ≤2022.5.309.0"}], "enisaIdVendor": [{"id": "f6b2e42d-1076-3e96-898f-d3567fe5484c", "vendor": {"name": "Cloudflare"}}], "isExploited": false}