{"id": "EUVD-2023-1524", "enisaUuid": "54980be8-fe72-31b3-b843-b6d4eb53225e", "description": "A program using swift-nio-http2 is vulnerable to a denial of service attack, caused by a network peer sending a specially crafted HTTP/2 frame. This attack affects all swift-nio-http2 versions from 1.0.0 to 1.19.1. This vulnerability is caused by a logical error when parsing a HTTP/2 HEADERS frame where the frame contains priority information without any other data. This logical error caused confusion about the size of the frame, leading to a parsing error. This parsing error immediately crashes the entire process. Sending a HEADERS frame with HTTP/2 priority information does not require any special permission, so any HTTP/2 connection peer may send such a frame. For clients, this means any server to which they connect may launch this attack. For servers, anyone they allow to connect to them may launch such an attack. The attack is low-effort: it takes very little resources to send an appropriately crafted frame. The impact on availability is high: receiving the frame immediately crashes the server, dropping all in-flight connections and causing the service to need to restart. It is straightforward for an attacker to repeatedly send appropriately crafted frames, so attackers require very few resources to achieve a substantial denial of service. The attack does not have any confidentiality or integrity risks in and of itself: swift-nio-http2 is parsing the frame in memory-safe code, so the crash is safe. However, sudden process crashes can lead to violations of invariants in services, so it is possible that this attack can be used to trigger an error condition that has confidentiality or integrity risks. The risk can be mitigated if untrusted peers can be prevented from communicating with the service. This mitigation is not available to many services. The issue is fixed by rewriting the parsing code to correctly handle the condition. The issue was found by automated fuzzing by oss-fuzz.", "datePublished": "2022-02-09T22:05:16", "dateUpdated": "2024-08-03T04:20:49", "baseScore": 7.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H", "references": ["https://github.com/apple/swift-nio-http2/security/advisories/GHSA-ccw9-q5h2-8c2w", "https://nvd.nist.gov/vuln/detail/CVE-2022-24666", "https://github.com/apple/swift-nio-http2/commit/93215774aa7d223a5ad5aa0b80453375d669fa8f", "https://github.com/apple/swift-nio-http2", "https://github.com/apple/swift-nio-http2/releases/tag/1.19.2"], "aliases": ["CVE-2022-24666", "GHSA-ccw9-q5h2-8c2w"], "assigner": "Swift", "epss": 2.59, "enisaIdProduct": [{"id": "018dee08-6f6f-3fb9-bbcc-9c0a6a7d4c14", "product": {"name": "SwiftNIO HTTP2"}, "product_version": "unspecified ≤1.19.1"}, {"id": "c3db8c28-a09a-3356-a5a1-5949a4815e61", "product": {"name": "SwiftNIO HTTP2"}, "product_version": "1.0.0 <unspecified"}], "enisaIdVendor": [{"id": "9d0b3e58-b397-3a8b-a557-4c323b252449", "vendor": {"name": "Swift Project"}}], "isExploited": false}