{"id": "EUVD-2023-1722", "enisaUuid": "45afeca5-2b21-3a1e-a376-ea0150b4d2c5", "description": "Improper detection of complete HTTP body decompression SwiftNIO Extras provides a pair of helpers for transparently decompressing received HTTP request or response bodies. These two objects (HTTPRequestDecompressor and HTTPResponseDecompressor) both failed to detect when the decompressed body was considered complete. If trailing junk data was appended to the HTTP message body, the code would repeatedly attempt to decompress this data and fail. This would lead to an infinite loop making no forward progress, leading to livelock of the system and denial-of-service. This issue can be triggered by any attacker capable of sending a compressed HTTP message. Most commonly this is HTTP servers, as compressed HTTP messages cannot be negotiated for HTTP requests, but it is possible that users have configured decompression for HTTP requests as well. The attack is low effort, and likely to be reached without requiring any privilege or system access. The impact on availability is high: the process immediately becomes unavailable but does not immediately crash, meaning that it is possible for the process to remain in this state until an administrator intervenes or an automated circuit breaker fires. If left unchecked this issue will very slowly exhaust memory resources due to repeated buffer allocation, but the buffers are not written to and so it is possible that the processes will not terminate for quite some time. This risk can be mitigated by removing transparent HTTP message decompression. The issue is fixed by correctly detecting the termination of the compressed body as reported by zlib and refusing to decompress further data. The issue was found by Vojtech Rylko (https://github.com/vojtarylko) and reported publicly on GitHub.", "datePublished": "2022-09-21T18:45:16", "dateUpdated": "2024-08-03T01:07:05", "baseScore": 7.5, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:N/A:H", "references": ["https://github.com/apple/swift-nio-extras/security/advisories/GHSA-773g-x274-8qmf", "https://nvd.nist.gov/vuln/detail/CVE-2022-3252", "https://github.com/apple/swift-nio-extras/pull/177", "https://github.com/apple/swift-nio-extras/pull/177/commits/359015de2c49e426c27b1d25dbf599b08a9d3ee6", "https://github.com/apple/swift-nio-extras"], "aliases": ["CVE-2022-3252", "GHSA-773g-x274-8qmf"], "assigner": "Swift", "epss": 0.32, "enisaIdProduct": [{"id": "20193fe3-9599-3d0f-9bb8-233e156a5cd7", "product": {"name": "SwiftNIO Extras"}, "product_version": "unspecified <1.14.0"}], "enisaIdVendor": [{"id": "7a919b70-6cec-3f2c-a05c-740fa43bd82d", "vendor": {"name": "Swift Project"}}], "isExploited": false}