{"id": "EUVD-2023-0598", "enisaUuid": "a29db717-3d17-32de-b28e-c4ddf19fd72b", "description": "A possible security vulnerability has been identified in Apache Kafka Connect API.\nThis requires access to a Kafka Connect worker, and the ability to create/modify connectors on it with an arbitrary Kafka client SASL JAAS config\nand a SASL-based security protocol, which has been possible on Kafka Connect clusters since Apache Kafka Connect 2.3.0.\nWhen configuring the connector via the Kafka Connect REST API, an authenticated operator can set the `sasl.jaas.config`\nproperty for any of the connector's Kafka clients to \"com.sun.security.auth.module.JndiLoginModule\", which can be done via the\n`producer.override.sasl.jaas.config`, `consumer.override.sasl.jaas.config`, or `admin.override.sasl.jaas.config` properties.\nThis will allow the server to connect to the attacker's LDAP server\nand deserialize the LDAP response, which the attacker can use to execute java deserialization gadget chains on the Kafka connect server.\nAttacker can cause unrestricted deserialization of untrusted data (or) RCE vulnerability when there are gadgets in the classpath.\n\nSince Apache Kafka 3.0.0, users are allowed to specify these properties in connector configurations for Kafka Connect clusters running with out-of-the-box\nconfigurations. Before Apache Kafka 3.0.0, users may not specify these properties unless the Kafka Connect cluster has been reconfigured with a connector\nclient override policy that permits them.\n\nSince Apache Kafka 3.4.0, we have added a system property (\"-Dorg.apache.kafka.disallowed.login.modules\") to disable the problematic login modules usage\nin SASL JAAS configuration. Also by default \"com.sun.security.auth.module.JndiLoginModule\" is disabled in Apache Kafka Connect 3.4.0. \n\nWe advise the Kafka Connect users to validate connector configurations and only allow trusted JNDI configurations. Also examine connector dependencies for \nvulnerable versions and either upgrade their connectors, upgrading that specific dependency, or removing the connectors as options for remediation. Finally,\nin addition to leveraging the \"org.apache.kafka.disallowed.login.modules\" system property, Kafka Connect users can also implement their own connector\nclient config override policy, which can be used to control which Kafka client properties can be overridden directly in a connector config and which cannot.\n", "datePublished": "2023-02-07T19:11:22", "dateUpdated": "2024-08-02T11:18:35", "baseScore": 8.8, "baseScoreVersion": "3.1", "baseScoreVector": "CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H", "references": ["https://nvd.nist.gov/vuln/detail/CVE-2023-25194", "https://hackerone.com/reports/1529790", "https://kafka.apache.org/cve-list", "https://lists.apache.org/thread/vy1c7fqcdqvq5grcqp6q5jyyb302khyz", "http://packetstormsecurity.com/files/173151/Apache-Druid-JNDI-Injection-Remote-Code-Execution.html", "https://www.suse.com/security/cve/CVE-2023-25194.html"], "aliases": ["CVE-2023-25194", "GHSA-26f8-x7cc-wqpc"], "assigner": "apache", "epss": 94.06, "enisaIdProduct": [{"id": "9946f35b-317b-3ad0-8de8-ab6ed8f35fcb", "product": {"name": "Apache Kafka Connect API"}, "product_version": "2.3.0 <3.4.0"}], "enisaIdVendor": [{"id": "b00fb8fb-06ef-3c26-a34a-20f59eae2a20", "vendor": {"name": "Apache Software Foundation"}}], "isExploited": false}